/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type WCHAR = u16;
pub type TCHAR = WCHAR;
pub type PTCHAR = *mut WCHAR;
pub type TBYTE = WCHAR;
pub type PTBYTE = *mut WCHAR;
pub type __uint64 = ::std::os::raw::c_ulonglong;
pub type BOOL = ::std::os::raw::c_int;
pub type CHAR = ::std::os::raw::c_char;
pub type INT8 = ::std::os::raw::c_schar;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type UINT8 = ::std::os::raw::c_uchar;
pub type BYTE = ::std::os::raw::c_uchar;
pub type SHORT = ::std::os::raw::c_short;
pub type INT16 = ::std::os::raw::c_short;
pub type USHORT = ::std::os::raw::c_ushort;
pub type UINT16 = ::std::os::raw::c_ushort;
pub type WORD = ::std::os::raw::c_ushort;
pub type INT = ::std::os::raw::c_int;
pub type INT32 = ::std::os::raw::c_int;
pub type UINT = ::std::os::raw::c_uint;
pub type UINT32 = ::std::os::raw::c_uint;
pub type LONG = ::std::os::raw::c_long;
pub type ULONG = ::std::os::raw::c_ulong;
pub type DWORD = ::std::os::raw::c_ulong;
pub type FLOAT = f32;
pub type PFLOAT = *mut FLOAT;
pub type PBOOL = *mut BOOL;
pub type LPBOOL = *mut BOOL;
pub type PBYTE = *mut BYTE;
pub type LPBYTE = *mut BYTE;
pub type PINT = *mut ::std::os::raw::c_int;
pub type LPINT = *mut ::std::os::raw::c_int;
pub type PWORD = *mut WORD;
pub type LPWORD = *mut WORD;
pub type LPLONG = *mut ::std::os::raw::c_long;
pub type PDWORD = *mut DWORD;
pub type LPDWORD = *mut DWORD;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type LONGLONG = ::std::os::raw::c_longlong;
pub type LONG64 = ::std::os::raw::c_longlong;
pub type INT64 = ::std::os::raw::c_longlong;
pub type ULONGLONG = __uint64;
pub type DWORDLONG = __uint64;
pub type ULONG64 = __uint64;
pub type DWORD64 = __uint64;
pub type UINT64 = __uint64;
pub type INT_PTR = ::std::os::raw::c_int;
pub type UINT_PTR = ::std::os::raw::c_uint;
pub type LONG_PTR = ::std::os::raw::c_long;
pub type ULONG_PTR = ::std::os::raw::c_ulong;
pub type DWORD_PTR = ULONG_PTR;
pub type PDWORD_PTR = *mut ULONG_PTR;
pub type SIZE_T = ULONG_PTR;
pub type PSIZE_T = *mut ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type PSSIZE_T = *mut LONG_PTR;
pub type WPARAM = UINT_PTR;
pub type LPARAM = LONG_PTR;
pub type LRESULT = LONG_PTR;
pub type LPCSTR = *const CHAR;
pub type LPSTR = *mut CHAR;
pub type PSTR = *mut CHAR;
pub type LPCWSTR = *const WCHAR;
pub type LPWSTR = *mut WCHAR;
pub type PTSTR = LPWSTR;
pub type LPTSTR = LPWSTR;
pub type PCTSTR = LPCWSTR;
pub type LPCTSTR = LPCWSTR;
pub type byte = ::std::os::raw::c_uchar;
pub type cs_byte = byte;
pub type boolean = ::std::os::raw::c_uchar;
pub type HRESULT = ::std::os::raw::c_long;
pub type HANDLE = ::std::os::raw::c_ulonglong;
pub type PHANDLE = *mut HANDLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HDC__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HDC__() {
    assert_eq!(
        ::std::mem::size_of::<HDC__>(),
        4usize,
        concat!("Size of: ", stringify!(HDC__))
    );
    assert_eq!(
        ::std::mem::align_of::<HDC__>(),
        4usize,
        concat!("Alignment of ", stringify!(HDC__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HDC__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HDC__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HDC = *mut HDC__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HBITMAP__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HBITMAP__() {
    assert_eq!(
        ::std::mem::size_of::<HBITMAP__>(),
        4usize,
        concat!("Size of: ", stringify!(HBITMAP__))
    );
    assert_eq!(
        ::std::mem::align_of::<HBITMAP__>(),
        4usize,
        concat!("Alignment of ", stringify!(HBITMAP__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HBITMAP__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HBITMAP__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HBITMAP = *mut HBITMAP__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HBRUSH__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HBRUSH__() {
    assert_eq!(
        ::std::mem::size_of::<HBRUSH__>(),
        4usize,
        concat!("Size of: ", stringify!(HBRUSH__))
    );
    assert_eq!(
        ::std::mem::align_of::<HBRUSH__>(),
        4usize,
        concat!("Alignment of ", stringify!(HBRUSH__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HBRUSH__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HBRUSH__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HBRUSH = *mut HBRUSH__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HPEN__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HPEN__() {
    assert_eq!(
        ::std::mem::size_of::<HPEN__>(),
        4usize,
        concat!("Size of: ", stringify!(HPEN__))
    );
    assert_eq!(
        ::std::mem::align_of::<HPEN__>(),
        4usize,
        concat!("Alignment of ", stringify!(HPEN__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HPEN__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HPEN__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HPEN = *mut HPEN__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HFONT__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HFONT__() {
    assert_eq!(
        ::std::mem::size_of::<HFONT__>(),
        4usize,
        concat!("Size of: ", stringify!(HFONT__))
    );
    assert_eq!(
        ::std::mem::align_of::<HFONT__>(),
        4usize,
        concat!("Alignment of ", stringify!(HFONT__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HFONT__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HFONT__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HFONT = *mut HFONT__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HINSTANCE__() {
    assert_eq!(
        ::std::mem::size_of::<HINSTANCE__>(),
        4usize,
        concat!("Size of: ", stringify!(HINSTANCE__))
    );
    assert_eq!(
        ::std::mem::align_of::<HINSTANCE__>(),
        4usize,
        concat!("Alignment of ", stringify!(HINSTANCE__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HINSTANCE__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HINSTANCE__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HINSTANCE = *mut HINSTANCE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HWND__() {
    assert_eq!(
        ::std::mem::size_of::<HWND__>(),
        4usize,
        concat!("Size of: ", stringify!(HWND__))
    );
    assert_eq!(
        ::std::mem::align_of::<HWND__>(),
        4usize,
        concat!("Alignment of ", stringify!(HWND__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HWND__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HWND__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HHOOK__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HHOOK__() {
    assert_eq!(
        ::std::mem::size_of::<HHOOK__>(),
        4usize,
        concat!("Size of: ", stringify!(HHOOK__))
    );
    assert_eq!(
        ::std::mem::align_of::<HHOOK__>(),
        4usize,
        concat!("Alignment of ", stringify!(HHOOK__))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HHOOK__>())).unused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HHOOK__),
            "::",
            stringify!(unused)
        )
    );
}
pub type HHOOK = *mut HHOOK__;
pub type HMODULE = HINSTANCE;
pub type COLORREF = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
    pub Data1: ::std::os::raw::c_ulong,
    pub Data2: ::std::os::raw::c_ushort,
    pub Data3: ::std::os::raw::c_ushort,
    pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
    assert_eq!(
        ::std::mem::size_of::<_GUID>(),
        16usize,
        concat!("Size of: ", stringify!(_GUID))
    );
    assert_eq!(
        ::std::mem::align_of::<_GUID>(),
        4usize,
        concat!("Alignment of ", stringify!(_GUID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data4)
        )
    );
}
pub type GUID = _GUID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
    pub DUMMYSTRUCTNAME: _LARGE_INTEGER__bindgen_ty_1,
    pub u: _LARGE_INTEGER__bindgen_ty_2,
    pub QuadPart: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
    pub LowPart: DWORD,
    pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_1>())).LowPart as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_1),
            "::",
            stringify!(LowPart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_1>())).HighPart as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_1),
            "::",
            stringify!(HighPart)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
    pub LowPart: DWORD,
    pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_2>())).LowPart as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_2),
            "::",
            stringify!(LowPart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_2>())).HighPart as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_2),
            "::",
            stringify!(HighPart)
        )
    );
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER() {
    assert_eq!(
        ::std::mem::size_of::<_LARGE_INTEGER>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER))
    );
    assert_eq!(
        ::std::mem::align_of::<_LARGE_INTEGER>(),
        8usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_LARGE_INTEGER>())).DUMMYSTRUCTNAME as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER),
            "::",
            stringify!(DUMMYSTRUCTNAME)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_LARGE_INTEGER>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_LARGE_INTEGER>())).QuadPart as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER),
            "::",
            stringify!(QuadPart)
        )
    );
}
impl ::std::fmt::Debug for _LARGE_INTEGER {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_LARGE_INTEGER {{ union }}")
    }
}
pub type LARGE_INTEGER = _LARGE_INTEGER;
pub type PVOID = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FLOATING_SAVE_AREA {
    pub ControlWord: DWORD,
    pub StatusWord: DWORD,
    pub TagWord: DWORD,
    pub ErrorOffset: DWORD,
    pub ErrorSelector: DWORD,
    pub DataOffset: DWORD,
    pub DataSelector: DWORD,
    pub RegisterArea: [BYTE; 80usize],
    pub Spare0: DWORD,
}
#[test]
fn bindgen_test_layout__FLOATING_SAVE_AREA() {
    assert_eq!(
        ::std::mem::size_of::<_FLOATING_SAVE_AREA>(),
        112usize,
        concat!("Size of: ", stringify!(_FLOATING_SAVE_AREA))
    );
    assert_eq!(
        ::std::mem::align_of::<_FLOATING_SAVE_AREA>(),
        4usize,
        concat!("Alignment of ", stringify!(_FLOATING_SAVE_AREA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).ControlWord as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(ControlWord)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).StatusWord as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(StatusWord)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).TagWord as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(TagWord)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).ErrorOffset as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(ErrorOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).ErrorSelector as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(ErrorSelector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).DataOffset as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(DataOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).DataSelector as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(DataSelector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).RegisterArea as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(RegisterArea)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOATING_SAVE_AREA>())).Spare0 as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOATING_SAVE_AREA),
            "::",
            stringify!(Spare0)
        )
    );
}
pub type FLOATING_SAVE_AREA = _FLOATING_SAVE_AREA;
pub type PFLOATING_SAVE_AREA = *mut FLOATING_SAVE_AREA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CONTEXT {
    pub ContextFlags: DWORD,
    pub Dr0: DWORD,
    pub Dr1: DWORD,
    pub Dr2: DWORD,
    pub Dr3: DWORD,
    pub Dr6: DWORD,
    pub Dr7: DWORD,
    pub FloatSave: FLOATING_SAVE_AREA,
    pub SegGs: DWORD,
    pub SegFs: DWORD,
    pub SegEs: DWORD,
    pub SegDs: DWORD,
    pub Edi: DWORD,
    pub Esi: DWORD,
    pub Ebx: DWORD,
    pub Edx: DWORD,
    pub Ecx: DWORD,
    pub Eax: DWORD,
    pub Ebp: DWORD,
    pub Eip: DWORD,
    pub SegCs: DWORD,
    pub EFlags: DWORD,
    pub Esp: DWORD,
    pub SegSs: DWORD,
    pub ExtendedRegisters: [BYTE; 512usize],
}
#[test]
fn bindgen_test_layout__CONTEXT() {
    assert_eq!(
        ::std::mem::size_of::<_CONTEXT>(),
        716usize,
        concat!("Size of: ", stringify!(_CONTEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<_CONTEXT>(),
        4usize,
        concat!("Alignment of ", stringify!(_CONTEXT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).ContextFlags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(ContextFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr6 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Dr7 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Dr7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).FloatSave as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(FloatSave)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegGs as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegGs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegFs as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegFs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegEs as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegEs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegDs as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegDs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Edi as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Edi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Esi as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Esi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Ebx as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Ebx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Edx as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Edx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Ecx as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Ecx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Eax as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Eax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Ebp as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Ebp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Eip as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Eip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegCs as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegCs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).EFlags as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(EFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).Esp as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(Esp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).SegSs as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(SegSs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CONTEXT>())).ExtendedRegisters as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTEXT),
            "::",
            stringify!(ExtendedRegisters)
        )
    );
}
pub type CONTEXT = _CONTEXT;
pub type PCONTEXT = *mut CONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD {
    pub ExceptionCode: DWORD,
    pub ExceptionFlags: DWORD,
    pub ExceptionRecord: *mut _EXCEPTION_RECORD,
    pub ExceptionAddress: PVOID,
    pub NumberParameters: DWORD,
    pub ExceptionInformation: [ULONG_PTR; 15usize],
}
#[test]
fn bindgen_test_layout__EXCEPTION_RECORD() {
    assert_eq!(
        ::std::mem::size_of::<_EXCEPTION_RECORD>(),
        88usize,
        concat!("Size of: ", stringify!(_EXCEPTION_RECORD))
    );
    assert_eq!(
        ::std::mem::align_of::<_EXCEPTION_RECORD>(),
        8usize,
        concat!("Alignment of ", stringify!(_EXCEPTION_RECORD))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).ExceptionCode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(ExceptionCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).ExceptionFlags as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(ExceptionFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).ExceptionRecord as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(ExceptionRecord)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).ExceptionAddress as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(ExceptionAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).NumberParameters as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(NumberParameters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_RECORD>())).ExceptionInformation as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_RECORD),
            "::",
            stringify!(ExceptionInformation)
        )
    );
}
pub type EXCEPTION_RECORD = _EXCEPTION_RECORD;
pub type PEXCEPTION_RECORD = *mut EXCEPTION_RECORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_POINTERS {
    pub ExceptionRecord: PEXCEPTION_RECORD,
    pub ContextRecord: PCONTEXT,
}
#[test]
fn bindgen_test_layout__EXCEPTION_POINTERS() {
    assert_eq!(
        ::std::mem::size_of::<_EXCEPTION_POINTERS>(),
        16usize,
        concat!("Size of: ", stringify!(_EXCEPTION_POINTERS))
    );
    assert_eq!(
        ::std::mem::align_of::<_EXCEPTION_POINTERS>(),
        8usize,
        concat!("Alignment of ", stringify!(_EXCEPTION_POINTERS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_POINTERS>())).ExceptionRecord as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_POINTERS),
            "::",
            stringify!(ExceptionRecord)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_EXCEPTION_POINTERS>())).ContextRecord as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_EXCEPTION_POINTERS),
            "::",
            stringify!(ContextRecord)
        )
    );
}
pub type EXCEPTION_POINTERS = _EXCEPTION_POINTERS;
pub type PEXCEPTION_POINTERS = *mut _EXCEPTION_POINTERS;
pub type REAL = f32;
pub type ARGB = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_ATTRIBUTES {
    pub nLength: DWORD,
    pub lpSecurityDescriptor: LPVOID,
    pub bInheritHandle: BOOL,
}
#[test]
fn bindgen_test_layout__SECURITY_ATTRIBUTES() {
    assert_eq!(
        ::std::mem::size_of::<_SECURITY_ATTRIBUTES>(),
        24usize,
        concat!("Size of: ", stringify!(_SECURITY_ATTRIBUTES))
    );
    assert_eq!(
        ::std::mem::align_of::<_SECURITY_ATTRIBUTES>(),
        8usize,
        concat!("Alignment of ", stringify!(_SECURITY_ATTRIBUTES))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).nLength as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(nLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).lpSecurityDescriptor as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(lpSecurityDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).bInheritHandle as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(bInheritHandle)
        )
    );
}
pub type SECURITY_ATTRIBUTES = _SECURITY_ATTRIBUTES;
pub type PSECURITY_ATTRIBUTES = *mut _SECURITY_ATTRIBUTES;
pub type LPSECURITY_ATTRIBUTES = *mut _SECURITY_ATTRIBUTES;
pub type FsContext = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FsColor {
    pub __bindgen_anon_1: FsColor__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union FsColor__bindgen_ty_1 {
    pub rgba: [f32; 4usize],
    pub __bindgen_anon_1: FsColor__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FsColor__bindgen_ty_1__bindgen_ty_1 {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[test]
fn bindgen_test_layout_FsColor__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<FsColor__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(FsColor__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<FsColor__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(FsColor__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsColor__bindgen_ty_1__bindgen_ty_1>())).r as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsColor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsColor__bindgen_ty_1__bindgen_ty_1>())).g as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FsColor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsColor__bindgen_ty_1__bindgen_ty_1>())).b as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsColor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsColor__bindgen_ty_1__bindgen_ty_1>())).a as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FsColor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(a)
        )
    );
}
#[test]
fn bindgen_test_layout_FsColor__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<FsColor__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(FsColor__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<FsColor__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(FsColor__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsColor__bindgen_ty_1>())).rgba as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsColor__bindgen_ty_1),
            "::",
            stringify!(rgba)
        )
    );
}
impl ::std::fmt::Debug for FsColor__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "FsColor__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_FsColor() {
    assert_eq!(
        ::std::mem::size_of::<FsColor>(),
        16usize,
        concat!("Size of: ", stringify!(FsColor))
    );
    assert_eq!(
        ::std::mem::align_of::<FsColor>(),
        4usize,
        concat!("Alignment of ", stringify!(FsColor))
    );
}
impl ::std::fmt::Debug for FsColor {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "FsColor {{ __bindgen_anon_1: {:?} }}",
            self.__bindgen_anon_1
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FsPaint {
    pub xform: [f32; 6usize],
    pub extent: [f32; 2usize],
    pub radius: f32,
    pub feather: f32,
    pub innerColor: FsColor,
    pub outerColor: FsColor,
    pub image: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FsPaint() {
    assert_eq!(
        ::std::mem::size_of::<FsPaint>(),
        76usize,
        concat!("Size of: ", stringify!(FsPaint))
    );
    assert_eq!(
        ::std::mem::align_of::<FsPaint>(),
        4usize,
        concat!("Alignment of ", stringify!(FsPaint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).xform as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(xform)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).extent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(extent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).radius as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).feather as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(feather)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).innerColor as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(innerColor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).outerColor as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(outerColor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPaint>())).image as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPaint),
            "::",
            stringify!(image)
        )
    );
}
impl ::std::fmt::Debug for FsPaint {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "FsPaint {{ xform: {:?}, extent: {:?}, radius: {:?}, feather: {:?}, innerColor: {:?}, outerColor: {:?}, image: {:?} }}" , self . xform , self . extent , self . radius , self . feather , self . innerColor , self . outerColor , self . image)
    }
}
pub const FsBlendFactor_FS_ZERO: FsBlendFactor = 1;
pub const FsBlendFactor_FS_ONE: FsBlendFactor = 2;
pub const FsBlendFactor_FS_SRC_COLOR: FsBlendFactor = 4;
pub const FsBlendFactor_FS_ONE_MINUS_SRC_COLOR: FsBlendFactor = 8;
pub const FsBlendFactor_FS_DST_COLOR: FsBlendFactor = 16;
pub const FsBlendFactor_FS_ONE_MINUS_DST_COLOR: FsBlendFactor = 32;
pub const FsBlendFactor_FS_SRC_ALPHA: FsBlendFactor = 64;
pub const FsBlendFactor_FS_ONE_MINUS_SRC_ALPHA: FsBlendFactor = 128;
pub const FsBlendFactor_FS_DST_ALPHA: FsBlendFactor = 256;
pub const FsBlendFactor_FS_ONE_MINUS_DST_ALPHA: FsBlendFactor = 512;
pub const FsBlendFactor_FS_SRC_ALPHA_SATURATE: FsBlendFactor = 1024;
pub type FsBlendFactor = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FsCompositeOperationState {
    pub srcRGB: ::std::os::raw::c_int,
    pub dstRGB: ::std::os::raw::c_int,
    pub srcAlpha: ::std::os::raw::c_int,
    pub dstAlpha: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FsCompositeOperationState() {
    assert_eq!(
        ::std::mem::size_of::<FsCompositeOperationState>(),
        16usize,
        concat!("Size of: ", stringify!(FsCompositeOperationState))
    );
    assert_eq!(
        ::std::mem::align_of::<FsCompositeOperationState>(),
        4usize,
        concat!("Alignment of ", stringify!(FsCompositeOperationState))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsCompositeOperationState>())).srcRGB as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsCompositeOperationState),
            "::",
            stringify!(srcRGB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsCompositeOperationState>())).dstRGB as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FsCompositeOperationState),
            "::",
            stringify!(dstRGB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsCompositeOperationState>())).srcAlpha as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsCompositeOperationState),
            "::",
            stringify!(srcAlpha)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<FsCompositeOperationState>())).dstAlpha as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FsCompositeOperationState),
            "::",
            stringify!(dstAlpha)
        )
    );
}
pub const FsClipMode_ClipModeReplace: FsClipMode = 0;
pub const FsClipMode_ClipModeIntersect: FsClipMode = 1;
pub const FsClipMode_ClipModeUnion: FsClipMode = 2;
pub const FsClipMode_ClipModeXor: FsClipMode = 3;
pub const FsClipMode_ClipModeExclude: FsClipMode = 4;
pub const FsClipMode_ClipModeComplement: FsClipMode = 5;
pub const FsClipMode_ClipModeIgnore: FsClipMode = 8;
pub const FsClipMode_ClipModeUse: FsClipMode = 16;
pub type FsClipMode = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FsScissor {
    pub xform: [f32; 6usize],
    pub extent: [f32; 2usize],
    pub use_: bool,
    pub set: bool,
    pub mode: FsClipMode,
}
#[test]
fn bindgen_test_layout_FsScissor() {
    assert_eq!(
        ::std::mem::size_of::<FsScissor>(),
        40usize,
        concat!("Size of: ", stringify!(FsScissor))
    );
    assert_eq!(
        ::std::mem::align_of::<FsScissor>(),
        4usize,
        concat!("Alignment of ", stringify!(FsScissor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsScissor>())).xform as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsScissor),
            "::",
            stringify!(xform)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsScissor>())).extent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FsScissor),
            "::",
            stringify!(extent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsScissor>())).use_ as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FsScissor),
            "::",
            stringify!(use_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsScissor>())).set as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(FsScissor),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsScissor>())).mode as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FsScissor),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FsVertex {
    pub x: f32,
    pub y: f32,
    pub u: f32,
    pub v: f32,
}
#[test]
fn bindgen_test_layout_FsVertex() {
    assert_eq!(
        ::std::mem::size_of::<FsVertex>(),
        16usize,
        concat!("Size of: ", stringify!(FsVertex))
    );
    assert_eq!(
        ::std::mem::align_of::<FsVertex>(),
        4usize,
        concat!("Alignment of ", stringify!(FsVertex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsVertex>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsVertex),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsVertex>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FsVertex),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsVertex>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsVertex),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsVertex>())).v as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FsVertex),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FsPath {
    pub first: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub closed: ::std::os::raw::c_uchar,
    pub nbevel: ::std::os::raw::c_int,
    pub fill: *mut FsVertex,
    pub nfill: ::std::os::raw::c_int,
    pub stroke: *mut FsVertex,
    pub nstroke: ::std::os::raw::c_int,
    pub winding: ::std::os::raw::c_int,
    pub convex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FsPath() {
    assert_eq!(
        ::std::mem::size_of::<FsPath>(),
        56usize,
        concat!("Size of: ", stringify!(FsPath))
    );
    assert_eq!(
        ::std::mem::align_of::<FsPath>(),
        8usize,
        concat!("Alignment of ", stringify!(FsPath))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).closed as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(closed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).nbevel as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(nbevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).fill as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(fill)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).nfill as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(nfill)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).stroke as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(stroke)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).nstroke as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(nstroke)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).winding as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(winding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FsPath>())).convex as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FsPath),
            "::",
            stringify!(convex)
        )
    );
}
extern "C" {
    pub fn fsRenderCreate(ctx: FsContext) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsRenderCreateTexture(
        ctx: FsContext,
        type_: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
        imageFlags: ::std::os::raw::c_int,
        data: *const ::std::os::raw::c_uchar,
        debugName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsRenderDeleteTexture(
        ctx: FsContext,
        image: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsRenderUpdateTexture(
        ctx: FsContext,
        image: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
        data: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsRenderGetTextureSize(
        ctx: FsContext,
        image: ::std::os::raw::c_int,
        w: *mut ::std::os::raw::c_int,
        h: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsRenderViewport(ctx: FsContext, width: f32, height: f32, devicePixelRatio: f32);
}
extern "C" {
    pub fn fsRenderCancel(ctx: FsContext);
}
extern "C" {
    pub fn fsRenderFlush(ctx: FsContext);
}
extern "C" {
    pub fn fsRenderFill(
        ctx: FsContext,
        paint: *mut FsPaint,
        compositeOperation: FsCompositeOperationState,
        scissor: *mut FsScissor,
        fringe: f32,
        bounds: *const f32,
        paths: *const FsPath,
        npaths: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn fsRenderStroke(
        ctx: FsContext,
        paint: *mut FsPaint,
        compositeOperation: FsCompositeOperationState,
        scissor: *mut FsScissor,
        fringe: f32,
        strokeWidth: f32,
        paths: *const FsPath,
        npaths: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn fsRenderTriangles(
        ctx: FsContext,
        paint: *mut FsPaint,
        compositeOperation: FsCompositeOperationState,
        scissor: *mut FsScissor,
        verts: *const FsVertex,
        nverts: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn fsRenderClearStencil(ctx: FsContext);
}
extern "C" {
    pub fn fsRenderDelete(ctx: FsContext);
}
pub const SURFACE_TYPE_SURFACE_TYPE_CONCRETE: SURFACE_TYPE = 0;
pub const SURFACE_TYPE_SURFACE_TYPE_GRASS: SURFACE_TYPE = 1;
pub const SURFACE_TYPE_SURFACE_TYPE_WATER: SURFACE_TYPE = 2;
pub const SURFACE_TYPE_SURFACE_TYPE_GRASS_BUMPY: SURFACE_TYPE = 3;
pub const SURFACE_TYPE_SURFACE_TYPE_ASPHALT: SURFACE_TYPE = 4;
pub const SURFACE_TYPE_SURFACE_TYPE_SHORT_GRASS: SURFACE_TYPE = 5;
pub const SURFACE_TYPE_SURFACE_TYPE_LONG_GRASS: SURFACE_TYPE = 6;
pub const SURFACE_TYPE_SURFACE_TYPE_HARD_TURF: SURFACE_TYPE = 7;
pub const SURFACE_TYPE_SURFACE_TYPE_SNOW: SURFACE_TYPE = 8;
pub const SURFACE_TYPE_SURFACE_TYPE_ICE: SURFACE_TYPE = 9;
pub const SURFACE_TYPE_SURFACE_TYPE_URBAN: SURFACE_TYPE = 10;
pub const SURFACE_TYPE_SURFACE_TYPE_FOREST: SURFACE_TYPE = 11;
pub const SURFACE_TYPE_SURFACE_TYPE_DIRT: SURFACE_TYPE = 12;
pub const SURFACE_TYPE_SURFACE_TYPE_CORAL: SURFACE_TYPE = 13;
pub const SURFACE_TYPE_SURFACE_TYPE_GRAVEL: SURFACE_TYPE = 14;
pub const SURFACE_TYPE_SURFACE_TYPE_OIL_TREATED: SURFACE_TYPE = 15;
pub const SURFACE_TYPE_SURFACE_TYPE_STEEL_MATS: SURFACE_TYPE = 16;
pub const SURFACE_TYPE_SURFACE_TYPE_BITUMINUS: SURFACE_TYPE = 17;
pub const SURFACE_TYPE_SURFACE_TYPE_BRICK: SURFACE_TYPE = 18;
pub const SURFACE_TYPE_SURFACE_TYPE_MACADAM: SURFACE_TYPE = 19;
pub const SURFACE_TYPE_SURFACE_TYPE_PLANKS: SURFACE_TYPE = 20;
pub const SURFACE_TYPE_SURFACE_TYPE_SAND: SURFACE_TYPE = 21;
pub const SURFACE_TYPE_SURFACE_TYPE_SHALE: SURFACE_TYPE = 22;
pub const SURFACE_TYPE_SURFACE_TYPE_TARMAC: SURFACE_TYPE = 23;
pub const SURFACE_TYPE_SURFACE_TYPE_WRIGHT_FLYER_TRACK: SURFACE_TYPE = 24;
pub const SURFACE_TYPE_SURFACE_TYPE_UNKNOWN: SURFACE_TYPE = 254;
pub const SURFACE_TYPE_SURFACE_TYPE_UNDEFINED: SURFACE_TYPE = 255;
pub type SURFACE_TYPE = ::std::os::raw::c_int;
pub type PSURFACE_TYPE = *mut SURFACE_TYPE;
pub const SURFACE_CONDITION_SURFACE_CONDITION_NORMAL: SURFACE_CONDITION = 0;
pub const SURFACE_CONDITION_SURFACE_CONDITION_WET: SURFACE_CONDITION = 1;
pub const SURFACE_CONDITION_SURFACE_CONDITION_ICY: SURFACE_CONDITION = 2;
pub const SURFACE_CONDITION_SURFACE_CONDITION_SNOW: SURFACE_CONDITION = 3;
pub const SURFACE_CONDITION_SURFACE_CONDITION_MAX: SURFACE_CONDITION = 4;
pub type SURFACE_CONDITION = ::std::os::raw::c_int;
pub const TOOLTIP_UNITS_TYPE_TOOLTIP_UNITS_TYPE_DEFAULT: TOOLTIP_UNITS_TYPE = 0;
pub const TOOLTIP_UNITS_TYPE_TOOLTIP_UNITS_TYPE_METRIC: TOOLTIP_UNITS_TYPE = 1;
pub const TOOLTIP_UNITS_TYPE_TOOLTIP_UNITS_TYPE_US: TOOLTIP_UNITS_TYPE = 2;
pub type TOOLTIP_UNITS_TYPE = ::std::os::raw::c_int;
pub type PPVOID = *mut PVOID;
pub type PUINT8 = *mut ::std::os::raw::c_uchar;
pub type PPUINT8 = *mut *mut ::std::os::raw::c_uchar;
pub type SINT8 = ::std::os::raw::c_schar;
pub type PSINT8 = *mut ::std::os::raw::c_schar;
pub type PPSINT8 = *mut *mut ::std::os::raw::c_schar;
pub type PUINT16 = *mut ::std::os::raw::c_ushort;
pub type PPUINT16 = *mut *mut ::std::os::raw::c_ushort;
pub type SINT16 = ::std::os::raw::c_short;
pub type PSINT16 = *mut ::std::os::raw::c_short;
pub type PPSINT16 = *mut *mut ::std::os::raw::c_short;
pub type SINT32 = ::std::os::raw::c_int;
pub type PSINT32 = *mut ::std::os::raw::c_int;
pub type PPSINT32 = *mut *mut ::std::os::raw::c_int;
pub type VAR8 = ::std::os::raw::c_uchar;
pub type PVAR8 = *mut ::std::os::raw::c_uchar;
pub type PPVAR8 = *mut *mut ::std::os::raw::c_uchar;
pub type VAR16 = ::std::os::raw::c_ushort;
pub type PVAR16 = *mut ::std::os::raw::c_ushort;
pub type PPVAR16 = *mut *mut ::std::os::raw::c_ushort;
pub type VAR32 = ::std::os::raw::c_uint;
pub type PVAR32 = *mut ::std::os::raw::c_uint;
pub type PPVAR32 = *mut *mut ::std::os::raw::c_uint;
pub type PPUINT32 = *mut *mut ::std::os::raw::c_uint;
pub type SINT64 = ::std::os::raw::c_longlong;
pub type PSINT64 = *mut ::std::os::raw::c_longlong;
pub type PPSINT64 = *mut *mut ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VAR64 {
    pub lo: VAR32,
    pub hi: VAR32,
}
#[test]
fn bindgen_test_layout_VAR64() {
    assert_eq!(
        ::std::mem::size_of::<VAR64>(),
        8usize,
        concat!("Size of: ", stringify!(VAR64))
    );
    assert_eq!(
        ::std::mem::align_of::<VAR64>(),
        4usize,
        concat!("Alignment of ", stringify!(VAR64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<VAR64>())).lo as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(VAR64), "::", stringify!(lo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<VAR64>())).hi as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(VAR64), "::", stringify!(hi))
    );
}
pub type PVAR64 = *mut VAR64;
pub type PPVAR64 = *mut *mut VAR64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UIF64 {
    pub f: UINT32,
    pub i: UINT32,
}
#[test]
fn bindgen_test_layout_UIF64() {
    assert_eq!(
        ::std::mem::size_of::<UIF64>(),
        8usize,
        concat!("Size of: ", stringify!(UIF64))
    );
    assert_eq!(
        ::std::mem::align_of::<UIF64>(),
        4usize,
        concat!("Alignment of ", stringify!(UIF64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF64>())).f as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(UIF64), "::", stringify!(f))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF64>())).i as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(UIF64), "::", stringify!(i))
    );
}
pub type PUIF4 = *mut UIF64;
pub type PPUIF64 = *mut *mut UIF64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SVAR64 {
    pub lo: UINT32,
    pub hi: SINT32,
}
#[test]
fn bindgen_test_layout_SVAR64() {
    assert_eq!(
        ::std::mem::size_of::<SVAR64>(),
        8usize,
        concat!("Size of: ", stringify!(SVAR64))
    );
    assert_eq!(
        ::std::mem::align_of::<SVAR64>(),
        4usize,
        concat!("Alignment of ", stringify!(SVAR64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SVAR64>())).lo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SVAR64),
            "::",
            stringify!(lo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SVAR64>())).hi as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SVAR64),
            "::",
            stringify!(hi)
        )
    );
}
pub type PSVAR64 = *mut SVAR64;
pub type PPSVAR64 = *mut *mut SVAR64;
pub type PPBOOL = *mut *mut ::std::os::raw::c_int;
pub type BOOL8 = VAR8;
pub type PBOOL8 = *mut VAR8;
pub type PPBOOL8 = *mut *mut VAR8;
pub type BOOL16 = VAR16;
pub type PBOOL16 = *mut VAR16;
pub type PPBOOL16 = *mut *mut VAR16;
pub type BOOL32 = VAR32;
pub type PBOOL32 = *mut VAR32;
pub type PPBOOL32 = *mut *mut VAR32;
pub type FLAGS = ::std::os::raw::c_int;
pub type PFLAGS = *mut ::std::os::raw::c_int;
pub type PPFLAGS = *mut *mut ::std::os::raw::c_int;
pub type FLAGS8 = VAR8;
pub type PFLAGS8 = *mut VAR8;
pub type PPFLAGS8 = *mut *mut VAR8;
pub type FLAGS16 = VAR16;
pub type PFLAGS16 = *mut VAR16;
pub type PPFLAGS16 = *mut *mut VAR16;
pub type FLAGS32 = VAR32;
pub type PFLAGS32 = *mut VAR32;
pub type PPFLAGS32 = *mut *mut VAR32;
pub type ENUM = ::std::os::raw::c_int;
pub type PENUM = *mut ::std::os::raw::c_int;
pub type PPENUM = *mut *mut ::std::os::raw::c_int;
pub type ENUM8 = VAR8;
pub type PENUM8 = *mut VAR8;
pub type PPENUM8 = *mut *mut VAR8;
pub type ENUM16 = VAR16;
pub type PENUM16 = *mut VAR16;
pub type PPENUM16 = *mut *mut VAR16;
pub type ENUM32 = VAR32;
pub type PENUM32 = *mut VAR32;
pub type PPENUM32 = *mut *mut VAR32;
pub type INDX = ::std::os::raw::c_int;
pub type PINDX = *mut ::std::os::raw::c_int;
pub type PPINDX = *mut *mut ::std::os::raw::c_int;
pub type INDX8 = VAR8;
pub type PINDX8 = *mut VAR8;
pub type PPINDX8 = *mut *mut VAR8;
pub type INDX16 = VAR16;
pub type PINDX16 = *mut VAR16;
pub type PPINDX16 = *mut *mut VAR16;
pub type INDX32 = VAR32;
pub type PINDX32 = *mut VAR32;
pub type PPINDX32 = *mut *mut VAR32;
pub type ID = ::std::os::raw::c_int;
pub type PID = *mut ::std::os::raw::c_int;
pub type PPID = *mut *mut ::std::os::raw::c_int;
pub type ID8 = VAR8;
pub type PID8 = *mut VAR8;
pub type PPID8 = *mut *mut VAR8;
pub type ID16 = VAR16;
pub type PID16 = *mut VAR16;
pub type PPID16 = *mut *mut VAR16;
pub type ID32 = VAR32;
pub type PID32 = *mut VAR32;
pub type PPID32 = *mut *mut VAR32;
pub type ERR = VAR32;
pub type PERR = *mut VAR32;
pub type PPERR = *mut *mut VAR32;
pub type UFRAC8 = UINT8;
pub type PUFRAC8 = *mut UINT8;
pub type PPUFRAC8 = *mut *mut UINT8;
pub type SFRAC8 = SINT8;
pub type PSFRAC8 = *mut SINT8;
pub type PPSFRAC8 = *mut *mut SINT8;
pub type UFRAC16 = UINT16;
pub type PUFRAC16 = *mut UINT16;
pub type PPUFRAC16 = *mut *mut UINT16;
pub type SFRAC16 = SINT16;
pub type PSFRAC16 = *mut SINT16;
pub type PPSFRAC16 = *mut *mut SINT16;
pub type UFRAC32 = UINT32;
pub type PUFRAC32 = *mut UINT32;
pub type PPUFRAC32 = *mut *mut UINT32;
pub type SFRAC32 = SINT32;
pub type PSFRAC32 = *mut SINT32;
pub type PPSFRAC32 = *mut *mut SINT32;
pub type FLOAT64 = f64;
pub type PFLOAT64 = *mut f64;
pub type PPFLOAT64 = *mut *mut f64;
pub type FLOAT32 = f32;
pub type PFLOAT32 = *mut f32;
pub type PPFLOAT32 = *mut *mut f32;
pub type UIF16 = UINT16;
pub type PUIF16 = *mut UINT16;
pub type PPUIF16 = *mut *mut UINT16;
pub type SIF16 = SINT16;
pub type PSIF16 = *mut SINT16;
pub type PPSIF16 = *mut *mut SINT16;
pub type UIF32 = UINT32;
pub type PUIF32 = *mut UINT32;
pub type PPUIF32 = *mut *mut UINT32;
pub type SIF32 = SINT32;
pub type PSIF32 = *mut SINT32;
pub type PPSIF32 = *mut *mut SINT32;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub union UIF48 {
    pub __bindgen_anon_1: UIF48__bindgen_ty_1,
    pub i64_: UINT64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UIF48__bindgen_ty_1 {
    pub pad: UINT16,
    pub f: UINT16,
    pub i: UINT32,
}
#[test]
fn bindgen_test_layout_UIF48__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<UIF48__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(UIF48__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<UIF48__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(UIF48__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF48__bindgen_ty_1>())).pad as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UIF48__bindgen_ty_1),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF48__bindgen_ty_1>())).f as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(UIF48__bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF48__bindgen_ty_1>())).i as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UIF48__bindgen_ty_1),
            "::",
            stringify!(i)
        )
    );
}
#[test]
fn bindgen_test_layout_UIF48() {
    assert_eq!(
        ::std::mem::size_of::<UIF48>(),
        8usize,
        concat!("Size of: ", stringify!(UIF48))
    );
    assert_eq!(
        ::std::mem::align_of::<UIF48>(),
        4usize,
        concat!("Alignment of ", stringify!(UIF48))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UIF48>())).i64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UIF48),
            "::",
            stringify!(i64_)
        )
    );
}
impl ::std::fmt::Debug for UIF48 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "UIF48 {{ union }}")
    }
}
pub type PUIF48 = *mut UIF48;
pub type PPUIF48 = *mut *mut UIF48;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub union SIF48 {
    pub __bindgen_anon_1: SIF48__bindgen_ty_1,
    pub i64_: SINT64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIF48__bindgen_ty_1 {
    pub pad: UINT16,
    pub f: UINT16,
    pub i: SINT32,
}
#[test]
fn bindgen_test_layout_SIF48__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<SIF48__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(SIF48__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<SIF48__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(SIF48__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SIF48__bindgen_ty_1>())).pad as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SIF48__bindgen_ty_1),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SIF48__bindgen_ty_1>())).f as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SIF48__bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SIF48__bindgen_ty_1>())).i as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SIF48__bindgen_ty_1),
            "::",
            stringify!(i)
        )
    );
}
#[test]
fn bindgen_test_layout_SIF48() {
    assert_eq!(
        ::std::mem::size_of::<SIF48>(),
        8usize,
        concat!("Size of: ", stringify!(SIF48))
    );
    assert_eq!(
        ::std::mem::align_of::<SIF48>(),
        4usize,
        concat!("Alignment of ", stringify!(SIF48))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SIF48>())).i64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SIF48),
            "::",
            stringify!(i64_)
        )
    );
}
impl ::std::fmt::Debug for SIF48 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "SIF48 {{ union }}")
    }
}
pub type PSIF48 = *mut SIF48;
pub type PPSIF48 = *mut *mut SIF48;
pub type SIF64 = SVAR64;
pub type PSIF64 = *mut SVAR64;
pub type PPSIF64 = *mut *mut SVAR64;
pub type PCHAR = *mut ::std::os::raw::c_char;
pub type PPCHAR = *mut PCHAR;
pub type STRING = CHAR;
pub type PSTRING = *mut CHAR;
pub type PPSTRING = *mut *mut CHAR;
pub type STRINGZ = CHAR;
pub type PSTRINGZ = *mut CHAR;
pub type PPSTRINGZ = *mut *mut CHAR;
pub type PCSTRINGZ = *const CHAR;
pub type PPCSTRINGZ = *mut *const CHAR;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct SUBSTRING {
    pub string: PSTRINGZ,
    pub leng: UINT32,
}
#[test]
fn bindgen_test_layout_SUBSTRING() {
    assert_eq!(
        ::std::mem::size_of::<SUBSTRING>(),
        12usize,
        concat!("Size of: ", stringify!(SUBSTRING))
    );
    assert_eq!(
        ::std::mem::align_of::<SUBSTRING>(),
        4usize,
        concat!("Alignment of ", stringify!(SUBSTRING))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SUBSTRING>())).string as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SUBSTRING),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SUBSTRING>())).leng as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SUBSTRING),
            "::",
            stringify!(leng)
        )
    );
}
pub type PSUBSTRING = *mut SUBSTRING;
pub type PPSUBSTRING = *mut *mut SUBSTRING;
pub type BCD16 = VAR16;
pub type PBCD16 = *mut VAR16;
pub type PPBCD16 = *mut *mut VAR16;
pub type BCO16 = VAR16;
pub type PBCO16 = *mut VAR16;
pub type PPBCO16 = *mut *mut VAR16;
pub type BCD32 = VAR32;
pub type PBCD32 = *mut VAR32;
pub type PPBCD32 = *mut *mut VAR32;
pub type BCO32 = VAR32;
pub type PBCO32 = *mut VAR32;
pub type PPBCO32 = *mut *mut VAR32;
pub type ANGL8 = VAR8;
pub type PANGL8 = *mut VAR8;
pub type PPANGL8 = *mut *mut VAR8;
pub type ANGL16 = VAR16;
pub type PANGL16 = *mut VAR16;
pub type PPANGL16 = *mut *mut VAR16;
pub type ANGL32 = VAR32;
pub type PANGL32 = *mut VAR32;
pub type PPANGL32 = *mut *mut VAR32;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub union ANGL48 {
    pub __bindgen_anon_1: ANGL48__bindgen_ty_1,
    pub i64_: UINT64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ANGL48__bindgen_ty_1 {
    pub pad: UINT16,
    pub lo: UINT16,
    pub hi: UINT32,
}
#[test]
fn bindgen_test_layout_ANGL48__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ANGL48__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ANGL48__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ANGL48__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ANGL48__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGL48__bindgen_ty_1>())).pad as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGL48__bindgen_ty_1),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGL48__bindgen_ty_1>())).lo as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGL48__bindgen_ty_1),
            "::",
            stringify!(lo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGL48__bindgen_ty_1>())).hi as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGL48__bindgen_ty_1),
            "::",
            stringify!(hi)
        )
    );
}
#[test]
fn bindgen_test_layout_ANGL48() {
    assert_eq!(
        ::std::mem::size_of::<ANGL48>(),
        8usize,
        concat!("Size of: ", stringify!(ANGL48))
    );
    assert_eq!(
        ::std::mem::align_of::<ANGL48>(),
        4usize,
        concat!("Alignment of ", stringify!(ANGL48))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGL48>())).i64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGL48),
            "::",
            stringify!(i64_)
        )
    );
}
impl ::std::fmt::Debug for ANGL48 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "ANGL48 {{ union }}")
    }
}
pub type PANGL48 = *mut ANGL48;
pub type PPANGL48 = *mut *mut ANGL48;
pub type SINT48 = ANGL48;
pub type PSINT48 = *mut ANGL48;
pub type PPSINT48 = *mut *mut ANGL48;
pub type RADIANS = FLOAT64;
pub type CNTR8 = VAR8;
pub type PCNTR8 = *mut VAR8;
pub type PPCNTR8 = *mut *mut VAR8;
pub type CNTR16 = VAR16;
pub type PCNTR16 = *mut VAR16;
pub type PPCNTR16 = *mut *mut VAR16;
pub type CNTR32 = VAR32;
pub type PCNTR32 = *mut VAR32;
pub type PPCNTR32 = *mut *mut VAR32;
pub type RCNTR8 = VAR8;
pub type PRCNTR8 = *mut VAR8;
pub type PPRCNTR8 = *mut *mut VAR8;
pub type RCNTR16 = VAR16;
pub type PRCNTR16 = *mut VAR16;
pub type PPRCNTR16 = *mut *mut VAR16;
pub type RCNTR32 = VAR32;
pub type PRCNTR32 = *mut VAR32;
pub type PPRCNTR32 = *mut *mut VAR32;
pub type SPARE8 = VAR8;
pub type SPARE16 = VAR16;
pub type SPARE32 = VAR32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct APP_VERSION {
    pub major: UINT32,
    pub minor: UINT32,
    pub build: UINT32,
}
#[test]
fn bindgen_test_layout_APP_VERSION() {
    assert_eq!(
        ::std::mem::size_of::<APP_VERSION>(),
        12usize,
        concat!("Size of: ", stringify!(APP_VERSION))
    );
    assert_eq!(
        ::std::mem::align_of::<APP_VERSION>(),
        4usize,
        concat!("Alignment of ", stringify!(APP_VERSION))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<APP_VERSION>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APP_VERSION),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<APP_VERSION>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(APP_VERSION),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<APP_VERSION>())).build as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(APP_VERSION),
            "::",
            stringify!(build)
        )
    );
}
pub type PAPP_VERSION = *mut APP_VERSION;
pub type PPAPP_VERSION = *mut *mut APP_VERSION;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLON {
    pub lat: SIF48,
    pub lon: ANGL48,
}
#[test]
fn bindgen_test_layout_LATLON() {
    assert_eq!(
        ::std::mem::size_of::<LATLON>(),
        16usize,
        concat!("Size of: ", stringify!(LATLON))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLON>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLON))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLON>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLON),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLON>())).lon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLON),
            "::",
            stringify!(lon)
        )
    );
}
impl ::std::fmt::Debug for LATLON {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "LATLON {{ lat: {:?}, lon: {:?} }}", self.lat, self.lon)
    }
}
pub type PLATLON = *mut LATLON;
pub type PPLATLON = *mut *mut LATLON;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LATLON32 {
    pub lat: SINT32,
    pub lon: ANGL32,
}
#[test]
fn bindgen_test_layout_LATLON32() {
    assert_eq!(
        ::std::mem::size_of::<LATLON32>(),
        8usize,
        concat!("Size of: ", stringify!(LATLON32))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLON32>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLON32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLON32>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLON32),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLON32>())).lon as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLON32),
            "::",
            stringify!(lon)
        )
    );
}
pub type PLATLON32 = *mut LATLON32;
pub type PPLATLON32 = *mut *mut LATLON32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALT {
    pub lat: SIF48,
    pub lon: ANGL48,
    pub alt: SIF48,
}
#[test]
fn bindgen_test_layout_LATLONALT() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALT>(),
        24usize,
        concat!("Size of: ", stringify!(LATLONALT))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALT>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT>())).lon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT>())).alt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT),
            "::",
            stringify!(alt)
        )
    );
}
impl ::std::fmt::Debug for LATLONALT {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LATLONALT {{ lat: {:?}, lon: {:?}, alt: {:?} }}",
            self.lat, self.lon, self.alt
        )
    }
}
pub type PLATLONALT = *mut LATLONALT;
pub type PPLATLONALT = *mut *mut LATLONALT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LATLONALT32 {
    pub lat: SINT32,
    pub lon: ANGL32,
    pub alt: SINT32,
}
#[test]
fn bindgen_test_layout_LATLONALT32() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALT32>(),
        12usize,
        concat!("Size of: ", stringify!(LATLONALT32))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALT32>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALT32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT32>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT32),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT32>())).lon as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT32),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALT32>())).alt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALT32),
            "::",
            stringify!(alt)
        )
    );
}
pub type PLATLONALT32 = *mut LATLONALT32;
pub type PPLATLONALT32 = *mut *mut LATLONALT32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _latlonalt_float32 {
    pub lat: FLOAT32,
    pub lon: FLOAT32,
    pub alt: FLOAT32,
}
#[test]
fn bindgen_test_layout__latlonalt_float32() {
    assert_eq!(
        ::std::mem::size_of::<_latlonalt_float32>(),
        12usize,
        concat!("Size of: ", stringify!(_latlonalt_float32))
    );
    assert_eq!(
        ::std::mem::align_of::<_latlonalt_float32>(),
        4usize,
        concat!("Alignment of ", stringify!(_latlonalt_float32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_latlonalt_float32>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_latlonalt_float32),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_latlonalt_float32>())).lon as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_latlonalt_float32),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_latlonalt_float32>())).alt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_latlonalt_float32),
            "::",
            stringify!(alt)
        )
    );
}
pub type LATLONALT_FLOAT32 = _latlonalt_float32;
pub type PLATLONALT_FLOAT32 = *mut _latlonalt_float32;
pub type PPLATLONALT_FLOAT32 = *mut *mut _latlonalt_float32;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct _llf64 {
    pub lat: FLOAT64,
    pub lon: FLOAT64,
}
#[test]
fn bindgen_test_layout__llf64() {
    assert_eq!(
        ::std::mem::size_of::<_llf64>(),
        16usize,
        concat!("Size of: ", stringify!(_llf64))
    );
    assert_eq!(
        ::std::mem::align_of::<_llf64>(),
        4usize,
        concat!("Alignment of ", stringify!(_llf64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_llf64>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_llf64),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_llf64>())).lon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_llf64),
            "::",
            stringify!(lon)
        )
    );
}
pub type LLF64 = _llf64;
pub type PLLF64 = *mut _llf64;
pub type PPLLF64 = *mut *mut _llf64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct _llaf64 {
    pub lat: FLOAT64,
    pub lon: FLOAT64,
    pub alt: FLOAT64,
}
#[test]
fn bindgen_test_layout__llaf64() {
    assert_eq!(
        ::std::mem::size_of::<_llaf64>(),
        24usize,
        concat!("Size of: ", stringify!(_llaf64))
    );
    assert_eq!(
        ::std::mem::align_of::<_llaf64>(),
        4usize,
        concat!("Alignment of ", stringify!(_llaf64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_llaf64>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_llaf64),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_llaf64>())).lon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_llaf64),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_llaf64>())).alt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_llaf64),
            "::",
            stringify!(alt)
        )
    );
}
pub type LLAF64 = _llaf64;
pub type PLLAF64 = *mut _llaf64;
pub type PPLLAF64 = *mut *mut _llaf64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ZXY48 {
    pub z: SIF48,
    pub x: SIF48,
    pub y: SIF48,
}
#[test]
fn bindgen_test_layout_ZXY48() {
    assert_eq!(
        ::std::mem::size_of::<ZXY48>(),
        24usize,
        concat!("Size of: ", stringify!(ZXY48))
    );
    assert_eq!(
        ::std::mem::align_of::<ZXY48>(),
        4usize,
        concat!("Alignment of ", stringify!(ZXY48))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ZXY48>())).z as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ZXY48), "::", stringify!(z))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ZXY48>())).x as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(ZXY48), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ZXY48>())).y as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ZXY48), "::", stringify!(y))
    );
}
impl ::std::fmt::Debug for ZXY48 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "ZXY48 {{ z: {:?}, x: {:?}, y: {:?} }}",
            self.z, self.x, self.y
        )
    }
}
pub type PZXY48 = *mut ZXY48;
pub type PPZXY48 = *mut *mut ZXY48;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct _FLOAT64_VECTOR3 {
    pub i: FLOAT64,
    pub j: FLOAT64,
    pub k: FLOAT64,
}
#[test]
fn bindgen_test_layout__FLOAT64_VECTOR3() {
    assert_eq!(
        ::std::mem::size_of::<_FLOAT64_VECTOR3>(),
        24usize,
        concat!("Size of: ", stringify!(_FLOAT64_VECTOR3))
    );
    assert_eq!(
        ::std::mem::align_of::<_FLOAT64_VECTOR3>(),
        4usize,
        concat!("Alignment of ", stringify!(_FLOAT64_VECTOR3))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOAT64_VECTOR3>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOAT64_VECTOR3),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOAT64_VECTOR3>())).j as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOAT64_VECTOR3),
            "::",
            stringify!(j)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOAT64_VECTOR3>())).k as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOAT64_VECTOR3),
            "::",
            stringify!(k)
        )
    );
}
pub type FLOAT64_VECTOR3 = _FLOAT64_VECTOR3;
pub type PFLOAT64_VECTOR3 = *mut _FLOAT64_VECTOR3;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct _FLOAT64_VECTOR2 {
    pub i: FLOAT64,
    pub j: FLOAT64,
}
#[test]
fn bindgen_test_layout__FLOAT64_VECTOR2() {
    assert_eq!(
        ::std::mem::size_of::<_FLOAT64_VECTOR2>(),
        16usize,
        concat!("Size of: ", stringify!(_FLOAT64_VECTOR2))
    );
    assert_eq!(
        ::std::mem::align_of::<_FLOAT64_VECTOR2>(),
        4usize,
        concat!("Alignment of ", stringify!(_FLOAT64_VECTOR2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOAT64_VECTOR2>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOAT64_VECTOR2),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FLOAT64_VECTOR2>())).j as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FLOAT64_VECTOR2),
            "::",
            stringify!(j)
        )
    );
}
pub type FLOAT64_VECTOR2 = _FLOAT64_VECTOR2;
pub type PFLOAT64_VECTOR2 = *mut _FLOAT64_VECTOR2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PBH32 {
    pub pitch: ANGL32,
    pub bank: ANGL32,
    pub heading: ANGL32,
}
#[test]
fn bindgen_test_layout_PBH32() {
    assert_eq!(
        ::std::mem::size_of::<PBH32>(),
        12usize,
        concat!("Size of: ", stringify!(PBH32))
    );
    assert_eq!(
        ::std::mem::align_of::<PBH32>(),
        4usize,
        concat!("Alignment of ", stringify!(PBH32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH32>())).pitch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH32),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH32>())).bank as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH32),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH32>())).heading as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH32),
            "::",
            stringify!(heading)
        )
    );
}
pub type PPBH32 = *mut PBH32;
pub type PPPBH32 = *mut *mut PBH32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PBH16 {
    pub pitch: ANGL16,
    pub bank: ANGL16,
    pub heading: ANGL16,
}
#[test]
fn bindgen_test_layout_PBH16() {
    assert_eq!(
        ::std::mem::size_of::<PBH16>(),
        6usize,
        concat!("Size of: ", stringify!(PBH16))
    );
    assert_eq!(
        ::std::mem::align_of::<PBH16>(),
        2usize,
        concat!("Alignment of ", stringify!(PBH16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH16>())).pitch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH16),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH16>())).bank as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH16),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBH16>())).heading as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PBH16),
            "::",
            stringify!(heading)
        )
    );
}
pub type PPBH16 = *mut PBH16;
pub type PPPBH16 = *mut *mut PBH16;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONBOX {
    pub top: SIF48,
    pub left: ANGL48,
    pub bottom: SIF48,
    pub right: ANGL48,
}
#[test]
fn bindgen_test_layout_LATLONBOX() {
    assert_eq!(
        ::std::mem::size_of::<LATLONBOX>(),
        32usize,
        concat!("Size of: ", stringify!(LATLONBOX))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONBOX>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONBOX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONBOX>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONBOX),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONBOX>())).left as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONBOX),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONBOX>())).bottom as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONBOX),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONBOX>())).right as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONBOX),
            "::",
            stringify!(right)
        )
    );
}
impl ::std::fmt::Debug for LATLONBOX {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LATLONBOX {{ top: {:?}, left: {:?}, bottom: {:?}, right: {:?} }}",
            self.top, self.left, self.bottom, self.right
        )
    }
}
pub type PLATLONBOX = *mut LATLONBOX;
pub type PPLATLONBOX = *mut *mut LATLONBOX;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LATLONRECT32 {
    pub north: SINT32,
    pub south: SINT32,
    pub east: ANGL32,
    pub west: ANGL32,
}
#[test]
fn bindgen_test_layout_LATLONRECT32() {
    assert_eq!(
        ::std::mem::size_of::<LATLONRECT32>(),
        16usize,
        concat!("Size of: ", stringify!(LATLONRECT32))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONRECT32>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONRECT32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECT32>())).north as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECT32),
            "::",
            stringify!(north)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECT32>())).south as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECT32),
            "::",
            stringify!(south)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECT32>())).east as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECT32),
            "::",
            stringify!(east)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECT32>())).west as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECT32),
            "::",
            stringify!(west)
        )
    );
}
pub type PLATLONRECT32 = *mut LATLONRECT32;
pub type PPLATLONRECT32 = *mut *mut LATLONRECT32;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct LATLONRECTF64 {
    pub north: FLOAT64,
    pub south: FLOAT64,
    pub east: FLOAT64,
    pub west: FLOAT64,
}
#[test]
fn bindgen_test_layout_LATLONRECTF64() {
    assert_eq!(
        ::std::mem::size_of::<LATLONRECTF64>(),
        32usize,
        concat!("Size of: ", stringify!(LATLONRECTF64))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONRECTF64>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONRECTF64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECTF64>())).north as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECTF64),
            "::",
            stringify!(north)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECTF64>())).south as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECTF64),
            "::",
            stringify!(south)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECTF64>())).east as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECTF64),
            "::",
            stringify!(east)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONRECTF64>())).west as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONRECTF64),
            "::",
            stringify!(west)
        )
    );
}
pub type PLATLONRECTF64 = *mut LATLONRECTF64;
pub type PPLATLONRECTF64 = *mut *mut LATLONRECTF64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LLAPBH {
    pub lla: LATLONALT,
    pub pbh: PBH32,
}
#[test]
fn bindgen_test_layout_LLAPBH() {
    assert_eq!(
        ::std::mem::size_of::<LLAPBH>(),
        36usize,
        concat!("Size of: ", stringify!(LLAPBH))
    );
    assert_eq!(
        ::std::mem::align_of::<LLAPBH>(),
        4usize,
        concat!("Alignment of ", stringify!(LLAPBH))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLAPBH>())).lla as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLAPBH),
            "::",
            stringify!(lla)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLAPBH>())).pbh as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LLAPBH),
            "::",
            stringify!(pbh)
        )
    );
}
impl ::std::fmt::Debug for LLAPBH {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "LLAPBH {{ lla: {:?}, pbh: {:?} }}", self.lla, self.pbh)
    }
}
pub type PLLAPBH = *mut LLAPBH;
pub type PPLLAPBH = *mut *mut LLAPBH;
#[repr(C)]
#[derive(Copy, Clone)]
pub union LATLONALTPBH {
    pub __bindgen_anon_1: LATLONALTPBH__bindgen_ty_1,
    pub __bindgen_anon_2: LATLONALTPBH__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALTPBH__bindgen_ty_1 {
    pub lat: SIF48,
    pub lon: ANGL48,
    pub alt: SIF48,
    pub pitch: ANGL32,
    pub bank: ANGL32,
    pub heading: ANGL32,
}
#[test]
fn bindgen_test_layout_LATLONALTPBH__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTPBH__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(LATLONALTPBH__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTPBH__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALTPBH__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).lat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).lon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).alt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).pitch as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).bank as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_1>())).heading as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_1),
            "::",
            stringify!(heading)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTPBH__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "LATLONALTPBH__bindgen_ty_1 {{ lat: {:?}, lon: {:?}, alt: {:?}, pitch: {:?}, bank: {:?}, heading: {:?} }}" , self . lat , self . lon , self . alt , self . pitch , self . bank , self . heading)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALTPBH__bindgen_ty_2 {
    pub lla: LATLONALT,
    pub pbh: PBH32,
}
#[test]
fn bindgen_test_layout_LATLONALTPBH__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTPBH__bindgen_ty_2>(),
        36usize,
        concat!("Size of: ", stringify!(LATLONALTPBH__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTPBH__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALTPBH__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_2>())).lla as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_2),
            "::",
            stringify!(lla)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTPBH__bindgen_ty_2>())).pbh as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTPBH__bindgen_ty_2),
            "::",
            stringify!(pbh)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTPBH__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LATLONALTPBH__bindgen_ty_2 {{ lla: {:?}, pbh: {:?} }}",
            self.lla, self.pbh
        )
    }
}
#[test]
fn bindgen_test_layout_LATLONALTPBH() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTPBH>(),
        36usize,
        concat!("Size of: ", stringify!(LATLONALTPBH))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTPBH>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALTPBH))
    );
}
impl ::std::fmt::Debug for LATLONALTPBH {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "LATLONALTPBH {{ union }}")
    }
}
pub type PLATLONALTPBH = *mut LATLONALTPBH;
pub type PPLATLONALTPBH = *mut *mut LATLONALTPBH;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALTTPO {
    pub time: UINT32,
    pub __bindgen_anon_1: LATLONALTTPO__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union LATLONALTTPO__bindgen_ty_1 {
    pub __bindgen_anon_1: LATLONALTTPO__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: LATLONALTTPO__bindgen_ty_1__bindgen_ty_2,
    pub llapbh: LATLONALTPBH,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALTTPO__bindgen_ty_1__bindgen_ty_1 {
    pub lat: SIF48,
    pub lon: ANGL48,
    pub alt: SIF48,
    pub pitch: ANGL32,
    pub bank: ANGL32,
    pub heading: ANGL32,
}
#[test]
fn bindgen_test_layout_LATLONALTTPO__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).lat as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).lon as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).alt as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).pitch as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).bank as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_1>())).heading as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(heading)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTTPO__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "LATLONALTTPO__bindgen_ty_1__bindgen_ty_1 {{ lat: {:?}, lon: {:?}, alt: {:?}, pitch: {:?}, bank: {:?}, heading: {:?} }}" , self . lat , self . lon , self . alt , self . pitch , self . bank , self . heading)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LATLONALTTPO__bindgen_ty_1__bindgen_ty_2 {
    pub lla: LATLONALT,
    pub pbh: PBH32,
}
#[test]
fn bindgen_test_layout_LATLONALTTPO__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_2>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_2>())).lla as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lla)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1__bindgen_ty_2>())).pbh as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(pbh)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTTPO__bindgen_ty_1__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LATLONALTTPO__bindgen_ty_1__bindgen_ty_2 {{ lla: {:?}, pbh: {:?} }}",
            self.lla, self.pbh
        )
    }
}
#[test]
fn bindgen_test_layout_LATLONALTTPO__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTTPO__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(LATLONALTTPO__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTTPO__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALTTPO__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LATLONALTTPO__bindgen_ty_1>())).llapbh as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO__bindgen_ty_1),
            "::",
            stringify!(llapbh)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTTPO__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "LATLONALTTPO__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_LATLONALTTPO() {
    assert_eq!(
        ::std::mem::size_of::<LATLONALTTPO>(),
        40usize,
        concat!("Size of: ", stringify!(LATLONALTTPO))
    );
    assert_eq!(
        ::std::mem::align_of::<LATLONALTTPO>(),
        4usize,
        concat!("Alignment of ", stringify!(LATLONALTTPO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LATLONALTTPO>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LATLONALTTPO),
            "::",
            stringify!(time)
        )
    );
}
impl ::std::fmt::Debug for LATLONALTTPO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LATLONALTTPO {{ time: {:?}, __bindgen_anon_1: {:?} }}",
            self.time, self.__bindgen_anon_1
        )
    }
}
pub type PLATLONALTTPO = *mut LATLONALTTPO;
pub type PPLATLONALTTPO = *mut *mut LATLONALTTPO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLA2416 {
    pub stream: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout_LLA2416() {
    assert_eq!(
        ::std::mem::size_of::<LLA2416>(),
        8usize,
        concat!("Size of: ", stringify!(LLA2416))
    );
    assert_eq!(
        ::std::mem::align_of::<LLA2416>(),
        1usize,
        concat!("Alignment of ", stringify!(LLA2416))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLA2416>())).stream as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA2416),
            "::",
            stringify!(stream)
        )
    );
}
pub type PLLA2416 = *mut LLA2416;
pub type PPLLA2416 = *mut *mut LLA2416;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LLA2424 {
    pub stream: [::std::os::raw::c_char; 9usize],
}
#[test]
fn bindgen_test_layout_LLA2424() {
    assert_eq!(
        ::std::mem::size_of::<LLA2424>(),
        9usize,
        concat!("Size of: ", stringify!(LLA2424))
    );
    assert_eq!(
        ::std::mem::align_of::<LLA2424>(),
        1usize,
        concat!("Alignment of ", stringify!(LLA2424))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLA2424>())).stream as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA2424),
            "::",
            stringify!(stream)
        )
    );
}
pub type PLLA2424 = *mut LLA2424;
pub type PPLLA2424 = *mut *mut LLA2424;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZ16 {
    pub x: SINT16,
    pub y: SINT16,
    pub z: SINT16,
}
#[test]
fn bindgen_test_layout_XYZ16() {
    assert_eq!(
        ::std::mem::size_of::<XYZ16>(),
        6usize,
        concat!("Size of: ", stringify!(XYZ16))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZ16>(),
        2usize,
        concat!("Alignment of ", stringify!(XYZ16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ16>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XYZ16), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ16>())).y as *const _ as usize },
        2usize,
        concat!("Offset of field: ", stringify!(XYZ16), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ16>())).z as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XYZ16), "::", stringify!(z))
    );
}
pub type PXYZ16 = *mut XYZ16;
pub type PPXYZ16 = *mut *mut XYZ16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZ32 {
    pub x: SINT32,
    pub y: SINT32,
    pub z: SINT32,
}
#[test]
fn bindgen_test_layout_XYZ32() {
    assert_eq!(
        ::std::mem::size_of::<XYZ32>(),
        12usize,
        concat!("Size of: ", stringify!(XYZ32))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZ32>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZ32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ32>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XYZ32), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ32>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XYZ32), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZ32>())).z as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(XYZ32), "::", stringify!(z))
    );
}
pub type PXYZ32 = *mut XYZ32;
pub type PPXYZ32 = *mut *mut XYZ32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xyz_float32 {
    pub x: FLOAT32,
    pub y: FLOAT32,
    pub z: FLOAT32,
}
#[test]
fn bindgen_test_layout__xyz_float32() {
    assert_eq!(
        ::std::mem::size_of::<_xyz_float32>(),
        12usize,
        concat!("Size of: ", stringify!(_xyz_float32))
    );
    assert_eq!(
        ::std::mem::align_of::<_xyz_float32>(),
        4usize,
        concat!("Alignment of ", stringify!(_xyz_float32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xyz_float32>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_xyz_float32),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xyz_float32>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_xyz_float32),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xyz_float32>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_xyz_float32),
            "::",
            stringify!(z)
        )
    );
}
pub type XYZ_FLOAT32 = _xyz_float32;
pub type PXYZ_FLOAT32 = *mut _xyz_float32;
pub type PPXYZ_FLOAT32 = *mut *mut _xyz_float32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EAN32 {
    pub east: SINT32,
    pub altit: SINT32,
    pub north: SINT32,
}
#[test]
fn bindgen_test_layout_EAN32() {
    assert_eq!(
        ::std::mem::size_of::<EAN32>(),
        12usize,
        concat!("Size of: ", stringify!(EAN32))
    );
    assert_eq!(
        ::std::mem::align_of::<EAN32>(),
        4usize,
        concat!("Alignment of ", stringify!(EAN32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EAN32>())).east as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EAN32),
            "::",
            stringify!(east)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EAN32>())).altit as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EAN32),
            "::",
            stringify!(altit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EAN32>())).north as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EAN32),
            "::",
            stringify!(north)
        )
    );
}
pub type PEAN32 = *mut EAN32;
pub type PPEAN32 = *mut *mut EAN32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XZF32 {
    pub x: FLOAT32,
    pub z: FLOAT32,
}
#[test]
fn bindgen_test_layout_XZF32() {
    assert_eq!(
        ::std::mem::size_of::<XZF32>(),
        8usize,
        concat!("Size of: ", stringify!(XZF32))
    );
    assert_eq!(
        ::std::mem::align_of::<XZF32>(),
        4usize,
        concat!("Alignment of ", stringify!(XZF32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XZF32>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XZF32), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XZF32>())).z as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XZF32), "::", stringify!(z))
    );
}
pub type PXZF32 = *mut XZF32;
pub type PPXZF32 = *mut *mut XZF32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XZ32 {
    pub x: SINT32,
    pub z: SINT32,
}
#[test]
fn bindgen_test_layout_XZ32() {
    assert_eq!(
        ::std::mem::size_of::<XZ32>(),
        8usize,
        concat!("Size of: ", stringify!(XZ32))
    );
    assert_eq!(
        ::std::mem::align_of::<XZ32>(),
        4usize,
        concat!("Alignment of ", stringify!(XZ32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XZ32>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XZ32), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XZ32>())).z as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XZ32), "::", stringify!(z))
    );
}
pub type PXZ32 = *mut XZ32;
pub type PPXZ32 = *mut *mut XZ32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EN32 {
    pub east: SINT32,
    pub north: SINT32,
}
#[test]
fn bindgen_test_layout_EN32() {
    assert_eq!(
        ::std::mem::size_of::<EN32>(),
        8usize,
        concat!("Size of: ", stringify!(EN32))
    );
    assert_eq!(
        ::std::mem::align_of::<EN32>(),
        4usize,
        concat!("Alignment of ", stringify!(EN32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EN32>())).east as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EN32),
            "::",
            stringify!(east)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EN32>())).north as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EN32),
            "::",
            stringify!(north)
        )
    );
}
pub type PEN32 = *mut EN32;
pub type PPEN32 = *mut *mut EN32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ANGLSINCOS16 {
    pub angle: ANGL16,
    pub sine: SFRAC16,
    pub cosine: SFRAC16,
}
#[test]
fn bindgen_test_layout_ANGLSINCOS16() {
    assert_eq!(
        ::std::mem::size_of::<ANGLSINCOS16>(),
        6usize,
        concat!("Size of: ", stringify!(ANGLSINCOS16))
    );
    assert_eq!(
        ::std::mem::align_of::<ANGLSINCOS16>(),
        2usize,
        concat!("Alignment of ", stringify!(ANGLSINCOS16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGLSINCOS16>())).angle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGLSINCOS16),
            "::",
            stringify!(angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGLSINCOS16>())).sine as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGLSINCOS16),
            "::",
            stringify!(sine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ANGLSINCOS16>())).cosine as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ANGLSINCOS16),
            "::",
            stringify!(cosine)
        )
    );
}
pub type PANGLSINCOS16 = *mut ANGLSINCOS16;
pub type PPANGLSINCOS16 = *mut *mut ANGLSINCOS16;
#[repr(C)]
#[derive(Copy, Clone)]
pub union XYZPBH {
    pub __bindgen_anon_1: XYZPBH__bindgen_ty_1,
    pub __bindgen_anon_2: XYZPBH__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZPBH__bindgen_ty_1 {
    pub x: SINT32,
    pub y: SINT32,
    pub z: SINT32,
    pub pitch: ANGL16,
    pub bank: ANGL16,
    pub heading: ANGL16,
}
#[test]
fn bindgen_test_layout_XYZPBH__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<XYZPBH__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(XYZPBH__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZPBH__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZPBH__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).pitch as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).bank as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_1>())).heading as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_1),
            "::",
            stringify!(heading)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZPBH__bindgen_ty_2 {
    pub xyz: XYZ32,
    pub pbh: PBH16,
}
#[test]
fn bindgen_test_layout_XYZPBH__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<XYZPBH__bindgen_ty_2>(),
        20usize,
        concat!("Size of: ", stringify!(XYZPBH__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZPBH__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZPBH__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_2>())).xyz as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_2),
            "::",
            stringify!(xyz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZPBH__bindgen_ty_2>())).pbh as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZPBH__bindgen_ty_2),
            "::",
            stringify!(pbh)
        )
    );
}
#[test]
fn bindgen_test_layout_XYZPBH() {
    assert_eq!(
        ::std::mem::size_of::<XYZPBH>(),
        20usize,
        concat!("Size of: ", stringify!(XYZPBH))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZPBH>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZPBH))
    );
}
impl ::std::fmt::Debug for XYZPBH {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "XYZPBH {{ union }}")
    }
}
pub type PXYZPBH = *mut XYZPBH;
pub type PPXYZPBH = *mut *mut XYZPBH;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XYZTPO {
    pub time: UINT32,
    pub __bindgen_anon_1: XYZTPO__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union XYZTPO__bindgen_ty_1 {
    pub __bindgen_anon_1: XYZTPO__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: XYZTPO__bindgen_ty_1__bindgen_ty_2,
    pub xyzpbh: XYZPBH,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZTPO__bindgen_ty_1__bindgen_ty_1 {
    pub x: SINT32,
    pub y: SINT32,
    pub z: SINT32,
    pub pitch: ANGL16,
    pub bank: ANGL16,
    pub heading: ANGL16,
}
#[test]
fn bindgen_test_layout_XYZTPO__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<XYZTPO__bindgen_ty_1__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZTPO__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).y as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).z as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).pitch as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).bank as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_1>())).heading as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(heading)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZTPO__bindgen_ty_1__bindgen_ty_2 {
    pub xyz: XYZ32,
    pub pbh: PBH16,
}
#[test]
fn bindgen_test_layout_XYZTPO__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<XYZTPO__bindgen_ty_1__bindgen_ty_2>(),
        20usize,
        concat!("Size of: ", stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZTPO__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_2>())).xyz as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(xyz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1__bindgen_ty_2>())).pbh as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(pbh)
        )
    );
}
#[test]
fn bindgen_test_layout_XYZTPO__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<XYZTPO__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(XYZTPO__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZTPO__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZTPO__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZTPO__bindgen_ty_1>())).xyzpbh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO__bindgen_ty_1),
            "::",
            stringify!(xyzpbh)
        )
    );
}
impl ::std::fmt::Debug for XYZTPO__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "XYZTPO__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_XYZTPO() {
    assert_eq!(
        ::std::mem::size_of::<XYZTPO>(),
        24usize,
        concat!("Size of: ", stringify!(XYZTPO))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZTPO>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZTPO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZTPO>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZTPO),
            "::",
            stringify!(time)
        )
    );
}
impl ::std::fmt::Debug for XYZTPO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "XYZTPO {{ time: {:?}, __bindgen_anon_1: {:?} }}",
            self.time, self.__bindgen_anon_1
        )
    }
}
pub type PXYZTPO = *mut XYZTPO;
pub type PPXYZTPO = *mut *mut XYZTPO;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct XYZF64_ {
    pub x: FLOAT64,
    pub y: FLOAT64,
    pub z: FLOAT64,
}
#[test]
fn bindgen_test_layout_XYZF64_() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64_>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64_))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64_>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZF64_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF64_>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64_),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF64_>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64_),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF64_>())).z as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64_),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XYZF64 {
    pub __bindgen_anon_1: XYZF64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union XYZF64__bindgen_ty_1 {
    pub __bindgen_anon_1: XYZF64__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: XYZF64__bindgen_ty_1__bindgen_ty_2,
    pub __bindgen_anon_3: XYZF64__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct XYZF64__bindgen_ty_1__bindgen_ty_1 {
    pub lon: FLOAT64,
    pub alt: FLOAT64,
    pub lat: FLOAT64,
}
#[test]
fn bindgen_test_layout_XYZF64__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_1>())).lon as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_1>())).alt as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_1>())).lat as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lat)
        )
    );
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct XYZF64__bindgen_ty_1__bindgen_ty_2 {
    pub x: FLOAT64,
    pub y: FLOAT64,
    pub z: FLOAT64,
}
#[test]
fn bindgen_test_layout_XYZF64__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_2>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_2>())).y as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_2>())).z as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct XYZF64__bindgen_ty_1__bindgen_ty_3 {
    pub pitch: FLOAT64,
    pub heading: FLOAT64,
    pub bank: FLOAT64,
}
#[test]
fn bindgen_test_layout_XYZF64__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64__bindgen_ty_1__bindgen_ty_3>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64__bindgen_ty_1__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_3>())).pitch as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_3>())).heading as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(heading)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<XYZF64__bindgen_ty_1__bindgen_ty_3>())).bank as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XYZF64__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(bank)
        )
    );
}
#[test]
fn bindgen_test_layout_XYZF64__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZF64__bindgen_ty_1))
    );
}
impl ::std::fmt::Debug for XYZF64__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "XYZF64__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_XYZF64() {
    assert_eq!(
        ::std::mem::size_of::<XYZF64>(),
        24usize,
        concat!("Size of: ", stringify!(XYZF64))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF64>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZF64))
    );
}
impl ::std::fmt::Debug for XYZF64 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "XYZF64 {{ __bindgen_anon_1: {:?} }}",
            self.__bindgen_anon_1
        )
    }
}
pub type PXYZF64 = *mut XYZF64;
pub type PPXYZF64 = *mut *mut XYZF64;
pub type POS3_FLOAT64 = XYZF64;
pub type VEL3_FLOAT64 = XYZF64;
pub type PVEL3_FLOAT64 = *mut XYZF64;
pub type PPVEL3_FLOAT64 = *mut *mut XYZF64;
pub type ACC3_FLOAT64 = XYZF64;
pub type ROT3_FLOAT64 = XYZF64;
pub type ROV3_FLOAT64 = XYZF64;
pub type ROA3_FLOAT64 = XYZF64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct XYF64 {
    pub x: FLOAT64,
    pub y: FLOAT64,
}
#[test]
fn bindgen_test_layout_XYF64() {
    assert_eq!(
        ::std::mem::size_of::<XYF64>(),
        16usize,
        concat!("Size of: ", stringify!(XYF64))
    );
    assert_eq!(
        ::std::mem::align_of::<XYF64>(),
        4usize,
        concat!("Alignment of ", stringify!(XYF64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYF64>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XYF64), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYF64>())).y as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(XYF64), "::", stringify!(y))
    );
}
pub type PXYF64 = *mut XYF64;
pub type PPXYF64 = *mut *mut XYF64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XYZF32 {
    pub x: FLOAT32,
    pub y: FLOAT32,
    pub z: FLOAT32,
    pub w: FLOAT32,
}
#[test]
fn bindgen_test_layout_XYZF32() {
    assert_eq!(
        ::std::mem::size_of::<XYZF32>(),
        16usize,
        concat!("Size of: ", stringify!(XYZF32))
    );
    assert_eq!(
        ::std::mem::align_of::<XYZF32>(),
        4usize,
        concat!("Alignment of ", stringify!(XYZF32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF32>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XYZF32), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF32>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XYZF32), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF32>())).z as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(XYZF32), "::", stringify!(z))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XYZF32>())).w as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(XYZF32), "::", stringify!(w))
    );
}
pub type PXYZF32 = *mut XYZF32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CXYZF32 {
    pub _base: XYZF32,
}
#[test]
fn bindgen_test_layout_CXYZF32() {
    assert_eq!(
        ::std::mem::size_of::<CXYZF32>(),
        16usize,
        concat!("Size of: ", stringify!(CXYZF32))
    );
    assert_eq!(
        ::std::mem::align_of::<CXYZF32>(),
        4usize,
        concat!("Alignment of ", stringify!(CXYZF32))
    );
}
pub type ANGLF64 = FLOAT64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct PBHF64 {
    pub pitch: ANGLF64,
    pub bank: ANGLF64,
    pub heading: ANGLF64,
}
#[test]
fn bindgen_test_layout_PBHF64() {
    assert_eq!(
        ::std::mem::size_of::<PBHF64>(),
        24usize,
        concat!("Size of: ", stringify!(PBHF64))
    );
    assert_eq!(
        ::std::mem::align_of::<PBHF64>(),
        4usize,
        concat!("Alignment of ", stringify!(PBHF64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBHF64>())).pitch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PBHF64),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBHF64>())).bank as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PBHF64),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PBHF64>())).heading as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PBHF64),
            "::",
            stringify!(heading)
        )
    );
}
pub type PPBHF64 = *mut PBHF64;
pub type PPPBHF64 = *mut *mut PBHF64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MATRIXF32 {
    pub __bindgen_anon_1: MATRIXF32__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union MATRIXF32__bindgen_ty_1 {
    pub __bindgen_anon_1: MATRIXF32__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: MATRIXF32__bindgen_ty_1__bindgen_ty_2,
    pub __bindgen_anon_3: MATRIXF32__bindgen_ty_1__bindgen_ty_3,
    pub m: [[FLOAT32; 4usize]; 4usize],
    pub mat: [[FLOAT32; 4usize]; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MATRIXF32__bindgen_ty_1__bindgen_ty_1 {
    pub x: XYZF32,
    pub y: XYZF32,
    pub z: XYZF32,
    pub w: XYZF32,
}
#[test]
fn bindgen_test_layout_MATRIXF32__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>())).y as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>())).z as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_1>())).w as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MATRIXF32__bindgen_ty_1__bindgen_ty_2 {
    pub m00: FLOAT32,
    pub m01: FLOAT32,
    pub m02: FLOAT32,
    pub m03: FLOAT32,
    pub m10: FLOAT32,
    pub m11: FLOAT32,
    pub m12: FLOAT32,
    pub m13: FLOAT32,
    pub m20: FLOAT32,
    pub m21: FLOAT32,
    pub m22: FLOAT32,
    pub m23: FLOAT32,
    pub m30: FLOAT32,
    pub m31: FLOAT32,
    pub m32: FLOAT32,
    pub m33: FLOAT32,
}
#[test]
fn bindgen_test_layout_MATRIXF32__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m00 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m00)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m01 as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m01)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m02 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m02)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m03 as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m03)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m10 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m10)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m11 as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m12 as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m13 as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m13)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m20 as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m20)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m21 as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m21)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m22 as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m22)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m23 as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m23)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m30 as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m30)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m31 as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m31)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m32 as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_2>())).m33 as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(m33)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MATRIXF32__bindgen_ty_1__bindgen_ty_3 {
    pub _11: FLOAT32,
    pub _12: FLOAT32,
    pub _13: FLOAT32,
    pub _14: FLOAT32,
    pub _21: FLOAT32,
    pub _22: FLOAT32,
    pub _23: FLOAT32,
    pub _24: FLOAT32,
    pub _31: FLOAT32,
    pub _32: FLOAT32,
    pub _33: FLOAT32,
    pub _34: FLOAT32,
    pub _41: FLOAT32,
    pub _42: FLOAT32,
    pub _43: FLOAT32,
    pub _44: FLOAT32,
}
#[test]
fn bindgen_test_layout_MATRIXF32__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._11 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._12 as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._13 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_13)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._14 as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_14)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._21 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_21)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._22 as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_22)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._23 as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_23)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._24 as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_24)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._31 as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_31)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._32 as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._33 as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_33)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._34 as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_34)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._41 as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_41)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._42 as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_42)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._43 as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_43)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1__bindgen_ty_3>()))._44 as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(_44)
        )
    );
}
#[test]
fn bindgen_test_layout_MATRIXF32__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MATRIXF32__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(MATRIXF32__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MATRIXF32__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(MATRIXF32__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1>())).m as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1),
            "::",
            stringify!(m)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MATRIXF32__bindgen_ty_1>())).mat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MATRIXF32__bindgen_ty_1),
            "::",
            stringify!(mat)
        )
    );
}
impl ::std::fmt::Debug for MATRIXF32__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "MATRIXF32__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_MATRIXF32() {
    assert_eq!(
        ::std::mem::size_of::<MATRIXF32>(),
        64usize,
        concat!("Size of: ", stringify!(MATRIXF32))
    );
    assert_eq!(
        ::std::mem::align_of::<MATRIXF32>(),
        4usize,
        concat!("Alignment of ", stringify!(MATRIXF32))
    );
}
impl ::std::fmt::Debug for MATRIXF32 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "MATRIXF32 {{ __bindgen_anon_1: {:?} }}",
            self.__bindgen_anon_1
        )
    }
}
pub type PMATRIXF32 = *mut MATRIXF32;
pub type ROTMTRXF64 = MATRIXF32;
pub type PROTMTRXF64 = *mut MATRIXF32;
pub type QUATERN_ROTMAT = MATRIXF32;
pub type PQUATERN_ROTMAT = *mut MATRIXF32;
pub type UNIPIX = SINT32;
pub type PUNIPIX = *mut SINT32;
pub type PPUNIPIX = *mut *mut SINT32;
pub type PIXEL = SINT32;
pub type PPIXEL = *mut SINT32;
pub type PPPIXEL = *mut *mut SINT32;
pub type UNICOL = VAR32;
pub type PUNICOL = *mut VAR32;
pub type PPUNICOL = *mut *mut VAR32;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct RGB15 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_RGB15() {
    assert_eq!(
        ::std::mem::size_of::<RGB15>(),
        2usize,
        concat!("Size of: ", stringify!(RGB15))
    );
    assert_eq!(
        ::std::mem::align_of::<RGB15>(),
        2usize,
        concat!("Alignment of ", stringify!(RGB15))
    );
}
impl RGB15 {
    #[inline]
    pub fn blue(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_blue(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn green(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_green(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn red(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_red(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn alpha(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_alpha(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        blue: UINT16,
        green: UINT16,
        red: UINT16,
        alpha: UINT16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let blue: u16 = unsafe { ::std::mem::transmute(blue) };
            blue as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let green: u16 = unsafe { ::std::mem::transmute(green) };
            green as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let red: u16 = unsafe { ::std::mem::transmute(red) };
            red as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let alpha: u16 = unsafe { ::std::mem::transmute(alpha) };
            alpha as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type PRGB15 = *mut RGB15;
pub type PPRGB15 = *mut *mut RGB15;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct RGB16 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_RGB16() {
    assert_eq!(
        ::std::mem::size_of::<RGB16>(),
        2usize,
        concat!("Size of: ", stringify!(RGB16))
    );
    assert_eq!(
        ::std::mem::align_of::<RGB16>(),
        2usize,
        concat!("Alignment of ", stringify!(RGB16))
    );
}
impl RGB16 {
    #[inline]
    pub fn blue(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_blue(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn green(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 6u8) as u16) }
    }
    #[inline]
    pub fn set_green(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn red(&self) -> UINT16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_red(&mut self, val: UINT16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        blue: UINT16,
        green: UINT16,
        red: UINT16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let blue: u16 = unsafe { ::std::mem::transmute(blue) };
            blue as u64
        });
        __bindgen_bitfield_unit.set(5usize, 6u8, {
            let green: u16 = unsafe { ::std::mem::transmute(green) };
            green as u64
        });
        __bindgen_bitfield_unit.set(11usize, 5u8, {
            let red: u16 = unsafe { ::std::mem::transmute(red) };
            red as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type PRGB16 = *mut RGB16;
pub type PPRGB16 = *mut *mut RGB16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGB24 {
    pub blue: UINT8,
    pub green: UINT8,
    pub red: UINT8,
}
#[test]
fn bindgen_test_layout_RGB24() {
    assert_eq!(
        ::std::mem::size_of::<RGB24>(),
        3usize,
        concat!("Size of: ", stringify!(RGB24))
    );
    assert_eq!(
        ::std::mem::align_of::<RGB24>(),
        1usize,
        concat!("Alignment of ", stringify!(RGB24))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB24>())).blue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB24),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB24>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB24),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB24>())).red as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB24),
            "::",
            stringify!(red)
        )
    );
}
pub type PRGB24 = *mut RGB24;
pub type PPRGB24 = *mut *mut RGB24;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGB32 {
    pub blue: UINT8,
    pub green: UINT8,
    pub red: UINT8,
    pub junk: UINT8,
}
#[test]
fn bindgen_test_layout_RGB32() {
    assert_eq!(
        ::std::mem::size_of::<RGB32>(),
        4usize,
        concat!("Size of: ", stringify!(RGB32))
    );
    assert_eq!(
        ::std::mem::align_of::<RGB32>(),
        1usize,
        concat!("Alignment of ", stringify!(RGB32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB32>())).blue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB32),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB32>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB32),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB32>())).red as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB32),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB32>())).junk as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB32),
            "::",
            stringify!(junk)
        )
    );
}
pub type PRGB32 = *mut RGB32;
pub type PPRGB32 = *mut *mut RGB32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGBA {
    pub blue: UINT8,
    pub green: UINT8,
    pub red: UINT8,
    pub alpha: UINT8,
}
#[test]
fn bindgen_test_layout_RGBA() {
    assert_eq!(
        ::std::mem::size_of::<RGBA>(),
        4usize,
        concat!("Size of: ", stringify!(RGBA))
    );
    assert_eq!(
        ::std::mem::align_of::<RGBA>(),
        1usize,
        concat!("Alignment of ", stringify!(RGBA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA>())).blue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA>())).red as *const _ as usize },
        2usize,
        concat!("Offset of field: ", stringify!(RGBA), "::", stringify!(red))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBA>())).alpha as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(RGBA),
            "::",
            stringify!(alpha)
        )
    );
}
pub type PRGBA = *mut RGBA;
pub type PPRGBA = *mut *mut RGBA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGB {
    pub red: UINT8,
    pub green: UINT8,
    pub blue: UINT8,
}
#[test]
fn bindgen_test_layout_RGB() {
    assert_eq!(
        ::std::mem::size_of::<RGB>(),
        3usize,
        concat!("Size of: ", stringify!(RGB))
    );
    assert_eq!(
        ::std::mem::align_of::<RGB>(),
        1usize,
        concat!("Alignment of ", stringify!(RGB))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB>())).red as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(RGB), "::", stringify!(red))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(RGB),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGB>())).blue as *const _ as usize },
        2usize,
        concat!("Offset of field: ", stringify!(RGB), "::", stringify!(blue))
    );
}
pub type PRGB = *mut RGB;
pub type PPRGB = *mut *mut RGB;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGBAF {
    pub r: FLOAT32,
    pub g: FLOAT32,
    pub b: FLOAT32,
    pub a: FLOAT32,
}
#[test]
fn bindgen_test_layout_RGBAF() {
    assert_eq!(
        ::std::mem::size_of::<RGBAF>(),
        16usize,
        concat!("Size of: ", stringify!(RGBAF))
    );
    assert_eq!(
        ::std::mem::align_of::<RGBAF>(),
        4usize,
        concat!("Alignment of ", stringify!(RGBAF))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBAF>())).r as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(RGBAF), "::", stringify!(r))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBAF>())).g as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(RGBAF), "::", stringify!(g))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBAF>())).b as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(RGBAF), "::", stringify!(b))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RGBAF>())).a as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(RGBAF), "::", stringify!(a))
    );
}
pub type PRGBAF = *mut RGBAF;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XY {
    pub x: SINT32,
    pub y: SINT32,
}
#[test]
fn bindgen_test_layout_XY() {
    assert_eq!(
        ::std::mem::size_of::<XY>(),
        8usize,
        concat!("Size of: ", stringify!(XY))
    );
    assert_eq!(
        ::std::mem::align_of::<XY>(),
        4usize,
        concat!("Alignment of ", stringify!(XY))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XY>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(XY), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<XY>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(XY), "::", stringify!(y))
    );
}
pub type PXY = *mut XY;
pub type PPXY = *mut *mut XY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UNIPOINT {
    pub x: UNIPIX,
    pub y: UNIPIX,
}
#[test]
fn bindgen_test_layout_UNIPOINT() {
    assert_eq!(
        ::std::mem::size_of::<UNIPOINT>(),
        8usize,
        concat!("Size of: ", stringify!(UNIPOINT))
    );
    assert_eq!(
        ::std::mem::align_of::<UNIPOINT>(),
        4usize,
        concat!("Alignment of ", stringify!(UNIPOINT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIPOINT>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIPOINT),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIPOINT>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIPOINT),
            "::",
            stringify!(y)
        )
    );
}
pub type PUNIPOINT = *mut UNIPOINT;
pub type PPUNIPOINT = *mut *mut UNIPOINT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UNIBOX {
    pub x: UNIPIX,
    pub y: UNIPIX,
    pub size_x: UNIPIX,
    pub size_y: UNIPIX,
}
#[test]
fn bindgen_test_layout_UNIBOX() {
    assert_eq!(
        ::std::mem::size_of::<UNIBOX>(),
        16usize,
        concat!("Size of: ", stringify!(UNIBOX))
    );
    assert_eq!(
        ::std::mem::align_of::<UNIBOX>(),
        4usize,
        concat!("Alignment of ", stringify!(UNIBOX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIBOX>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(UNIBOX), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIBOX>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(UNIBOX), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIBOX>())).size_x as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIBOX),
            "::",
            stringify!(size_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIBOX>())).size_y as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIBOX),
            "::",
            stringify!(size_y)
        )
    );
}
pub type PUNIBOX = *mut UNIBOX;
pub type PPUNIBOX = *mut *mut UNIBOX;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UNIRECT {
    pub left: UNIPIX,
    pub top: UNIPIX,
    pub right: UNIPIX,
    pub bottom: UNIPIX,
}
#[test]
fn bindgen_test_layout_UNIRECT() {
    assert_eq!(
        ::std::mem::size_of::<UNIRECT>(),
        16usize,
        concat!("Size of: ", stringify!(UNIRECT))
    );
    assert_eq!(
        ::std::mem::align_of::<UNIRECT>(),
        4usize,
        concat!("Alignment of ", stringify!(UNIRECT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIRECT>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIRECT),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIRECT>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIRECT),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIRECT>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIRECT),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UNIRECT>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UNIRECT),
            "::",
            stringify!(bottom)
        )
    );
}
pub type PUNIRECT = *mut UNIRECT;
pub type PPUNIRECT = *mut *mut UNIRECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PIXPOINT {
    pub x: PIXEL,
    pub y: PIXEL,
}
#[test]
fn bindgen_test_layout_PIXPOINT() {
    assert_eq!(
        ::std::mem::size_of::<PIXPOINT>(),
        8usize,
        concat!("Size of: ", stringify!(PIXPOINT))
    );
    assert_eq!(
        ::std::mem::align_of::<PIXPOINT>(),
        4usize,
        concat!("Alignment of ", stringify!(PIXPOINT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXPOINT>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXPOINT),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXPOINT>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXPOINT),
            "::",
            stringify!(y)
        )
    );
}
pub type PPIXPOINT = *mut PIXPOINT;
pub type PPPIXPOINT = *mut *mut PIXPOINT;
pub type PCPIXPOINT = *const PIXPOINT;
pub type PPCPIXPOINT = *mut *const PIXPOINT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PIXBOX {
    pub x: PIXEL,
    pub y: PIXEL,
    pub size_x: PIXEL,
    pub size_y: PIXEL,
}
#[test]
fn bindgen_test_layout_PIXBOX() {
    assert_eq!(
        ::std::mem::size_of::<PIXBOX>(),
        16usize,
        concat!("Size of: ", stringify!(PIXBOX))
    );
    assert_eq!(
        ::std::mem::align_of::<PIXBOX>(),
        4usize,
        concat!("Alignment of ", stringify!(PIXBOX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXBOX>())).x as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(PIXBOX), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXBOX>())).y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(PIXBOX), "::", stringify!(y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXBOX>())).size_x as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXBOX),
            "::",
            stringify!(size_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXBOX>())).size_y as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXBOX),
            "::",
            stringify!(size_y)
        )
    );
}
pub type PPIXBOX = *mut PIXBOX;
pub type PPPIXBOX = *mut *mut PIXBOX;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PIXRECT {
    pub left: PIXEL,
    pub top: PIXEL,
    pub right: PIXEL,
    pub bottom: PIXEL,
}
#[test]
fn bindgen_test_layout_PIXRECT() {
    assert_eq!(
        ::std::mem::size_of::<PIXRECT>(),
        16usize,
        concat!("Size of: ", stringify!(PIXRECT))
    );
    assert_eq!(
        ::std::mem::align_of::<PIXRECT>(),
        4usize,
        concat!("Alignment of ", stringify!(PIXRECT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXRECT>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXRECT),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXRECT>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXRECT),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXRECT>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXRECT),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PIXRECT>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PIXRECT),
            "::",
            stringify!(bottom)
        )
    );
}
pub type PPIXRECT = *mut PIXRECT;
pub type PPPIXRECT = *mut *mut PIXRECT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BOUNDSRECT {
    pub N: SIF48,
    pub S: SIF48,
    pub E: ANGL48,
    pub W: ANGL48,
}
#[test]
fn bindgen_test_layout_BOUNDSRECT() {
    assert_eq!(
        ::std::mem::size_of::<BOUNDSRECT>(),
        32usize,
        concat!("Size of: ", stringify!(BOUNDSRECT))
    );
    assert_eq!(
        ::std::mem::align_of::<BOUNDSRECT>(),
        4usize,
        concat!("Alignment of ", stringify!(BOUNDSRECT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT>())).N as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT>())).S as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT),
            "::",
            stringify!(S)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT>())).E as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT),
            "::",
            stringify!(E)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT>())).W as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT),
            "::",
            stringify!(W)
        )
    );
}
impl ::std::fmt::Debug for BOUNDSRECT {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "BOUNDSRECT {{ N: {:?}, S: {:?}, E: {:?}, W: {:?} }}",
            self.N, self.S, self.E, self.W
        )
    }
}
pub type PBOUNDSRECT = *mut BOUNDSRECT;
pub type PPBOUNDSRECT = *mut *mut BOUNDSRECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BOUNDSRECT32 {
    pub north: SINT32,
    pub south: SINT32,
    pub east: SINT32,
    pub west: SINT32,
}
#[test]
fn bindgen_test_layout_BOUNDSRECT32() {
    assert_eq!(
        ::std::mem::size_of::<BOUNDSRECT32>(),
        16usize,
        concat!("Size of: ", stringify!(BOUNDSRECT32))
    );
    assert_eq!(
        ::std::mem::align_of::<BOUNDSRECT32>(),
        4usize,
        concat!("Alignment of ", stringify!(BOUNDSRECT32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT32>())).north as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT32),
            "::",
            stringify!(north)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT32>())).south as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT32),
            "::",
            stringify!(south)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT32>())).east as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT32),
            "::",
            stringify!(east)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDSRECT32>())).west as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDSRECT32),
            "::",
            stringify!(west)
        )
    );
}
pub type PBOUNDSRECT32 = *mut BOUNDSRECT32;
pub type PPBOUNDSRECT32 = *mut *mut BOUNDSRECT32;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct LLA_INFO {
    pub __bindgen_anon_1: LLA_INFO__bindgen_ty_1,
    pub data_ptr: PVOID,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union LLA_INFO__bindgen_ty_1 {
    pub __bindgen_anon_1: LLA_INFO__bindgen_ty_1__bindgen_ty_1,
    pub lla: LATLONALT,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LLA_INFO__bindgen_ty_1__bindgen_ty_1 {
    pub lat: SIF48,
    pub lon: ANGL48,
    pub alt: SIF48,
}
#[test]
fn bindgen_test_layout_LLA_INFO__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LLA_INFO__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(LLA_INFO__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<LLA_INFO__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(LLA_INFO__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLA_INFO__bindgen_ty_1__bindgen_ty_1>())).lat as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA_INFO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLA_INFO__bindgen_ty_1__bindgen_ty_1>())).lon as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA_INFO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<LLA_INFO__bindgen_ty_1__bindgen_ty_1>())).alt as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA_INFO__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(alt)
        )
    );
}
impl ::std::fmt::Debug for LLA_INFO__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LLA_INFO__bindgen_ty_1__bindgen_ty_1 {{ lat: {:?}, lon: {:?}, alt: {:?} }}",
            self.lat, self.lon, self.alt
        )
    }
}
#[test]
fn bindgen_test_layout_LLA_INFO__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LLA_INFO__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(LLA_INFO__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<LLA_INFO__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(LLA_INFO__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLA_INFO__bindgen_ty_1>())).lla as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA_INFO__bindgen_ty_1),
            "::",
            stringify!(lla)
        )
    );
}
impl ::std::fmt::Debug for LLA_INFO__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "LLA_INFO__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_LLA_INFO() {
    assert_eq!(
        ::std::mem::size_of::<LLA_INFO>(),
        32usize,
        concat!("Size of: ", stringify!(LLA_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<LLA_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(LLA_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LLA_INFO>())).data_ptr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LLA_INFO),
            "::",
            stringify!(data_ptr)
        )
    );
}
impl ::std::fmt::Debug for LLA_INFO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "LLA_INFO {{ __bindgen_anon_1: {:?}, data_ptr: {:?} }}",
            self.__bindgen_anon_1, self.data_ptr
        )
    }
}
pub type PLLA_INFO = *mut LLA_INFO;
pub type PPLLA_INFO = *mut *mut LLA_INFO;
pub const IMG_FORMAT_IMG_8_BIT_MONOCHROME: IMG_FORMAT = 0;
pub const IMG_FORMAT_IMG_8_BIT_INDEXED: IMG_FORMAT = 1;
pub const IMG_FORMAT_IMG_15_BIT: IMG_FORMAT = 2;
pub const IMG_FORMAT_IMG_16_BIT: IMG_FORMAT = 3;
pub const IMG_FORMAT_IMG_16A_BIT: IMG_FORMAT = 4;
pub const IMG_FORMAT_IMG_24_BIT: IMG_FORMAT = 5;
pub const IMG_FORMAT_IMG_32_BIT: IMG_FORMAT = 6;
pub const IMG_FORMAT_IMG_32A_BIT: IMG_FORMAT = 7;
pub const IMG_FORMAT_IMG_DXT1: IMG_FORMAT = 8;
pub const IMG_FORMAT_IMG_DXT3: IMG_FORMAT = 9;
pub const IMG_FORMAT_IMG_DUDV: IMG_FORMAT = 10;
pub const IMG_FORMAT_IMG_MAX: IMG_FORMAT = 11;
pub type IMG_FORMAT = ::std::os::raw::c_int;
pub type PIMG_FORMAT = *mut IMG_FORMAT;
pub type PPIMG_FORMAT = *mut *mut IMG_FORMAT;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct IMAGE {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub dim: PIXPOINT,
    pub pitch: UINT32,
    pub palette: *mut RGBA,
    pub len: UINT32,
    pub image: PCHAR,
    pub pdx: PVOID,
}
#[test]
fn bindgen_test_layout_IMAGE() {
    assert_eq!(
        ::std::mem::size_of::<IMAGE>(),
        44usize,
        concat!("Size of: ", stringify!(IMAGE))
    );
    assert_eq!(
        ::std::mem::align_of::<IMAGE>(),
        4usize,
        concat!("Alignment of ", stringify!(IMAGE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).dim as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(dim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).pitch as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).palette as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).image as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(image)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<IMAGE>())).pdx as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(IMAGE),
            "::",
            stringify!(pdx)
        )
    );
}
impl IMAGE {
    #[inline]
    pub fn format(&self) -> IMG_FORMAT {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_format(&mut self, val: IMG_FORMAT) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> UINT32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: UINT32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        format: IMG_FORMAT,
        flags: UINT32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let format: u32 = unsafe { ::std::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type PIMAGE = *mut IMAGE;
pub type PPIMAGE = *mut *mut IMAGE;
pub type PCIMAGE = *const IMAGE;
pub type PPCIMAGE = *mut *const IMAGE;
pub const VIEW_DIR_VIEW_DIR_FORWARD: VIEW_DIR = 0;
pub const VIEW_DIR_VIEW_DIR_FORWARD_RIGHT: VIEW_DIR = 1;
pub const VIEW_DIR_VIEW_DIR_RIGHT: VIEW_DIR = 2;
pub const VIEW_DIR_VIEW_DIR_REAR_RIGHT: VIEW_DIR = 3;
pub const VIEW_DIR_VIEW_DIR_REAR: VIEW_DIR = 4;
pub const VIEW_DIR_VIEW_DIR_REAR_LEFT: VIEW_DIR = 5;
pub const VIEW_DIR_VIEW_DIR_LEFT: VIEW_DIR = 6;
pub const VIEW_DIR_VIEW_DIR_FORWARD_LEFT: VIEW_DIR = 7;
pub const VIEW_DIR_VIEW_DIR_DOWN: VIEW_DIR = 8;
pub const VIEW_DIR_VIEW_DIR_FORWARD_UP: VIEW_DIR = 9;
pub const VIEW_DIR_VIEW_DIR_FORWARD_RIGHT_UP: VIEW_DIR = 10;
pub const VIEW_DIR_VIEW_DIR_RIGHT_UP: VIEW_DIR = 11;
pub const VIEW_DIR_VIEW_DIR_REAR_RIGHT_UP: VIEW_DIR = 12;
pub const VIEW_DIR_VIEW_DIR_REAR_UP: VIEW_DIR = 13;
pub const VIEW_DIR_VIEW_DIR_REAR_LEFT_UP: VIEW_DIR = 14;
pub const VIEW_DIR_VIEW_DIR_LEFT_UP: VIEW_DIR = 15;
pub const VIEW_DIR_VIEW_DIR_FORWARD_LEFT_UP: VIEW_DIR = 16;
pub const VIEW_DIR_VIEW_DIR_UP: VIEW_DIR = 17;
pub const VIEW_DIR_VIEW_DIR_AUX_00: VIEW_DIR = 18;
pub const VIEW_DIR_VIEW_DIR_AUX_01: VIEW_DIR = 19;
pub const VIEW_DIR_VIEW_DIR_AUX_02: VIEW_DIR = 20;
pub const VIEW_DIR_VIEW_DIR_AUX_03: VIEW_DIR = 21;
pub const VIEW_DIR_VIEW_DIR_AUX_04: VIEW_DIR = 22;
pub const VIEW_DIR_VIEW_DIR_AUX_05: VIEW_DIR = 23;
pub const VIEW_DIR_VIEW_DIR_MAX: VIEW_DIR = 24;
pub type VIEW_DIR = ::std::os::raw::c_int;
pub type PVIEW_DIR = *mut VIEW_DIR;
pub type PPVIEW_DIR = *mut *mut VIEW_DIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BOUNDBOX {
    pub N: SIF32,
    pub S: SIF32,
    pub E: ANGL32,
    pub W: ANGL32,
}
#[test]
fn bindgen_test_layout_BOUNDBOX() {
    assert_eq!(
        ::std::mem::size_of::<BOUNDBOX>(),
        16usize,
        concat!("Size of: ", stringify!(BOUNDBOX))
    );
    assert_eq!(
        ::std::mem::align_of::<BOUNDBOX>(),
        4usize,
        concat!("Alignment of ", stringify!(BOUNDBOX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDBOX>())).N as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDBOX),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDBOX>())).S as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDBOX),
            "::",
            stringify!(S)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDBOX>())).E as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDBOX),
            "::",
            stringify!(E)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BOUNDBOX>())).W as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BOUNDBOX),
            "::",
            stringify!(W)
        )
    );
}
pub type PBOUNDBOX = *mut BOUNDBOX;
pub type PPBOUNDBOX = *mut *mut BOUNDBOX;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct _engine_fuel_vars {
    pub tank_selector: ENUM,
    pub tanks_used: FLAGS,
    pub number_of_tanks_used: UINT32,
    pub fuelflow_pph: FLOAT64,
    pub fuel_available: BOOL32,
}
#[test]
fn bindgen_test_layout__engine_fuel_vars() {
    assert_eq!(
        ::std::mem::size_of::<_engine_fuel_vars>(),
        24usize,
        concat!("Size of: ", stringify!(_engine_fuel_vars))
    );
    assert_eq!(
        ::std::mem::align_of::<_engine_fuel_vars>(),
        4usize,
        concat!("Alignment of ", stringify!(_engine_fuel_vars))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_engine_fuel_vars>())).tank_selector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_engine_fuel_vars),
            "::",
            stringify!(tank_selector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_engine_fuel_vars>())).tanks_used as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_engine_fuel_vars),
            "::",
            stringify!(tanks_used)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_engine_fuel_vars>())).number_of_tanks_used as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_engine_fuel_vars),
            "::",
            stringify!(number_of_tanks_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_engine_fuel_vars>())).fuelflow_pph as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_engine_fuel_vars),
            "::",
            stringify!(fuelflow_pph)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_engine_fuel_vars>())).fuel_available as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_engine_fuel_vars),
            "::",
            stringify!(fuel_available)
        )
    );
}
pub type ENG_FUEL_VARS = _engine_fuel_vars;
pub type PENG_FUEL_VARS = *mut _engine_fuel_vars;
pub type PPENG_FUEL_VARS = *mut *mut _engine_fuel_vars;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct ENG {
    pub throttle_lvr_pos: SINT16,
    pub propeller_lvr_pos: UINT16,
    pub mixture_lvr_pos: UINT16,
    pub starter: ENUM16,
    pub combustion: BOOL16,
    pub n1_rpm: UINT16,
    pub n2_rpm: UINT16,
    pub ff_pph: UINT16,
    pub ff_pph_actual: UINT32,
    pub ff_pph_ssl: UINT16,
    pub torque: UINT16,
    pub absorbed_torque: UINT16,
    pub thrust_lbs: SINT32,
    pub blade_angle_pdeg: ANGL16,
    pub lf_mag: BOOL16,
    pub rt_mag: BOOL16,
    pub anti_ice: BOOL16,
    pub epr_bug_pos: UINT16,
    pub egt_bug_pos: UINT16,
    pub oil_tmp: UINT16,
    pub oil_prs: UINT16,
    pub epr: UINT16,
    pub egt_degC: UINT16,
    pub manifold_pressure: UINT16,
    pub x_pos: SINT16,
    pub y_pos: SINT16,
    pub z_pos: SINT16,
    pub rpm_scaler: UINT16,
    pub ext_ptr: PVOID,
    pub oil_quantity: UINT32,
    pub engine_vibration: UINT32,
    pub hydraulic_pressure: UINT32,
    pub hydraulic_quantity: UINT32,
    pub induced_velocity: FLOAT64,
    pub cyl_head_temp_degF: FLOAT64,
    pub tot_ind: UINT32,
    pub torque_ind: UINT32,
    pub Wfpress_ind: UINT32,
    pub electric_load: UINT32,
    pub xmsn_pressure: UINT32,
    pub xmsn_temperature: UINT32,
    pub rotor_rpm: UINT32,
    pub fuel_vars: ENG_FUEL_VARS,
}
#[test]
fn bindgen_test_layout_ENG() {
    assert_eq!(
        ::std::mem::size_of::<ENG>(),
        156usize,
        concat!("Size of: ", stringify!(ENG))
    );
    assert_eq!(
        ::std::mem::align_of::<ENG>(),
        4usize,
        concat!("Alignment of ", stringify!(ENG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).throttle_lvr_pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(throttle_lvr_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).propeller_lvr_pos as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(propeller_lvr_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).mixture_lvr_pos as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(mixture_lvr_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).starter as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(starter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).combustion as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(combustion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).n1_rpm as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(n1_rpm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).n2_rpm as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(n2_rpm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).ff_pph as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(ff_pph)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).ff_pph_actual as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(ff_pph_actual)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).ff_pph_ssl as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(ff_pph_ssl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).torque as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(torque)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).absorbed_torque as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(absorbed_torque)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).thrust_lbs as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(thrust_lbs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).blade_angle_pdeg as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(blade_angle_pdeg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).lf_mag as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(lf_mag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).rt_mag as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(rt_mag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).anti_ice as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(anti_ice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).epr_bug_pos as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(epr_bug_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).egt_bug_pos as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(egt_bug_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).oil_tmp as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(oil_tmp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).oil_prs as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(oil_prs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).epr as *const _ as usize },
        48usize,
        concat!("Offset of field: ", stringify!(ENG), "::", stringify!(epr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).egt_degC as *const _ as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(egt_degC)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).manifold_pressure as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(manifold_pressure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).x_pos as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(x_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).y_pos as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(y_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).z_pos as *const _ as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(z_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).rpm_scaler as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(rpm_scaler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).ext_ptr as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(ext_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).oil_quantity as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(oil_quantity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).engine_vibration as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(engine_vibration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).hydraulic_pressure as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(hydraulic_pressure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).hydraulic_quantity as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(hydraulic_quantity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).induced_velocity as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(induced_velocity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).cyl_head_temp_degF as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(cyl_head_temp_degF)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).tot_ind as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(tot_ind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).torque_ind as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(torque_ind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).Wfpress_ind as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(Wfpress_ind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).electric_load as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(electric_load)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).xmsn_pressure as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(xmsn_pressure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).xmsn_temperature as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(xmsn_temperature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).rotor_rpm as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(rotor_rpm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ENG>())).fuel_vars as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ENG),
            "::",
            stringify!(fuel_vars)
        )
    );
}
pub type PENG = *mut ENG;
pub type PPENG = *mut *mut ENG;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct SENSEBLOCK {
    pub left: PIXEL,
    pub top: PIXEL,
    pub right: PIXEL,
    pub bottom: PIXEL,
    pub routine: PVOID,
}
#[test]
fn bindgen_test_layout_SENSEBLOCK() {
    assert_eq!(
        ::std::mem::size_of::<SENSEBLOCK>(),
        24usize,
        concat!("Size of: ", stringify!(SENSEBLOCK))
    );
    assert_eq!(
        ::std::mem::align_of::<SENSEBLOCK>(),
        4usize,
        concat!("Alignment of ", stringify!(SENSEBLOCK))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SENSEBLOCK>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SENSEBLOCK),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SENSEBLOCK>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SENSEBLOCK),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SENSEBLOCK>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SENSEBLOCK),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SENSEBLOCK>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SENSEBLOCK),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SENSEBLOCK>())).routine as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SENSEBLOCK),
            "::",
            stringify!(routine)
        )
    );
}
pub type PSENSEBLOCK = *mut SENSEBLOCK;
pub type PPSENSEBLOCK = *mut *mut SENSEBLOCK;
pub const XVOR_TYPE_VOR_UNKNOWN: XVOR_TYPE = 0;
pub const XVOR_TYPE_VOR_TERMINAL: XVOR_TYPE = 1;
pub const XVOR_TYPE_VOR_LOW_ALTITUDE: XVOR_TYPE = 2;
pub const XVOR_TYPE_VOR_LOW_ALT: XVOR_TYPE = 2;
pub const XVOR_TYPE_VOR_HIGH_ALTITUDE: XVOR_TYPE = 3;
pub const XVOR_TYPE_VOR_HIGH_ALT: XVOR_TYPE = 3;
pub const XVOR_TYPE_VOR_ILS: XVOR_TYPE = 4;
pub const XVOR_TYPE_VOR_VOT: XVOR_TYPE = 5;
pub type XVOR_TYPE = ::std::os::raw::c_int;
pub type PXVOR_TYPE = *mut XVOR_TYPE;
pub type PPXVOR_TYPE = *mut *mut XVOR_TYPE;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct LOOKUP_TABLE {
    pub code: ENUM32,
    pub text: PSTRINGZ,
}
#[test]
fn bindgen_test_layout_LOOKUP_TABLE() {
    assert_eq!(
        ::std::mem::size_of::<LOOKUP_TABLE>(),
        12usize,
        concat!("Size of: ", stringify!(LOOKUP_TABLE))
    );
    assert_eq!(
        ::std::mem::align_of::<LOOKUP_TABLE>(),
        4usize,
        concat!("Alignment of ", stringify!(LOOKUP_TABLE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOOKUP_TABLE>())).code as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LOOKUP_TABLE),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOOKUP_TABLE>())).text as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LOOKUP_TABLE),
            "::",
            stringify!(text)
        )
    );
}
pub type PLOOKUP_TABLE = *mut LOOKUP_TABLE;
pub type PPLOOKUP_TABLE = *mut *mut LOOKUP_TABLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xyz_minmax {
    pub xyzMin: XYZF32,
    pub xyzMax: XYZF32,
}
#[test]
fn bindgen_test_layout__xyz_minmax() {
    assert_eq!(
        ::std::mem::size_of::<_xyz_minmax>(),
        32usize,
        concat!("Size of: ", stringify!(_xyz_minmax))
    );
    assert_eq!(
        ::std::mem::align_of::<_xyz_minmax>(),
        4usize,
        concat!("Alignment of ", stringify!(_xyz_minmax))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xyz_minmax>())).xyzMin as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_xyz_minmax),
            "::",
            stringify!(xyzMin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xyz_minmax>())).xyzMax as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_xyz_minmax),
            "::",
            stringify!(xyzMax)
        )
    );
}
pub type XYZ_MINMAX = _xyz_minmax;
pub type PXYZ_MINMAX = *mut _xyz_minmax;
pub type PPXYZ_MINMAX = *mut *mut _xyz_minmax;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _min_max {
    pub fMin: FLOAT32,
    pub fMax: FLOAT32,
}
#[test]
fn bindgen_test_layout__min_max() {
    assert_eq!(
        ::std::mem::size_of::<_min_max>(),
        8usize,
        concat!("Size of: ", stringify!(_min_max))
    );
    assert_eq!(
        ::std::mem::align_of::<_min_max>(),
        4usize,
        concat!("Alignment of ", stringify!(_min_max))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_min_max>())).fMin as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_min_max),
            "::",
            stringify!(fMin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_min_max>())).fMax as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_min_max),
            "::",
            stringify!(fMax)
        )
    );
}
pub type MIN_MAX = _min_max;
pub type PMIN_MAX = *mut _min_max;
pub type PPMIN_MAX = *mut *mut _min_max;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _uv {
    pub u: FLOAT32,
    pub v: FLOAT32,
}
#[test]
fn bindgen_test_layout__uv() {
    assert_eq!(
        ::std::mem::size_of::<_uv>(),
        8usize,
        concat!("Size of: ", stringify!(_uv))
    );
    assert_eq!(
        ::std::mem::align_of::<_uv>(),
        4usize,
        concat!("Alignment of ", stringify!(_uv))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_uv>())).u as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_uv), "::", stringify!(u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_uv>())).v as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(_uv), "::", stringify!(v))
    );
}
pub type UV = _uv;
pub type PUV = *mut _uv;
pub type PPUV = *mut *mut _uv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _uv_info {
    pub uv: [UV; 2usize],
}
#[test]
fn bindgen_test_layout__uv_info() {
    assert_eq!(
        ::std::mem::size_of::<_uv_info>(),
        16usize,
        concat!("Size of: ", stringify!(_uv_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_uv_info>(),
        4usize,
        concat!("Alignment of ", stringify!(_uv_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_uv_info>())).uv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_uv_info),
            "::",
            stringify!(uv)
        )
    );
}
pub type UV_INFO = _uv_info;
pub type PUV_INFO = *mut _uv_info;
pub type PPUV_INFO = *mut *mut _uv_info;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_OFF: FUEL_SELECT = 0;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_ALL: FUEL_SELECT = 1;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_LEFT: FUEL_SELECT = 2;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_RIGHT: FUEL_SELECT = 3;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_LEFT_AUX: FUEL_SELECT = 4;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_RIGHT_AUX: FUEL_SELECT = 5;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CENTER: FUEL_SELECT = 6;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CENTER2: FUEL_SELECT = 7;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CENTER3: FUEL_SELECT = 8;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_EXTERNAL1: FUEL_SELECT = 9;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_EXTERNAL2: FUEL_SELECT = 10;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_RIGHT_TIP: FUEL_SELECT = 11;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_LEFT_TIP: FUEL_SELECT = 12;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CROSSFEED: FUEL_SELECT = 13;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CROSSFEED_L2R: FUEL_SELECT = 14;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_CROSSFEED_R2L: FUEL_SELECT = 15;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_BOTH: FUEL_SELECT = 16;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_EXTERNAL_ALL: FUEL_SELECT = 17;
pub const FUEL_SELECT_FUEL_TANK_SELECTOR_ISOLATE: FUEL_SELECT = 18;
pub const FUEL_SELECT_FUEL_TANK_MAXIMUM: FUEL_SELECT = 19;
pub type FUEL_SELECT = ::std::os::raw::c_int;
pub type PFUEL_SELECT = *mut FUEL_SELECT;
pub type PPFUEL_SELECT = *mut *mut FUEL_SELECT;
pub const CROSS_FEED_SELECT_CROSS_FEED_OFF: CROSS_FEED_SELECT = 0;
pub const CROSS_FEED_SELECT_CROSS_FEED_LEFT_TO_RIGHT: CROSS_FEED_SELECT = 1;
pub const CROSS_FEED_SELECT_CROSS_FEED_RIGHT_TO_LEFT: CROSS_FEED_SELECT = 2;
pub const CROSS_FEED_SELECT_CROSS_FEED_MAX: CROSS_FEED_SELECT = 3;
pub type CROSS_FEED_SELECT = ::std::os::raw::c_int;
pub use self::CROSS_FEED_SELECT as CROSS_FEED;
pub type PCROSS_FEED = *mut CROSS_FEED_SELECT;
pub type PPCROSS_FEED = *mut *mut CROSS_FEED_SELECT;
pub const PROP_TYPE_PROP_TYPE_NONE: PROP_TYPE = 0;
pub const PROP_TYPE_PROP_TYPE_FIXED: PROP_TYPE = 1;
pub const PROP_TYPE_PROP_TYPE_MANUAL: PROP_TYPE = 2;
pub const PROP_TYPE_PROP_TYPE_CHOICE: PROP_TYPE = 3;
pub type PROP_TYPE = ::std::os::raw::c_int;
pub const UNITS_OF_MEASURE_ENGLISH_UNITS: UNITS_OF_MEASURE = 0;
pub const UNITS_OF_MEASURE_METRIC_UNITS_ALT_FEET: UNITS_OF_MEASURE = 1;
pub const UNITS_OF_MEASURE_METRIC_UNITS_ALT_METER: UNITS_OF_MEASURE = 2;
pub type UNITS_OF_MEASURE = ::std::os::raw::c_int;
pub const GAUGE_TOKEN_MODULE_VAR_NONE: GAUGE_TOKEN = 0;
pub const GAUGE_TOKEN_TICK18: GAUGE_TOKEN = 1;
pub const GAUGE_TOKEN_GROUND_ALTITUDE: GAUGE_TOKEN = 2;
pub const GAUGE_TOKEN_CLOCK_HOUR: GAUGE_TOKEN = 3;
pub const GAUGE_TOKEN_CLOCK_MINUTE: GAUGE_TOKEN = 4;
pub const GAUGE_TOKEN_CLOCK_SECOND: GAUGE_TOKEN = 5;
pub const GAUGE_TOKEN_ZULU_HOUR: GAUGE_TOKEN = 6;
pub const GAUGE_TOKEN_ZULU_MINUTE: GAUGE_TOKEN = 7;
pub const GAUGE_TOKEN_ZULU_DAY: GAUGE_TOKEN = 8;
pub const GAUGE_TOKEN_ZULU_YEAR: GAUGE_TOKEN = 9;
pub const GAUGE_TOKEN_PANEL_LIGHTS: GAUGE_TOKEN = 10;
pub const GAUGE_TOKEN_STROBE_LIGHTS: GAUGE_TOKEN = 11;
pub const GAUGE_TOKEN_STROBE_FLASH: GAUGE_TOKEN = 12;
pub const GAUGE_TOKEN_PITOT_HEAT: GAUGE_TOKEN = 13;
pub const GAUGE_TOKEN_LANDING_LIGHTS: GAUGE_TOKEN = 14;
pub const GAUGE_TOKEN_SMOKE_ENABLE: GAUGE_TOKEN = 15;
pub const GAUGE_TOKEN_ADF_FREQUENCY: GAUGE_TOKEN = 16;
pub const GAUGE_TOKEN_ADF_500_HZ_TUNABLE: GAUGE_TOKEN = 17;
pub const GAUGE_TOKEN_ADF_EXTENDED_FREQUENCY: GAUGE_TOKEN = 18;
pub const GAUGE_TOKEN_ADF_IDENTITY: GAUGE_TOKEN = 19;
pub const GAUGE_TOKEN_ADF_SIGNAL_STRENGTH: GAUGE_TOKEN = 20;
pub const GAUGE_TOKEN_ADF_MORSE_IDENT: GAUGE_TOKEN = 21;
pub const GAUGE_TOKEN_ADF_CARD_RADIAL: GAUGE_TOKEN = 22;
pub const GAUGE_TOKEN_COM_FREQUENCY: GAUGE_TOKEN = 23;
pub const GAUGE_TOKEN_NAV1_FREQUENCY: GAUGE_TOKEN = 24;
pub const GAUGE_TOKEN_NAV1_VOR_RADIAL: GAUGE_TOKEN = 25;
pub const GAUGE_TOKEN_NAV1_MORSE_IDENT: GAUGE_TOKEN = 26;
pub const GAUGE_TOKEN_NAV2_FREQUENCY: GAUGE_TOKEN = 27;
pub const GAUGE_TOKEN_NAV2_VOR_RADIAL: GAUGE_TOKEN = 28;
pub const GAUGE_TOKEN_NAV2_MORSE_IDENT: GAUGE_TOKEN = 29;
pub const GAUGE_TOKEN_DME1_DISPLAY_TYPE: GAUGE_TOKEN = 30;
pub const GAUGE_TOKEN_DME1_DISTANCE: GAUGE_TOKEN = 31;
pub const GAUGE_TOKEN_DME1_SPEED: GAUGE_TOKEN = 32;
pub const GAUGE_TOKEN_DME1_MORSE_IDENT: GAUGE_TOKEN = 33;
pub const GAUGE_TOKEN_DME2_DISPLAY_TYPE: GAUGE_TOKEN = 34;
pub const GAUGE_TOKEN_DME2_DISTANCE: GAUGE_TOKEN = 35;
pub const GAUGE_TOKEN_DME2_SPEED: GAUGE_TOKEN = 36;
pub const GAUGE_TOKEN_DME2_MORSE_IDENT: GAUGE_TOKEN = 37;
pub const GAUGE_TOKEN_TRANSPONDER_CODE: GAUGE_TOKEN = 38;
pub const GAUGE_TOKEN_ADF_NEEDLE: GAUGE_TOKEN = 39;
pub const GAUGE_TOKEN_VOR1_NEEDLE: GAUGE_TOKEN = 40;
pub const GAUGE_TOKEN_VOR1_GS_NEEDLE: GAUGE_TOKEN = 41;
pub const GAUGE_TOKEN_VOR1_BACK_COURSE_FLAGS: GAUGE_TOKEN = 42;
pub const GAUGE_TOKEN_VOR1_TF_FLAG: GAUGE_TOKEN = 43;
pub const GAUGE_TOKEN_VOR1_GS_FLAG: GAUGE_TOKEN = 44;
pub const GAUGE_TOKEN_VOR1_OBI: GAUGE_TOKEN = 45;
pub const GAUGE_TOKEN_VOR1_CODE: GAUGE_TOKEN = 46;
pub const GAUGE_TOKEN_VOR1_IDENTITY: GAUGE_TOKEN = 47;
pub const GAUGE_TOKEN_VOR1_MAG_VAR: GAUGE_TOKEN = 48;
pub const GAUGE_TOKEN_VOR1_SIGNAL_STRENGTH: GAUGE_TOKEN = 49;
pub const GAUGE_TOKEN_VOR2_NEEDLE: GAUGE_TOKEN = 50;
pub const GAUGE_TOKEN_VOR2_BACK_COURSE_FLAGS: GAUGE_TOKEN = 51;
pub const GAUGE_TOKEN_VOR2_TF_FLAG: GAUGE_TOKEN = 52;
pub const GAUGE_TOKEN_VOR2_GS_FLAG: GAUGE_TOKEN = 53;
pub const GAUGE_TOKEN_VOR2_OBI: GAUGE_TOKEN = 54;
pub const GAUGE_TOKEN_VOR2_CODE: GAUGE_TOKEN = 55;
pub const GAUGE_TOKEN_VOR2_IDENTITY: GAUGE_TOKEN = 56;
pub const GAUGE_TOKEN_VOR2_MAG_VAR: GAUGE_TOKEN = 57;
pub const GAUGE_TOKEN_VOR2_SIGNAL_STRENGTH: GAUGE_TOKEN = 58;
pub const GAUGE_TOKEN_VOR2_BEARING_DEGREES: GAUGE_TOKEN = 59;
pub const GAUGE_TOKEN_AIRCRAFT_ON_GROUND: GAUGE_TOKEN = 60;
pub const GAUGE_TOKEN_AIRSPEED: GAUGE_TOKEN = 61;
pub const GAUGE_TOKEN_AIRSPEED_TRUE_CALIBRATE: GAUGE_TOKEN = 62;
pub const GAUGE_TOKEN_BARBER_POLE_ASPD: GAUGE_TOKEN = 63;
pub const GAUGE_TOKEN_MACH: GAUGE_TOKEN = 64;
pub const GAUGE_TOKEN_VERTICAL_SPEED: GAUGE_TOKEN = 65;
pub const GAUGE_TOKEN_MACH_MAX_OPERATE: GAUGE_TOKEN = 66;
pub const GAUGE_TOKEN_STALL_WARNING: GAUGE_TOKEN = 67;
pub const GAUGE_TOKEN_OVERSPEED_WARNING: GAUGE_TOKEN = 68;
pub const GAUGE_TOKEN_TURN_COORDINATOR_BALL_POS: GAUGE_TOKEN = 69;
pub const GAUGE_TOKEN_DELTA_HEADING_RATE: GAUGE_TOKEN = 70;
pub const GAUGE_TOKEN_PLANE_LATITUDE: GAUGE_TOKEN = 71;
pub const GAUGE_TOKEN_PLANE_LONGITUDE: GAUGE_TOKEN = 72;
pub const GAUGE_TOKEN_PLANE_ALTITUDE: GAUGE_TOKEN = 73;
pub const GAUGE_TOKEN_ALT_FROM_BAROMETRIC_PRESSURE: GAUGE_TOKEN = 74;
pub const GAUGE_TOKEN_KOHLSMAN_SETTING_MB: GAUGE_TOKEN = 75;
pub const GAUGE_TOKEN_KOHLSMAN_SETTING_HG: GAUGE_TOKEN = 76;
pub const GAUGE_TOKEN_PLANE_PITCH_DEGREES: GAUGE_TOKEN = 77;
pub const GAUGE_TOKEN_ATTITUDE_INDICATOR_PITCH_DEGREES: GAUGE_TOKEN = 78;
pub const GAUGE_TOKEN_PLANE_BANK_DEGREES: GAUGE_TOKEN = 79;
pub const GAUGE_TOKEN_ATTITUDE_INDICATOR_BANK_DEGREES: GAUGE_TOKEN = 80;
pub const GAUGE_TOKEN_PLANE_HEADING_DEGREES_MAGNETIC: GAUGE_TOKEN = 81;
pub const GAUGE_TOKEN_MAGNETIC_VAR: GAUGE_TOKEN = 82;
pub const GAUGE_TOKEN_WHISKEY_COMPASS_DEGREES: GAUGE_TOKEN = 83;
pub const GAUGE_TOKEN_PLANE_HEADING_DEGREES_GYRO: GAUGE_TOKEN = 84;
pub const GAUGE_TOKEN_GYRO_DRIFT_ERROR: GAUGE_TOKEN = 85;
pub const GAUGE_TOKEN_PLANE_HEADING_DEGREES_TRUE: GAUGE_TOKEN = 86;
pub const GAUGE_TOKEN_AIRCRAFT_AUTOPILOT_AVAILABLE: GAUGE_TOKEN = 87;
pub const GAUGE_TOKEN_AIRCRAFT_FLAPS_AVAILABLE: GAUGE_TOKEN = 88;
pub const GAUGE_TOKEN_AIRCRAFT_STALL_HORN_AVAILABLE: GAUGE_TOKEN = 89;
pub const GAUGE_TOKEN_AIRCRAFT_ENGINE_MIXTURE_AVAILABLE: GAUGE_TOKEN = 90;
pub const GAUGE_TOKEN_AIRCRAFT_CARB_HEAT_AVAILABLE: GAUGE_TOKEN = 91;
pub const GAUGE_TOKEN_AIRCRAFT_SPOILER_AVAILABLE: GAUGE_TOKEN = 92;
pub const GAUGE_TOKEN_AIRCRAFT_IS_TAIL_DRAGGER: GAUGE_TOKEN = 93;
pub const GAUGE_TOKEN_AIRCRAFT_STROBES_AVAILABLE: GAUGE_TOKEN = 94;
pub const GAUGE_TOKEN_AIRCRAFT_PROP_TYPE_AVAILABLE: GAUGE_TOKEN = 95;
pub const GAUGE_TOKEN_AIRCRAFT_TOE_BRAKES_AVAILABLE: GAUGE_TOKEN = 96;
pub const GAUGE_TOKEN_AIRCRAFT_NAV1_AVAILABLE: GAUGE_TOKEN = 97;
pub const GAUGE_TOKEN_AIRCRAFT_NAV2_AVAILABLE: GAUGE_TOKEN = 98;
pub const GAUGE_TOKEN_AIRCRAFT_NAV1_OBS_AVAILABLE: GAUGE_TOKEN = 99;
pub const GAUGE_TOKEN_AIRCRAFT_NAV2_OBS_AVAILABLE: GAUGE_TOKEN = 100;
pub const GAUGE_TOKEN_AIRCRAFT_VOR2_GAUGE_AVAILABLE: GAUGE_TOKEN = 101;
pub const GAUGE_TOKEN_AIRCRAFT_GYRO_DRIFT_AVAILABLE: GAUGE_TOKEN = 102;
pub const GAUGE_TOKEN_AUTOPILOT_ACTIVE: GAUGE_TOKEN = 103;
pub const GAUGE_TOKEN_AUTOPILOT_WING_LEVELER: GAUGE_TOKEN = 104;
pub const GAUGE_TOKEN_AUTOPILOT_NAV1_LOCK: GAUGE_TOKEN = 105;
pub const GAUGE_TOKEN_AUTOPILOT_HEADING_LOCK: GAUGE_TOKEN = 106;
pub const GAUGE_TOKEN_AUTOPILOT_HEADING_LOCK_DIR: GAUGE_TOKEN = 107;
pub const GAUGE_TOKEN_AUTOPILOT_ALTITUDE_LOCK: GAUGE_TOKEN = 108;
pub const GAUGE_TOKEN_AUTOPILOT_ALTITUDE_LOCK_VAR: GAUGE_TOKEN = 109;
pub const GAUGE_TOKEN_AUTOPILOT_ATTITUDE_HOLD: GAUGE_TOKEN = 110;
pub const GAUGE_TOKEN_AUTOPILOT_GLIDESLOPE_HOLD: GAUGE_TOKEN = 111;
pub const GAUGE_TOKEN_AUTOPILOT_APROACH_HOLD: GAUGE_TOKEN = 112;
pub const GAUGE_TOKEN_AUTOPILOT_BACKCOURSE_HOLD: GAUGE_TOKEN = 113;
pub const GAUGE_TOKEN_AUTOPILOT_YAW_DAMPER: GAUGE_TOKEN = 114;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_HOLD: GAUGE_TOKEN = 115;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_HOLD_VAR: GAUGE_TOKEN = 116;
pub const GAUGE_TOKEN_AUTOPILOT_MACH_HOLD: GAUGE_TOKEN = 117;
pub const GAUGE_TOKEN_AUTOPILOT_MACH_HOLD_VAR: GAUGE_TOKEN = 118;
pub const GAUGE_TOKEN_AUTOPILOT_VERTICAL_HOLD: GAUGE_TOKEN = 119;
pub const GAUGE_TOKEN_AUTOPILOT_VERTICAL_HOLD_VAR: GAUGE_TOKEN = 120;
pub const GAUGE_TOKEN_AUTOPILOT_ALTITUDE_MANUALLY_TUNABLE: GAUGE_TOKEN = 121;
pub const GAUGE_TOKEN_AUTOPILOT_HEADING_MANUALLY_TUNABLE: GAUGE_TOKEN = 122;
pub const GAUGE_TOKEN_AUTOPILOT_AUTO_THROTTLE_ARM: GAUGE_TOKEN = 123;
pub const GAUGE_TOKEN_AUTOPILOT_TAKEOFF_POWER_ACTIVE: GAUGE_TOKEN = 124;
pub const GAUGE_TOKEN_ENGINE_RPM_HOLD: GAUGE_TOKEN = 125;
pub const GAUGE_TOKEN_ENGINE_CONTROL_SELECT: GAUGE_TOKEN = 126;
pub const GAUGE_TOKEN_ENGINE1: GAUGE_TOKEN = 127;
pub const GAUGE_TOKEN_ENGINE1_THROTTLE_LEVER_POS: GAUGE_TOKEN = 128;
pub const GAUGE_TOKEN_ENGINE1_PROPELLER_LEVER_POS: GAUGE_TOKEN = 129;
pub const GAUGE_TOKEN_ENGINE1_MIXTURE_LEVER_POS: GAUGE_TOKEN = 130;
pub const GAUGE_TOKEN_ENGINE1_COMBUSTION: GAUGE_TOKEN = 131;
pub const GAUGE_TOKEN_ENGINE1_STARTER_SWITCH_POS: GAUGE_TOKEN = 132;
pub const GAUGE_TOKEN_ENGINE1_MAGNETO_LEFT: GAUGE_TOKEN = 133;
pub const GAUGE_TOKEN_ENGINE1_MAGNETO_RIGHT: GAUGE_TOKEN = 134;
pub const GAUGE_TOKEN_ENGINE1_N1_RPM: GAUGE_TOKEN = 135;
pub const GAUGE_TOKEN_ENGINE1_N2_RPM: GAUGE_TOKEN = 136;
pub const GAUGE_TOKEN_ENGINE1_FF_GPH: GAUGE_TOKEN = 137;
pub const GAUGE_TOKEN_ENGINE1_FF_PPH: GAUGE_TOKEN = 138;
pub const GAUGE_TOKEN_ENGINE1_FF_PPH_SSL: GAUGE_TOKEN = 139;
pub const GAUGE_TOKEN_ENGINE1_TORQUE: GAUGE_TOKEN = 140;
pub const GAUGE_TOKEN_ENGINE1_ANTI_ICE_SWITCH: GAUGE_TOKEN = 141;
pub const GAUGE_TOKEN_ENGINE1_PRESSURE_RATIO: GAUGE_TOKEN = 142;
pub const GAUGE_TOKEN_ENGINE1_PRESSURE_BUG_POS: GAUGE_TOKEN = 143;
pub const GAUGE_TOKEN_ENGINE1_EGT: GAUGE_TOKEN = 144;
pub const GAUGE_TOKEN_ENGINE1_EGT_BUG_POS: GAUGE_TOKEN = 145;
pub const GAUGE_TOKEN_ENGINE1_CHT: GAUGE_TOKEN = 146;
pub const GAUGE_TOKEN_ENGINE1_OIL_TEMPERATURE: GAUGE_TOKEN = 147;
pub const GAUGE_TOKEN_ENGINE1_OIL_PRESSURE: GAUGE_TOKEN = 148;
pub const GAUGE_TOKEN_ENGINE1_OIL_QUANTITY: GAUGE_TOKEN = 149;
pub const GAUGE_TOKEN_ENGINE1_HYDRAULIC_PRESSURE: GAUGE_TOKEN = 150;
pub const GAUGE_TOKEN_ENGINE1_HYDRAULIC_QUANTITY: GAUGE_TOKEN = 151;
pub const GAUGE_TOKEN_ENGINE1_MANIFOLD_PRESSURE: GAUGE_TOKEN = 152;
pub const GAUGE_TOKEN_ENGINE1_ENGINE_VIBRATION: GAUGE_TOKEN = 153;
pub const GAUGE_TOKEN_ENGINE1_RPM_SCALER: GAUGE_TOKEN = 154;
pub const GAUGE_TOKEN_ENGINE1_TURBINE_TEMPERATURE: GAUGE_TOKEN = 155;
pub const GAUGE_TOKEN_ENGINE1_TORQUE_PERCENT: GAUGE_TOKEN = 156;
pub const GAUGE_TOKEN_ENGINE1_FUEL_PRESSURE: GAUGE_TOKEN = 157;
pub const GAUGE_TOKEN_ENGINE1_ELECTRICAL_LOAD: GAUGE_TOKEN = 158;
pub const GAUGE_TOKEN_ENGINE1_TRANSMISSION_PRESSURE: GAUGE_TOKEN = 159;
pub const GAUGE_TOKEN_ENGINE1_TRANSMISSION_TEMPERATURE: GAUGE_TOKEN = 160;
pub const GAUGE_TOKEN_ENGINE1_ROTOR_RPM: GAUGE_TOKEN = 161;
pub const GAUGE_TOKEN_ENGINE2: GAUGE_TOKEN = 162;
pub const GAUGE_TOKEN_ENGINE2_THROTTLE_LEVER_POS: GAUGE_TOKEN = 163;
pub const GAUGE_TOKEN_ENGINE2_PROPELLER_LEVER_POS: GAUGE_TOKEN = 164;
pub const GAUGE_TOKEN_ENGINE2_MIXTURE_LEVER_POS: GAUGE_TOKEN = 165;
pub const GAUGE_TOKEN_ENGINE2_COMBUSTION: GAUGE_TOKEN = 166;
pub const GAUGE_TOKEN_ENGINE2_STARTER_SWITCH_POS: GAUGE_TOKEN = 167;
pub const GAUGE_TOKEN_ENGINE2_MAGNETO_LEFT: GAUGE_TOKEN = 168;
pub const GAUGE_TOKEN_ENGINE2_MAGNETO_RIGHT: GAUGE_TOKEN = 169;
pub const GAUGE_TOKEN_ENGINE2_N1_RPM: GAUGE_TOKEN = 170;
pub const GAUGE_TOKEN_ENGINE2_N2_RPM: GAUGE_TOKEN = 171;
pub const GAUGE_TOKEN_ENGINE2_FF_GPH: GAUGE_TOKEN = 172;
pub const GAUGE_TOKEN_ENGINE2_FF_PPH: GAUGE_TOKEN = 173;
pub const GAUGE_TOKEN_ENGINE2_FF_PPH_SSL: GAUGE_TOKEN = 174;
pub const GAUGE_TOKEN_ENGINE2_TORQUE: GAUGE_TOKEN = 175;
pub const GAUGE_TOKEN_ENGINE2_ANTI_ICE_SWITCH: GAUGE_TOKEN = 176;
pub const GAUGE_TOKEN_ENGINE2_PRESSURE_RATIO: GAUGE_TOKEN = 177;
pub const GAUGE_TOKEN_ENGINE2_PRESSURE_BUG_POS: GAUGE_TOKEN = 178;
pub const GAUGE_TOKEN_ENGINE2_EGT: GAUGE_TOKEN = 179;
pub const GAUGE_TOKEN_ENGINE2_EGT_BUG_POS: GAUGE_TOKEN = 180;
pub const GAUGE_TOKEN_ENGINE2_CHT: GAUGE_TOKEN = 181;
pub const GAUGE_TOKEN_ENGINE2_OIL_TEMPERATURE: GAUGE_TOKEN = 182;
pub const GAUGE_TOKEN_ENGINE2_OIL_PRESSURE: GAUGE_TOKEN = 183;
pub const GAUGE_TOKEN_ENGINE2_OIL_QUANTITY: GAUGE_TOKEN = 184;
pub const GAUGE_TOKEN_ENGINE2_HYDRAULIC_PRESSURE: GAUGE_TOKEN = 185;
pub const GAUGE_TOKEN_ENGINE2_HYDRAULIC_QUANTITY: GAUGE_TOKEN = 186;
pub const GAUGE_TOKEN_ENGINE2_MANIFOLD_PRESSURE: GAUGE_TOKEN = 187;
pub const GAUGE_TOKEN_ENGINE2_ENGINE_VIBRATION: GAUGE_TOKEN = 188;
pub const GAUGE_TOKEN_ENGINE2_RPM_SCALER: GAUGE_TOKEN = 189;
pub const GAUGE_TOKEN_ENGINE2_TURBINE_TEMPERATURE: GAUGE_TOKEN = 190;
pub const GAUGE_TOKEN_ENGINE2_TORQUE_PERCENT: GAUGE_TOKEN = 191;
pub const GAUGE_TOKEN_ENGINE2_FUEL_PRESSURE: GAUGE_TOKEN = 192;
pub const GAUGE_TOKEN_ENGINE2_ELECTRICAL_LOAD: GAUGE_TOKEN = 193;
pub const GAUGE_TOKEN_ENGINE2_TRANSMISSION_PRESSURE: GAUGE_TOKEN = 194;
pub const GAUGE_TOKEN_ENGINE2_TRANSMISSION_TEMPERATURE: GAUGE_TOKEN = 195;
pub const GAUGE_TOKEN_ENGINE2_ROTOR_RPM: GAUGE_TOKEN = 196;
pub const GAUGE_TOKEN_ENGINE3: GAUGE_TOKEN = 197;
pub const GAUGE_TOKEN_ENGINE3_THROTTLE_LEVER_POS: GAUGE_TOKEN = 198;
pub const GAUGE_TOKEN_ENGINE3_PROPELLER_LEVER_POS: GAUGE_TOKEN = 199;
pub const GAUGE_TOKEN_ENGINE3_MIXTURE_LEVER_POS: GAUGE_TOKEN = 200;
pub const GAUGE_TOKEN_ENGINE3_COMBUSTION: GAUGE_TOKEN = 201;
pub const GAUGE_TOKEN_ENGINE3_STARTER_SWITCH_POS: GAUGE_TOKEN = 202;
pub const GAUGE_TOKEN_ENGINE3_MAGNETO_LEFT: GAUGE_TOKEN = 203;
pub const GAUGE_TOKEN_ENGINE3_MAGNETO_RIGHT: GAUGE_TOKEN = 204;
pub const GAUGE_TOKEN_ENGINE3_N1_RPM: GAUGE_TOKEN = 205;
pub const GAUGE_TOKEN_ENGINE3_N2_RPM: GAUGE_TOKEN = 206;
pub const GAUGE_TOKEN_ENGINE3_FF_GPH: GAUGE_TOKEN = 207;
pub const GAUGE_TOKEN_ENGINE3_FF_PPH: GAUGE_TOKEN = 208;
pub const GAUGE_TOKEN_ENGINE3_FF_PPH_SSL: GAUGE_TOKEN = 209;
pub const GAUGE_TOKEN_ENGINE3_TORQUE: GAUGE_TOKEN = 210;
pub const GAUGE_TOKEN_ENGINE3_ANTI_ICE_SWITCH: GAUGE_TOKEN = 211;
pub const GAUGE_TOKEN_ENGINE3_PRESSURE_RATIO: GAUGE_TOKEN = 212;
pub const GAUGE_TOKEN_ENGINE3_PRESSURE_BUG_POS: GAUGE_TOKEN = 213;
pub const GAUGE_TOKEN_ENGINE3_EGT: GAUGE_TOKEN = 214;
pub const GAUGE_TOKEN_ENGINE3_EGT_BUG_POS: GAUGE_TOKEN = 215;
pub const GAUGE_TOKEN_ENGINE3_CHT: GAUGE_TOKEN = 216;
pub const GAUGE_TOKEN_ENGINE3_OIL_TEMPERATURE: GAUGE_TOKEN = 217;
pub const GAUGE_TOKEN_ENGINE3_OIL_PRESSURE: GAUGE_TOKEN = 218;
pub const GAUGE_TOKEN_ENGINE3_OIL_QUANTITY: GAUGE_TOKEN = 219;
pub const GAUGE_TOKEN_ENGINE3_HYDRAULIC_PRESSURE: GAUGE_TOKEN = 220;
pub const GAUGE_TOKEN_ENGINE3_HYDRAULIC_QUANTITY: GAUGE_TOKEN = 221;
pub const GAUGE_TOKEN_ENGINE3_MANIFOLD_PRESSURE: GAUGE_TOKEN = 222;
pub const GAUGE_TOKEN_ENGINE3_ENGINE_VIBRATION: GAUGE_TOKEN = 223;
pub const GAUGE_TOKEN_ENGINE3_RPM_SCALER: GAUGE_TOKEN = 224;
pub const GAUGE_TOKEN_ENGINE3_TURBINE_TEMPERATURE: GAUGE_TOKEN = 225;
pub const GAUGE_TOKEN_ENGINE3_TORQUE_PERCENT: GAUGE_TOKEN = 226;
pub const GAUGE_TOKEN_ENGINE3_FUEL_PRESSURE: GAUGE_TOKEN = 227;
pub const GAUGE_TOKEN_ENGINE3_ELECTRICAL_LOAD: GAUGE_TOKEN = 228;
pub const GAUGE_TOKEN_ENGINE3_TRANSMISSION_PRESSURE: GAUGE_TOKEN = 229;
pub const GAUGE_TOKEN_ENGINE3_TRANSMISSION_TEMPERATURE: GAUGE_TOKEN = 230;
pub const GAUGE_TOKEN_ENGINE3_ROTOR_RPM: GAUGE_TOKEN = 231;
pub const GAUGE_TOKEN_ENGINE4: GAUGE_TOKEN = 232;
pub const GAUGE_TOKEN_ENGINE4_THROTTLE_LEVER_POS: GAUGE_TOKEN = 233;
pub const GAUGE_TOKEN_ENGINE4_PROPELLER_LEVER_POS: GAUGE_TOKEN = 234;
pub const GAUGE_TOKEN_ENGINE4_MIXTURE_LEVER_POS: GAUGE_TOKEN = 235;
pub const GAUGE_TOKEN_ENGINE4_COMBUSTION: GAUGE_TOKEN = 236;
pub const GAUGE_TOKEN_ENGINE4_STARTER_SWITCH_POS: GAUGE_TOKEN = 237;
pub const GAUGE_TOKEN_ENGINE4_MAGNETO_LEFT: GAUGE_TOKEN = 238;
pub const GAUGE_TOKEN_ENGINE4_MAGNETO_RIGHT: GAUGE_TOKEN = 239;
pub const GAUGE_TOKEN_ENGINE4_N1_RPM: GAUGE_TOKEN = 240;
pub const GAUGE_TOKEN_ENGINE4_N2_RPM: GAUGE_TOKEN = 241;
pub const GAUGE_TOKEN_ENGINE4_FF_GPH: GAUGE_TOKEN = 242;
pub const GAUGE_TOKEN_ENGINE4_FF_PPH: GAUGE_TOKEN = 243;
pub const GAUGE_TOKEN_ENGINE4_FF_PPH_SSL: GAUGE_TOKEN = 244;
pub const GAUGE_TOKEN_ENGINE4_TORQUE: GAUGE_TOKEN = 245;
pub const GAUGE_TOKEN_ENGINE4_ANTI_ICE_SWITCH: GAUGE_TOKEN = 246;
pub const GAUGE_TOKEN_ENGINE4_PRESSURE_RATIO: GAUGE_TOKEN = 247;
pub const GAUGE_TOKEN_ENGINE4_PRESSURE_BUG_POS: GAUGE_TOKEN = 248;
pub const GAUGE_TOKEN_ENGINE4_EGT: GAUGE_TOKEN = 249;
pub const GAUGE_TOKEN_ENGINE4_EGT_BUG_POS: GAUGE_TOKEN = 250;
pub const GAUGE_TOKEN_ENGINE4_CHT: GAUGE_TOKEN = 251;
pub const GAUGE_TOKEN_ENGINE4_OIL_TEMPERATURE: GAUGE_TOKEN = 252;
pub const GAUGE_TOKEN_ENGINE4_OIL_PRESSURE: GAUGE_TOKEN = 253;
pub const GAUGE_TOKEN_ENGINE4_OIL_QUANTITY: GAUGE_TOKEN = 254;
pub const GAUGE_TOKEN_ENGINE4_HYDRAULIC_PRESSURE: GAUGE_TOKEN = 255;
pub const GAUGE_TOKEN_ENGINE4_HYDRAULIC_QUANTITY: GAUGE_TOKEN = 256;
pub const GAUGE_TOKEN_ENGINE4_MANIFOLD_PRESSURE: GAUGE_TOKEN = 257;
pub const GAUGE_TOKEN_ENGINE4_ENGINE_VIBRATION: GAUGE_TOKEN = 258;
pub const GAUGE_TOKEN_ENGINE4_RPM_SCALER: GAUGE_TOKEN = 259;
pub const GAUGE_TOKEN_ENGINE4_TURBINE_TEMPERATURE: GAUGE_TOKEN = 260;
pub const GAUGE_TOKEN_ENGINE4_TORQUE_PERCENT: GAUGE_TOKEN = 261;
pub const GAUGE_TOKEN_ENGINE4_FUEL_PRESSURE: GAUGE_TOKEN = 262;
pub const GAUGE_TOKEN_ENGINE4_ELECTRICAL_LOAD: GAUGE_TOKEN = 263;
pub const GAUGE_TOKEN_ENGINE4_TRANSMISSION_PRESSURE: GAUGE_TOKEN = 264;
pub const GAUGE_TOKEN_ENGINE4_TRANSMISSION_TEMPERATURE: GAUGE_TOKEN = 265;
pub const GAUGE_TOKEN_ENGINE4_ROTOR_RPM: GAUGE_TOKEN = 266;
pub const GAUGE_TOKEN_NUMBER_OF_ENGINES: GAUGE_TOKEN = 267;
pub const GAUGE_TOKEN_PROP_ADVANCE_SELECTION: GAUGE_TOKEN = 268;
pub const GAUGE_TOKEN_THROTTLE_LOWER_LIMIT: GAUGE_TOKEN = 269;
pub const GAUGE_TOKEN_OIL_QUANTITY_TOTAL: GAUGE_TOKEN = 270;
pub const GAUGE_TOKEN_SYSTEMS_AVAILABLE: GAUGE_TOKEN = 271;
pub const GAUGE_TOKEN_INSTRUMENTS_AVAILABLE: GAUGE_TOKEN = 272;
pub const GAUGE_TOKEN_PP_ADF: GAUGE_TOKEN = 273;
pub const GAUGE_TOKEN_PP_AIR: GAUGE_TOKEN = 274;
pub const GAUGE_TOKEN_PP_ALTIM: GAUGE_TOKEN = 275;
pub const GAUGE_TOKEN_PP_ATTITUDE: GAUGE_TOKEN = 276;
pub const GAUGE_TOKEN_PP_COM: GAUGE_TOKEN = 277;
pub const GAUGE_TOKEN_PP_COMPASS: GAUGE_TOKEN = 278;
pub const GAUGE_TOKEN_PP_ELECT: GAUGE_TOKEN = 279;
pub const GAUGE_TOKEN_PP_ENGINE: GAUGE_TOKEN = 280;
pub const GAUGE_TOKEN_PP_FUEL_IND: GAUGE_TOKEN = 281;
pub const GAUGE_TOKEN_PP_HEADING: GAUGE_TOKEN = 282;
pub const GAUGE_TOKEN_PP_VERT_VEL: GAUGE_TOKEN = 283;
pub const GAUGE_TOKEN_PP_XPNDR: GAUGE_TOKEN = 284;
pub const GAUGE_TOKEN_PP_NAV: GAUGE_TOKEN = 285;
pub const GAUGE_TOKEN_PP_PITOT: GAUGE_TOKEN = 286;
pub const GAUGE_TOKEN_PP_TURN_COORD: GAUGE_TOKEN = 287;
pub const GAUGE_TOKEN_PP_VACUUM: GAUGE_TOKEN = 288;
pub const GAUGE_TOKEN_FUEL_TANK_CENTER_LEVEL: GAUGE_TOKEN = 289;
pub const GAUGE_TOKEN_FUEL_TANK_CENTER_CAPACITY: GAUGE_TOKEN = 290;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_MAIN_LEVEL: GAUGE_TOKEN = 291;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_MAIN_CAPACITY: GAUGE_TOKEN = 292;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_AUX_LEVEL: GAUGE_TOKEN = 293;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_AUX_CAPACITY: GAUGE_TOKEN = 294;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_TIP_LEVEL: GAUGE_TOKEN = 295;
pub const GAUGE_TOKEN_FUEL_TANK_LEFT_TIP_CAPACITY: GAUGE_TOKEN = 296;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_MAIN_LEVEL: GAUGE_TOKEN = 297;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_MAIN_CAPACITY: GAUGE_TOKEN = 298;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_AUX_LEVEL: GAUGE_TOKEN = 299;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_AUX_CAPACITY: GAUGE_TOKEN = 300;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_TIP_LEVEL: GAUGE_TOKEN = 301;
pub const GAUGE_TOKEN_FUEL_TANK_RIGHT_TIP_CAPACITY: GAUGE_TOKEN = 302;
pub const GAUGE_TOKEN_FUEL_QUANTITY_RIGHT: GAUGE_TOKEN = 303;
pub const GAUGE_TOKEN_FUEL_QUANTITY_LEFT: GAUGE_TOKEN = 304;
pub const GAUGE_TOKEN_FUEL_QUANTITY_CENTER: GAUGE_TOKEN = 305;
pub const GAUGE_TOKEN_FUEL_WEGHT_PER_GALLON: GAUGE_TOKEN = 306;
pub const GAUGE_TOKEN_FUEL_TANK_SELECTOR: GAUGE_TOKEN = 307;
pub const GAUGE_TOKEN_CROSS_FEED_SELECTOR: GAUGE_TOKEN = 308;
pub const GAUGE_TOKEN_YOKE_POS_Y: GAUGE_TOKEN = 309;
pub const GAUGE_TOKEN_YOKE_IND_Y: GAUGE_TOKEN = 310;
pub const GAUGE_TOKEN_YOKE_POS_X: GAUGE_TOKEN = 311;
pub const GAUGE_TOKEN_YOKE_IND_X: GAUGE_TOKEN = 312;
pub const GAUGE_TOKEN_AILERON_POS: GAUGE_TOKEN = 313;
pub const GAUGE_TOKEN_RUDDER_PEDAL_POS: GAUGE_TOKEN = 314;
pub const GAUGE_TOKEN_RUDDER_PEDAL_IND: GAUGE_TOKEN = 315;
pub const GAUGE_TOKEN_RUDDER_POS: GAUGE_TOKEN = 316;
pub const GAUGE_TOKEN_ELEVATOR_POS: GAUGE_TOKEN = 317;
pub const GAUGE_TOKEN_ELEVATOR_TRIM_POS: GAUGE_TOKEN = 318;
pub const GAUGE_TOKEN_ELEVATOR_TRIM_IND: GAUGE_TOKEN = 319;
pub const GAUGE_TOKEN_BRAKES_LEFT_POS: GAUGE_TOKEN = 320;
pub const GAUGE_TOKEN_BRAKES_RIGHT_POS: GAUGE_TOKEN = 321;
pub const GAUGE_TOKEN_BRAKE_IND: GAUGE_TOKEN = 322;
pub const GAUGE_TOKEN_PARKING_BRAKE_POS: GAUGE_TOKEN = 323;
pub const GAUGE_TOKEN_SPOILERS_ARMED: GAUGE_TOKEN = 324;
pub const GAUGE_TOKEN_SPOILERS_HANDLE_POS: GAUGE_TOKEN = 325;
pub const GAUGE_TOKEN_SPOILERS_POS_LEFT: GAUGE_TOKEN = 326;
pub const GAUGE_TOKEN_SPOILERS_POS_RIGHT: GAUGE_TOKEN = 327;
pub const GAUGE_TOKEN_FLAPS_HANDLE_POS: GAUGE_TOKEN = 328;
pub const GAUGE_TOKEN_FLAPS_POS_LEFT: GAUGE_TOKEN = 329;
pub const GAUGE_TOKEN_FLAPS_POS_RIGHT: GAUGE_TOKEN = 330;
pub const GAUGE_TOKEN_GEAR_HANDLE_POS: GAUGE_TOKEN = 331;
pub const GAUGE_TOKEN_GEAR_POS_NOSE: GAUGE_TOKEN = 332;
pub const GAUGE_TOKEN_GEAR_POS_LEFT: GAUGE_TOKEN = 333;
pub const GAUGE_TOKEN_GEAR_POS_RIGHT: GAUGE_TOKEN = 334;
pub const GAUGE_TOKEN_DISPLAY_UNITS: GAUGE_TOKEN = 335;
pub const GAUGE_TOKEN_SIM_SPEED: GAUGE_TOKEN = 336;
pub const GAUGE_TOKEN_ZOOM_FACTOR: GAUGE_TOKEN = 337;
pub const GAUGE_TOKEN_REALISM_SENSE: GAUGE_TOKEN = 338;
pub const GAUGE_TOKEN_REALISM_SYSTEMS: GAUGE_TOKEN = 339;
pub const GAUGE_TOKEN_RELIABILITY_SENSE: GAUGE_TOKEN = 340;
pub const GAUGE_TOKEN_AMBIENT_TEMP_DEGREES_C: GAUGE_TOKEN = 341;
pub const GAUGE_TOKEN_AMBIENT_PRES_MBAR: GAUGE_TOKEN = 342;
pub const GAUGE_TOKEN_AMBIENT_WIND_VEL: GAUGE_TOKEN = 343;
pub const GAUGE_TOKEN_AMBIENT_WIND_DIR: GAUGE_TOKEN = 344;
pub const GAUGE_TOKEN_AMBIENT_WINDE: GAUGE_TOKEN = 345;
pub const GAUGE_TOKEN_AMBIENT_WINDN: GAUGE_TOKEN = 346;
pub const GAUGE_TOKEN_AMBIENT_WINDA: GAUGE_TOKEN = 347;
pub const GAUGE_TOKEN_BAROMETRIC_PRESSURE: GAUGE_TOKEN = 348;
pub const GAUGE_TOKEN_ANGLE_OF_ATTACK_INDICATOR: GAUGE_TOKEN = 349;
pub const GAUGE_TOKEN_TOTAL_AIR_TEMP: GAUGE_TOKEN = 350;
pub const GAUGE_TOKEN_G_FORCE: GAUGE_TOKEN = 351;
pub const GAUGE_TOKEN_CHARGING_AMPS: GAUGE_TOKEN = 352;
pub const GAUGE_TOKEN_SUCTION_PRESSURE: GAUGE_TOKEN = 353;
pub const GAUGE_TOKEN_MARKER_BEACON_STATE: GAUGE_TOKEN = 354;
pub const GAUGE_TOKEN_CURRENT_DME: GAUGE_TOKEN = 355;
pub const GAUGE_TOKEN_PANEL_STATE_FLAGS: GAUGE_TOKEN = 356;
pub const GAUGE_TOKEN_GET_GUN_AMMO: GAUGE_TOKEN = 357;
pub const GAUGE_TOKEN_GET_CANNON_AMMO: GAUGE_TOKEN = 358;
pub const GAUGE_TOKEN_GET_ROCKET_AMMO: GAUGE_TOKEN = 359;
pub const GAUGE_TOKEN_GET_BOMB_AMMO: GAUGE_TOKEN = 360;
pub const GAUGE_TOKEN_ENGINE_PRIMER: GAUGE_TOKEN = 361;
pub const GAUGE_TOKEN_COWL_FLAPS: GAUGE_TOKEN = 362;
pub const GAUGE_TOKEN_MASTER_ALTERNATOR: GAUGE_TOKEN = 363;
pub const GAUGE_TOKEN_MASTER_BATTERY: GAUGE_TOKEN = 364;
pub const GAUGE_TOKEN_CARB_HEAT: GAUGE_TOKEN = 365;
pub const GAUGE_TOKEN_FLIGHT_TIME: GAUGE_TOKEN = 366;
pub const GAUGE_TOKEN_FUEL_PUMP: GAUGE_TOKEN = 367;
pub const GAUGE_TOKEN_BEACON_LIGHTS: GAUGE_TOKEN = 368;
pub const GAUGE_TOKEN_TAXI_LIGHTS: GAUGE_TOKEN = 369;
pub const GAUGE_TOKEN_RADIO_STACK_VISIBLE: GAUGE_TOKEN = 370;
pub const GAUGE_TOKEN_HORIZON_BAR_OFFSET: GAUGE_TOKEN = 371;
pub const GAUGE_TOKEN_CURRENT_DME_DISTANCE: GAUGE_TOKEN = 372;
pub const GAUGE_TOKEN_CURRENT_DME_SPEED: GAUGE_TOKEN = 373;
pub const GAUGE_TOKEN_CURRENT_DME_MIN: GAUGE_TOKEN = 374;
pub const GAUGE_TOKEN_WARNING_FUEL: GAUGE_TOKEN = 375;
pub const GAUGE_TOKEN_WARNING_FUEL_L: GAUGE_TOKEN = 376;
pub const GAUGE_TOKEN_WARNING_FUEL_R: GAUGE_TOKEN = 377;
pub const GAUGE_TOKEN_WARNING_VACUUM: GAUGE_TOKEN = 378;
pub const GAUGE_TOKEN_WARNING_VACUUM_L: GAUGE_TOKEN = 379;
pub const GAUGE_TOKEN_WARNING_VACUUM_R: GAUGE_TOKEN = 380;
pub const GAUGE_TOKEN_WARNING_OIL_PSI: GAUGE_TOKEN = 381;
pub const GAUGE_TOKEN_WARNING_VOLTAGE: GAUGE_TOKEN = 382;
pub const GAUGE_TOKEN_FUEL_TANK_CENTER2_LEVEL: GAUGE_TOKEN = 383;
pub const GAUGE_TOKEN_FUEL_TANK_CENTER2_CAPACITY: GAUGE_TOKEN = 384;
pub const GAUGE_TOKEN_FUEL_QUANTITY_CENTER2: GAUGE_TOKEN = 385;
pub const GAUGE_TOKEN_TOTAL_FUEL_QUANTITY_GALLONS: GAUGE_TOKEN = 386;
pub const GAUGE_TOKEN_SELECTED_FUEL_QUANTITY_GALLONS: GAUGE_TOKEN = 387;
pub const GAUGE_TOKEN_SELECTED_FUEL_QUANTITY_LITERS: GAUGE_TOKEN = 388;
pub const GAUGE_TOKEN_SELECTED_FUEL_QUANTITY_PERCENT: GAUGE_TOKEN = 389;
pub const GAUGE_TOKEN_RECIP_ENGINE1_ENGINE_RPM: GAUGE_TOKEN = 390;
pub const GAUGE_TOKEN_RECIP_ENGINE1_MANIFOLD_PRESSURE: GAUGE_TOKEN = 391;
pub const GAUGE_TOKEN_RECIP_ENGINE1_THROTTLE_LEVER_POS: GAUGE_TOKEN = 392;
pub const GAUGE_TOKEN_RECIP_ENGINE1_MIXTURE_LEVER_POS: GAUGE_TOKEN = 393;
pub const GAUGE_TOKEN_RECIP_ENGINE1_PROP_LEVER_POS: GAUGE_TOKEN = 394;
pub const GAUGE_TOKEN_RECIP_ENGINE1_COWL_FLAP_POS: GAUGE_TOKEN = 395;
pub const GAUGE_TOKEN_RECIP_ENGINE1_CARB_HEAT_POS: GAUGE_TOKEN = 396;
pub const GAUGE_TOKEN_RECIP_ENGINE1_ALTERNATE_AIR_POS: GAUGE_TOKEN = 397;
pub const GAUGE_TOKEN_RECIP_ENGINE1_COOLANT_RESERVOIR_PCT: GAUGE_TOKEN = 398;
pub const GAUGE_TOKEN_RECIP_ENGINE1_LEFT_MAG: GAUGE_TOKEN = 399;
pub const GAUGE_TOKEN_RECIP_ENGINE1_RIGHT_MAG: GAUGE_TOKEN = 400;
pub const GAUGE_TOKEN_RECIP_ENGINE1_STARTER: GAUGE_TOKEN = 401;
pub const GAUGE_TOKEN_RECIP_ENGINE1_BRAKE_POWER: GAUGE_TOKEN = 402;
pub const GAUGE_TOKEN_RECIP_ENGINE1_SHAFT_TORQUE: GAUGE_TOKEN = 403;
pub const GAUGE_TOKEN_RECIP_ENGINE1_PROP_TORQUE: GAUGE_TOKEN = 404;
pub const GAUGE_TOKEN_RECIP_ENGINE1_STARTER_TORQUE: GAUGE_TOKEN = 405;
pub const GAUGE_TOKEN_RECIP_ENGINE1_COMBUSTION: GAUGE_TOKEN = 406;
pub const GAUGE_TOKEN_RECIP_ENGINE1_TURBOCHARGER_FAILED: GAUGE_TOKEN = 407;
pub const GAUGE_TOKEN_RECIP_ENGINE1_EMERGENCY_BOOST_ACTIVE: GAUGE_TOKEN = 408;
pub const GAUGE_TOKEN_RECIP_ENGINE1_EMERGENCY_BOOST_ELAPSED_TIME: GAUGE_TOKEN = 409;
pub const GAUGE_TOKEN_RECIP_ENGINE1_WASTEGATE_POS: GAUGE_TOKEN = 410;
pub const GAUGE_TOKEN_RECIP_ENGINE1_PROP_BETA: GAUGE_TOKEN = 411;
pub const GAUGE_TOKEN_RECIP_ENGINE1_THRUST: GAUGE_TOKEN = 412;
pub const GAUGE_TOKEN_RECIP_ENGINE1_EGT_DEGR: GAUGE_TOKEN = 413;
pub const GAUGE_TOKEN_RECIP_ENGINE1_TIT_DEGR: GAUGE_TOKEN = 414;
pub const GAUGE_TOKEN_RECIP_ENGINE1_CHT_DEGR: GAUGE_TOKEN = 415;
pub const GAUGE_TOKEN_RECIP_ENGINE1_OIL_TEMP_DEGR: GAUGE_TOKEN = 416;
pub const GAUGE_TOKEN_RECIP_ENGINE1_RADIATOR_DEGR: GAUGE_TOKEN = 417;
pub const GAUGE_TOKEN_RECIP_ENGINE1_OIL_PRESS_PSF: GAUGE_TOKEN = 418;
pub const GAUGE_TOKEN_RECIP_ENGINE1_OIL_LEAK_PCT: GAUGE_TOKEN = 419;
pub const GAUGE_TOKEN_RECIP_ENGINE1_FUEL_AVAILABLE: GAUGE_TOKEN = 420;
pub const GAUGE_TOKEN_RECIP_ENGINE1_FUELFLOW_PPH: GAUGE_TOKEN = 421;
pub const GAUGE_TOKEN_RECIP_ENGINE1_TANK_SELECTOR: GAUGE_TOKEN = 422;
pub const GAUGE_TOKEN_RECIP_ENGINE1_TANKS_USED: GAUGE_TOKEN = 423;
pub const GAUGE_TOKEN_RECIP_ENGINE1_NUMBER_OF_TANKS_USED: GAUGE_TOKEN = 424;
pub const GAUGE_TOKEN_RECIP_ENGINE1_FUEL_PRESSURE_PSF: GAUGE_TOKEN = 425;
pub const GAUGE_TOKEN_RECIP_ENGINE1_COMBUSTION_SOUND_PCT: GAUGE_TOKEN = 426;
pub const GAUGE_TOKEN_RECIP_ENGINE1_INDUCED_VELOCITY: GAUGE_TOKEN = 427;
pub const GAUGE_TOKEN_RECIP_ENGINE1_DAMAGE_PERCENT: GAUGE_TOKEN = 428;
pub const GAUGE_TOKEN_RECIP_ENGINE2_ENGINE_RPM: GAUGE_TOKEN = 429;
pub const GAUGE_TOKEN_RECIP_ENGINE2_MANIFOLD_PRESSURE: GAUGE_TOKEN = 430;
pub const GAUGE_TOKEN_RECIP_ENGINE2_THROTTLE_LEVER_POS: GAUGE_TOKEN = 431;
pub const GAUGE_TOKEN_RECIP_ENGINE2_MIXTURE_LEVER_POS: GAUGE_TOKEN = 432;
pub const GAUGE_TOKEN_RECIP_ENGINE2_PROP_LEVER_POS: GAUGE_TOKEN = 433;
pub const GAUGE_TOKEN_RECIP_ENGINE2_COWL_FLAP_POS: GAUGE_TOKEN = 434;
pub const GAUGE_TOKEN_RECIP_ENGINE2_CARB_HEAT_POS: GAUGE_TOKEN = 435;
pub const GAUGE_TOKEN_RECIP_ENGINE2_ALTERNATE_AIR_POS: GAUGE_TOKEN = 436;
pub const GAUGE_TOKEN_RECIP_ENGINE2_COOLANT_RESERVOIR_PCT: GAUGE_TOKEN = 437;
pub const GAUGE_TOKEN_RECIP_ENGINE2_LEFT_MAG: GAUGE_TOKEN = 438;
pub const GAUGE_TOKEN_RECIP_ENGINE2_RIGHT_MAG: GAUGE_TOKEN = 439;
pub const GAUGE_TOKEN_RECIP_ENGINE2_STARTER: GAUGE_TOKEN = 440;
pub const GAUGE_TOKEN_RECIP_ENGINE2_BRAKE_POWER: GAUGE_TOKEN = 441;
pub const GAUGE_TOKEN_RECIP_ENGINE2_SHAFT_TORQUE: GAUGE_TOKEN = 442;
pub const GAUGE_TOKEN_RECIP_ENGINE2_PROP_TORQUE: GAUGE_TOKEN = 443;
pub const GAUGE_TOKEN_RECIP_ENGINE2_STARTER_TORQUE: GAUGE_TOKEN = 444;
pub const GAUGE_TOKEN_RECIP_ENGINE2_COMBUSTION: GAUGE_TOKEN = 445;
pub const GAUGE_TOKEN_RECIP_ENGINE2_TURBOCHARGER_FAILED: GAUGE_TOKEN = 446;
pub const GAUGE_TOKEN_RECIP_ENGINE2_EMERGENCY_BOOST_ACTIVE: GAUGE_TOKEN = 447;
pub const GAUGE_TOKEN_RECIP_ENGINE2_EMERGENCY_BOOST_ELAPSED_TIME: GAUGE_TOKEN = 448;
pub const GAUGE_TOKEN_RECIP_ENGINE2_WASTEGATE_POS: GAUGE_TOKEN = 449;
pub const GAUGE_TOKEN_RECIP_ENGINE2_PROP_BETA: GAUGE_TOKEN = 450;
pub const GAUGE_TOKEN_RECIP_ENGINE2_THRUST: GAUGE_TOKEN = 451;
pub const GAUGE_TOKEN_RECIP_ENGINE2_EGT_DEGR: GAUGE_TOKEN = 452;
pub const GAUGE_TOKEN_RECIP_ENGINE2_TIT_DEGR: GAUGE_TOKEN = 453;
pub const GAUGE_TOKEN_RECIP_ENGINE2_CHT_DEGR: GAUGE_TOKEN = 454;
pub const GAUGE_TOKEN_RECIP_ENGINE2_OIL_TEMP_DEGR: GAUGE_TOKEN = 455;
pub const GAUGE_TOKEN_RECIP_ENGINE2_RADIATOR_DEGR: GAUGE_TOKEN = 456;
pub const GAUGE_TOKEN_RECIP_ENGINE2_OIL_PRESS_PSF: GAUGE_TOKEN = 457;
pub const GAUGE_TOKEN_RECIP_ENGINE2_OIL_LEAK_PCT: GAUGE_TOKEN = 458;
pub const GAUGE_TOKEN_RECIP_ENGINE2_FUEL_AVAILABLE: GAUGE_TOKEN = 459;
pub const GAUGE_TOKEN_RECIP_ENGINE2_FUELFLOW_PPH: GAUGE_TOKEN = 460;
pub const GAUGE_TOKEN_RECIP_ENGINE2_TANK_SELECTOR: GAUGE_TOKEN = 461;
pub const GAUGE_TOKEN_RECIP_ENGINE2_TANKS_USED: GAUGE_TOKEN = 462;
pub const GAUGE_TOKEN_RECIP_ENGINE2_NUMBER_OF_TANKS_USED: GAUGE_TOKEN = 463;
pub const GAUGE_TOKEN_RECIP_ENGINE2_FUEL_PRESSURE_PSF: GAUGE_TOKEN = 464;
pub const GAUGE_TOKEN_RECIP_ENGINE2_COMBUSTION_SOUND_PCT: GAUGE_TOKEN = 465;
pub const GAUGE_TOKEN_RECIP_ENGINE2_INDUCED_VELOCITY: GAUGE_TOKEN = 466;
pub const GAUGE_TOKEN_RECIP_ENGINE2_DAMAGE_PERCENT: GAUGE_TOKEN = 467;
pub const GAUGE_TOKEN_RECIP_ENGINE3_ENGINE_RPM: GAUGE_TOKEN = 468;
pub const GAUGE_TOKEN_RECIP_ENGINE3_MANIFOLD_PRESSURE: GAUGE_TOKEN = 469;
pub const GAUGE_TOKEN_RECIP_ENGINE3_THROTTLE_LEVER_POS: GAUGE_TOKEN = 470;
pub const GAUGE_TOKEN_RECIP_ENGINE3_MIXTURE_LEVER_POS: GAUGE_TOKEN = 471;
pub const GAUGE_TOKEN_RECIP_ENGINE3_PROP_LEVER_POS: GAUGE_TOKEN = 472;
pub const GAUGE_TOKEN_RECIP_ENGINE3_COWL_FLAP_POS: GAUGE_TOKEN = 473;
pub const GAUGE_TOKEN_RECIP_ENGINE3_CARB_HEAT_POS: GAUGE_TOKEN = 474;
pub const GAUGE_TOKEN_RECIP_ENGINE3_ALTERNATE_AIR_POS: GAUGE_TOKEN = 475;
pub const GAUGE_TOKEN_RECIP_ENGINE3_COOLANT_RESERVOIR_PCT: GAUGE_TOKEN = 476;
pub const GAUGE_TOKEN_RECIP_ENGINE3_LEFT_MAG: GAUGE_TOKEN = 477;
pub const GAUGE_TOKEN_RECIP_ENGINE3_RIGHT_MAG: GAUGE_TOKEN = 478;
pub const GAUGE_TOKEN_RECIP_ENGINE3_STARTER: GAUGE_TOKEN = 479;
pub const GAUGE_TOKEN_RECIP_ENGINE3_BRAKE_POWER: GAUGE_TOKEN = 480;
pub const GAUGE_TOKEN_RECIP_ENGINE3_SHAFT_TORQUE: GAUGE_TOKEN = 481;
pub const GAUGE_TOKEN_RECIP_ENGINE3_PROP_TORQUE: GAUGE_TOKEN = 482;
pub const GAUGE_TOKEN_RECIP_ENGINE3_STARTER_TORQUE: GAUGE_TOKEN = 483;
pub const GAUGE_TOKEN_RECIP_ENGINE3_COMBUSTION: GAUGE_TOKEN = 484;
pub const GAUGE_TOKEN_RECIP_ENGINE3_TURBOCHARGER_FAILED: GAUGE_TOKEN = 485;
pub const GAUGE_TOKEN_RECIP_ENGINE3_EMERGENCY_BOOST_ACTIVE: GAUGE_TOKEN = 486;
pub const GAUGE_TOKEN_RECIP_ENGINE3_EMERGENCY_BOOST_ELAPSED_TIME: GAUGE_TOKEN = 487;
pub const GAUGE_TOKEN_RECIP_ENGINE3_WASTEGATE_POS: GAUGE_TOKEN = 488;
pub const GAUGE_TOKEN_RECIP_ENGINE3_PROP_BETA: GAUGE_TOKEN = 489;
pub const GAUGE_TOKEN_RECIP_ENGINE3_THRUST: GAUGE_TOKEN = 490;
pub const GAUGE_TOKEN_RECIP_ENGINE3_EGT_DEGR: GAUGE_TOKEN = 491;
pub const GAUGE_TOKEN_RECIP_ENGINE3_TIT_DEGR: GAUGE_TOKEN = 492;
pub const GAUGE_TOKEN_RECIP_ENGINE3_CHT_DEGR: GAUGE_TOKEN = 493;
pub const GAUGE_TOKEN_RECIP_ENGINE3_OIL_TEMP_DEGR: GAUGE_TOKEN = 494;
pub const GAUGE_TOKEN_RECIP_ENGINE3_RADIATOR_DEGR: GAUGE_TOKEN = 495;
pub const GAUGE_TOKEN_RECIP_ENGINE3_OIL_PRESS_PSF: GAUGE_TOKEN = 496;
pub const GAUGE_TOKEN_RECIP_ENGINE3_OIL_LEAK_PCT: GAUGE_TOKEN = 497;
pub const GAUGE_TOKEN_RECIP_ENGINE3_FUEL_AVAILABLE: GAUGE_TOKEN = 498;
pub const GAUGE_TOKEN_RECIP_ENGINE3_FUELFLOW_PPH: GAUGE_TOKEN = 499;
pub const GAUGE_TOKEN_RECIP_ENGINE3_TANK_SELECTOR: GAUGE_TOKEN = 500;
pub const GAUGE_TOKEN_RECIP_ENGINE3_TANKS_USED: GAUGE_TOKEN = 501;
pub const GAUGE_TOKEN_RECIP_ENGINE3_NUMBER_OF_TANKS_USED: GAUGE_TOKEN = 502;
pub const GAUGE_TOKEN_RECIP_ENGINE3_FUEL_PRESSURE_PSF: GAUGE_TOKEN = 503;
pub const GAUGE_TOKEN_RECIP_ENGINE3_COMBUSTION_SOUND_PCT: GAUGE_TOKEN = 504;
pub const GAUGE_TOKEN_RECIP_ENGINE3_INDUCED_VELOCITY: GAUGE_TOKEN = 505;
pub const GAUGE_TOKEN_RECIP_ENGINE3_DAMAGE_PERCENT: GAUGE_TOKEN = 506;
pub const GAUGE_TOKEN_RECIP_ENGINE4_ENGINE_RPM: GAUGE_TOKEN = 507;
pub const GAUGE_TOKEN_RECIP_ENGINE4_MANIFOLD_PRESSURE: GAUGE_TOKEN = 508;
pub const GAUGE_TOKEN_RECIP_ENGINE4_THROTTLE_LEVER_POS: GAUGE_TOKEN = 509;
pub const GAUGE_TOKEN_RECIP_ENGINE4_MIXTURE_LEVER_POS: GAUGE_TOKEN = 510;
pub const GAUGE_TOKEN_RECIP_ENGINE4_PROP_LEVER_POS: GAUGE_TOKEN = 511;
pub const GAUGE_TOKEN_RECIP_ENGINE4_COWL_FLAP_POS: GAUGE_TOKEN = 512;
pub const GAUGE_TOKEN_RECIP_ENGINE4_CARB_HEAT_POS: GAUGE_TOKEN = 513;
pub const GAUGE_TOKEN_RECIP_ENGINE4_ALTERNATE_AIR_POS: GAUGE_TOKEN = 514;
pub const GAUGE_TOKEN_RECIP_ENGINE4_COOLANT_RESERVOIR_PCT: GAUGE_TOKEN = 515;
pub const GAUGE_TOKEN_RECIP_ENGINE4_LEFT_MAG: GAUGE_TOKEN = 516;
pub const GAUGE_TOKEN_RECIP_ENGINE4_RIGHT_MAG: GAUGE_TOKEN = 517;
pub const GAUGE_TOKEN_RECIP_ENGINE4_STARTER: GAUGE_TOKEN = 518;
pub const GAUGE_TOKEN_RECIP_ENGINE4_BRAKE_POWER: GAUGE_TOKEN = 519;
pub const GAUGE_TOKEN_RECIP_ENGINE4_SHAFT_TORQUE: GAUGE_TOKEN = 520;
pub const GAUGE_TOKEN_RECIP_ENGINE4_PROP_TORQUE: GAUGE_TOKEN = 521;
pub const GAUGE_TOKEN_RECIP_ENGINE4_STARTER_TORQUE: GAUGE_TOKEN = 522;
pub const GAUGE_TOKEN_RECIP_ENGINE4_COMBUSTION: GAUGE_TOKEN = 523;
pub const GAUGE_TOKEN_RECIP_ENGINE4_TURBOCHARGER_FAILED: GAUGE_TOKEN = 524;
pub const GAUGE_TOKEN_RECIP_ENGINE4_EMERGENCY_BOOST_ACTIVE: GAUGE_TOKEN = 525;
pub const GAUGE_TOKEN_RECIP_ENGINE4_EMERGENCY_BOOST_ELAPSED_TIME: GAUGE_TOKEN = 526;
pub const GAUGE_TOKEN_RECIP_ENGINE4_WASTEGATE_POS: GAUGE_TOKEN = 527;
pub const GAUGE_TOKEN_RECIP_ENGINE4_PROP_BETA: GAUGE_TOKEN = 528;
pub const GAUGE_TOKEN_RECIP_ENGINE4_THRUST: GAUGE_TOKEN = 529;
pub const GAUGE_TOKEN_RECIP_ENGINE4_EGT_DEGR: GAUGE_TOKEN = 530;
pub const GAUGE_TOKEN_RECIP_ENGINE4_TIT_DEGR: GAUGE_TOKEN = 531;
pub const GAUGE_TOKEN_RECIP_ENGINE4_CHT_DEGR: GAUGE_TOKEN = 532;
pub const GAUGE_TOKEN_RECIP_ENGINE4_OIL_TEMP_DEGR: GAUGE_TOKEN = 533;
pub const GAUGE_TOKEN_RECIP_ENGINE4_RADIATOR_DEGR: GAUGE_TOKEN = 534;
pub const GAUGE_TOKEN_RECIP_ENGINE4_OIL_PRESS_PSF: GAUGE_TOKEN = 535;
pub const GAUGE_TOKEN_RECIP_ENGINE4_OIL_LEAK_PCT: GAUGE_TOKEN = 536;
pub const GAUGE_TOKEN_RECIP_ENGINE4_FUEL_AVAILABLE: GAUGE_TOKEN = 537;
pub const GAUGE_TOKEN_RECIP_ENGINE4_FUELFLOW_PPH: GAUGE_TOKEN = 538;
pub const GAUGE_TOKEN_RECIP_ENGINE4_TANK_SELECTOR: GAUGE_TOKEN = 539;
pub const GAUGE_TOKEN_RECIP_ENGINE4_TANKS_USED: GAUGE_TOKEN = 540;
pub const GAUGE_TOKEN_RECIP_ENGINE4_NUMBER_OF_TANKS_USED: GAUGE_TOKEN = 541;
pub const GAUGE_TOKEN_RECIP_ENGINE4_FUEL_PRESSURE_PSF: GAUGE_TOKEN = 542;
pub const GAUGE_TOKEN_RECIP_ENGINE4_COMBUSTION_SOUND_PCT: GAUGE_TOKEN = 543;
pub const GAUGE_TOKEN_RECIP_ENGINE4_INDUCED_VELOCITY: GAUGE_TOKEN = 544;
pub const GAUGE_TOKEN_RECIP_ENGINE4_DAMAGE_PERCENT: GAUGE_TOKEN = 545;
pub const GAUGE_TOKEN_FUEL_QUANTITY_CENTER3: GAUGE_TOKEN = 546;
pub const GAUGE_TOKEN_SCORE_STRING_QUICK_COMBAT: GAUGE_TOKEN = 547;
pub const GAUGE_TOKEN_SCORE_STRING_MULTIPLAYER: GAUGE_TOKEN = 548;
pub const GAUGE_TOKEN_IS_MULTIPLAYER_TEAM_COMBAT: GAUGE_TOKEN = 549;
pub const GAUGE_TOKEN_VOR1_BEARING_DEGREES: GAUGE_TOKEN = 550;
pub const GAUGE_TOKEN_FORWARD_GROUND_VELOCITY: GAUGE_TOKEN = 551;
pub const GAUGE_TOKEN_SIDE_GROUND_VELOCITY: GAUGE_TOKEN = 552;
pub const GAUGE_TOKEN_VERTICAL_GROUND_VELOCITY: GAUGE_TOKEN = 553;
pub const GAUGE_TOKEN_NORTH_VELOCITY: GAUGE_TOKEN = 554;
pub const GAUGE_TOKEN_EAST_VELOCITY: GAUGE_TOKEN = 555;
pub const GAUGE_TOKEN_VERTICAL_VELOCITY: GAUGE_TOKEN = 556;
pub const GAUGE_TOKEN_CLOCK_TOTAL_SECONDS: GAUGE_TOKEN = 557;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_THROTTLE_LEVER_POS: GAUGE_TOKEN = 558;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_PROPELLER_LEVER_POS: GAUGE_TOKEN = 559;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_MIXTURE_LEVER_POS: GAUGE_TOKEN = 560;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_OIL_TEMP: GAUGE_TOKEN = 561;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_OIL_PRES: GAUGE_TOKEN = 562;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_STARTER: GAUGE_TOKEN = 563;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_FAILURE: GAUGE_TOKEN = 564;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_GENERATOR_SWITCH: GAUGE_TOKEN = 565;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_GENERATOR_ACTIVE: GAUGE_TOKEN = 566;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_EGT: GAUGE_TOKEN = 567;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_THROTTLE_LEVER_POS: GAUGE_TOKEN = 568;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_PROPELLER_LEVER_POS: GAUGE_TOKEN = 569;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_MIXTURE_LEVER_POS: GAUGE_TOKEN = 570;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_OIL_TEMP: GAUGE_TOKEN = 571;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_OIL_PRES: GAUGE_TOKEN = 572;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_STARTER: GAUGE_TOKEN = 573;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_FAILURE: GAUGE_TOKEN = 574;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_GENERATOR_SWITCH: GAUGE_TOKEN = 575;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_GENERATOR_ACTIVE: GAUGE_TOKEN = 576;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_EGT: GAUGE_TOKEN = 577;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_THROTTLE_LEVER_POS: GAUGE_TOKEN = 578;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_PROPELLER_LEVER_POS: GAUGE_TOKEN = 579;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_MIXTURE_LEVER_POS: GAUGE_TOKEN = 580;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_OIL_TEMP: GAUGE_TOKEN = 581;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_OIL_PRES: GAUGE_TOKEN = 582;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_STARTER: GAUGE_TOKEN = 583;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_FAILURE: GAUGE_TOKEN = 584;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_GENERATOR_SWITCH: GAUGE_TOKEN = 585;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_GENERATOR_ACTIVE: GAUGE_TOKEN = 586;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_EGT: GAUGE_TOKEN = 587;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_THROTTLE_LEVER_POS: GAUGE_TOKEN = 588;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_PROPELLER_LEVER_POS: GAUGE_TOKEN = 589;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_MIXTURE_LEVER_POS: GAUGE_TOKEN = 590;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_OIL_TEMP: GAUGE_TOKEN = 591;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_OIL_PRES: GAUGE_TOKEN = 592;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_STARTER: GAUGE_TOKEN = 593;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_FAILURE: GAUGE_TOKEN = 594;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_GENERATOR_SWITCH: GAUGE_TOKEN = 595;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_GENERATOR_ACTIVE: GAUGE_TOKEN = 596;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_EGT: GAUGE_TOKEN = 597;
pub const GAUGE_TOKEN_NAV1_COMMNAV_TEST: GAUGE_TOKEN = 598;
pub const GAUGE_TOKEN_NAV2_COMMNAV_TEST: GAUGE_TOKEN = 599;
pub const GAUGE_TOKEN_COM1_AUTOSWITCH_ON: GAUGE_TOKEN = 600;
pub const GAUGE_TOKEN_NAV1_AUTOSWITCH_ON: GAUGE_TOKEN = 601;
pub const GAUGE_TOKEN_COM2_AUTOSWITCH_ON: GAUGE_TOKEN = 602;
pub const GAUGE_TOKEN_NAV2_AUTOSWITCH_ON: GAUGE_TOKEN = 603;
pub const GAUGE_TOKEN_ELAPSED_SECONDS: GAUGE_TOKEN = 604;
pub const GAUGE_TOKEN_G_FORCE_MAXIMUM: GAUGE_TOKEN = 605;
pub const GAUGE_TOKEN_G_FORCE_MINIMUM: GAUGE_TOKEN = 606;
pub const GAUGE_TOKEN_ENGINE_WORKING_TIME: GAUGE_TOKEN = 607;
pub const GAUGE_TOKEN_ENGINE1_MAX_RPM: GAUGE_TOKEN = 608;
pub const GAUGE_TOKEN_ENGINE2_MAX_RPM: GAUGE_TOKEN = 609;
pub const GAUGE_TOKEN_ENGINE3_MAX_RPM: GAUGE_TOKEN = 610;
pub const GAUGE_TOKEN_ENGINE4_MAX_RPM: GAUGE_TOKEN = 611;
pub const GAUGE_TOKEN_ATTITUDE_BARS_POSITION: GAUGE_TOKEN = 612;
pub const GAUGE_TOKEN_RAD_INS_SWITCH: GAUGE_TOKEN = 613;
pub const GAUGE_TOKEN_RADIO_HEIGHT: GAUGE_TOKEN = 614;
pub const GAUGE_TOKEN_DECISION_HEIGHT: GAUGE_TOKEN = 615;
pub const GAUGE_TOKEN_LOW_HEIGHT_WARNING: GAUGE_TOKEN = 616;
pub const GAUGE_TOKEN_COM_STBY_FREQUENCY: GAUGE_TOKEN = 617;
pub const GAUGE_TOKEN_COM_RADIO_25_KHZ_TUNABLE: GAUGE_TOKEN = 618;
pub const GAUGE_TOKEN_NAV_LIGHTS: GAUGE_TOKEN = 619;
pub const GAUGE_TOKEN_LOGO_LIGHTS: GAUGE_TOKEN = 620;
pub const GAUGE_TOKEN_WING_LIGHTS: GAUGE_TOKEN = 621;
pub const GAUGE_TOKEN_RECOGNITION_LIGHTS: GAUGE_TOKEN = 622;
pub const GAUGE_TOKEN_RADIO_MORSE_IDENT_STATES: GAUGE_TOKEN = 623;
pub const GAUGE_TOKEN_TURB_ENGINE_1_N1: GAUGE_TOKEN = 624;
pub const GAUGE_TOKEN_TURB_ENGINE_1_N2: GAUGE_TOKEN = 625;
pub const GAUGE_TOKEN_TURB_ENGINE_1_CORRECTED_N1: GAUGE_TOKEN = 626;
pub const GAUGE_TOKEN_TURB_ENGINE_1_CORRECTED_N2: GAUGE_TOKEN = 627;
pub const GAUGE_TOKEN_TURB_ENGINE_1_CORRECTED_FF: GAUGE_TOKEN = 628;
pub const GAUGE_TOKEN_TURB_ENGINE_1_PCT_MAX_TORQUE: GAUGE_TOKEN = 629;
pub const GAUGE_TOKEN_TURB_ENGINE_1_EPR: GAUGE_TOKEN = 630;
pub const GAUGE_TOKEN_TURB_ENGINE_1_ITT: GAUGE_TOKEN = 631;
pub const GAUGE_TOKEN_TURB_ENGINE_1_AFTERBURNER: GAUGE_TOKEN = 632;
pub const GAUGE_TOKEN_TURB_ENGINE_1_JET_THRUST: GAUGE_TOKEN = 633;
pub const GAUGE_TOKEN_TURB_ENGINE_1_BLEEDAIRPSI: GAUGE_TOKEN = 634;
pub const GAUGE_TOKEN_TURB_ENGINE_1_TANK_SELECTOR: GAUGE_TOKEN = 635;
pub const GAUGE_TOKEN_TURB_ENGINE_1_TANKS_USED: GAUGE_TOKEN = 636;
pub const GAUGE_TOKEN_TURB_ENGINE_1_NUMBER_TANKS: GAUGE_TOKEN = 637;
pub const GAUGE_TOKEN_TURB_ENGINE_1_FUELFLOW_PPH: GAUGE_TOKEN = 638;
pub const GAUGE_TOKEN_TURB_ENGINE_1_FUEL_AVAILABLE: GAUGE_TOKEN = 639;
pub const GAUGE_TOKEN_TURB_ENGINE_1_PCT_AREA: GAUGE_TOKEN = 640;
pub const GAUGE_TOKEN_TURB_ENGINE_1_PCT_REVERSER: GAUGE_TOKEN = 641;
pub const GAUGE_TOKEN_TURB_ENGINE_1_VIBRATION: GAUGE_TOKEN = 642;
pub const GAUGE_TOKEN_TURB_ENGINE_2_N1: GAUGE_TOKEN = 643;
pub const GAUGE_TOKEN_TURB_ENGINE_2_N2: GAUGE_TOKEN = 644;
pub const GAUGE_TOKEN_TURB_ENGINE_2_CORRECTED_N1: GAUGE_TOKEN = 645;
pub const GAUGE_TOKEN_TURB_ENGINE_2_CORRECTED_N2: GAUGE_TOKEN = 646;
pub const GAUGE_TOKEN_TURB_ENGINE_2_CORRECTED_FF: GAUGE_TOKEN = 647;
pub const GAUGE_TOKEN_TURB_ENGINE_2_PCT_MAX_TORQUE: GAUGE_TOKEN = 648;
pub const GAUGE_TOKEN_TURB_ENGINE_2_EPR: GAUGE_TOKEN = 649;
pub const GAUGE_TOKEN_TURB_ENGINE_2_ITT: GAUGE_TOKEN = 650;
pub const GAUGE_TOKEN_TURB_ENGINE_2_AFTERBURNER: GAUGE_TOKEN = 651;
pub const GAUGE_TOKEN_TURB_ENGINE_2_JET_THRUST: GAUGE_TOKEN = 652;
pub const GAUGE_TOKEN_TURB_ENGINE_2_BLEEDAIRPSI: GAUGE_TOKEN = 653;
pub const GAUGE_TOKEN_TURB_ENGINE_2_TANK_SELECTOR: GAUGE_TOKEN = 654;
pub const GAUGE_TOKEN_TURB_ENGINE_2_TANKS_USED: GAUGE_TOKEN = 655;
pub const GAUGE_TOKEN_TURB_ENGINE_2_NUMBER_TANKS: GAUGE_TOKEN = 656;
pub const GAUGE_TOKEN_TURB_ENGINE_2_FUELFLOW_PPH: GAUGE_TOKEN = 657;
pub const GAUGE_TOKEN_TURB_ENGINE_2_FUEL_AVAILABLE: GAUGE_TOKEN = 658;
pub const GAUGE_TOKEN_TURB_ENGINE_2_PCT_AREA: GAUGE_TOKEN = 659;
pub const GAUGE_TOKEN_TURB_ENGINE_2_PCT_REVERSER: GAUGE_TOKEN = 660;
pub const GAUGE_TOKEN_TURB_ENGINE_2_VIBRATION: GAUGE_TOKEN = 661;
pub const GAUGE_TOKEN_TURB_ENGINE_3_N1: GAUGE_TOKEN = 662;
pub const GAUGE_TOKEN_TURB_ENGINE_3_N2: GAUGE_TOKEN = 663;
pub const GAUGE_TOKEN_TURB_ENGINE_3_CORRECTED_N1: GAUGE_TOKEN = 664;
pub const GAUGE_TOKEN_TURB_ENGINE_3_CORRECTED_N2: GAUGE_TOKEN = 665;
pub const GAUGE_TOKEN_TURB_ENGINE_3_CORRECTED_FF: GAUGE_TOKEN = 666;
pub const GAUGE_TOKEN_TURB_ENGINE_3_PCT_MAX_TORQUE: GAUGE_TOKEN = 667;
pub const GAUGE_TOKEN_TURB_ENGINE_3_EPR: GAUGE_TOKEN = 668;
pub const GAUGE_TOKEN_TURB_ENGINE_3_ITT: GAUGE_TOKEN = 669;
pub const GAUGE_TOKEN_TURB_ENGINE_3_AFTERBURNER: GAUGE_TOKEN = 670;
pub const GAUGE_TOKEN_TURB_ENGINE_3_JET_THRUST: GAUGE_TOKEN = 671;
pub const GAUGE_TOKEN_TURB_ENGINE_3_BLEEDAIRPSI: GAUGE_TOKEN = 672;
pub const GAUGE_TOKEN_TURB_ENGINE_3_TANK_SELECTOR: GAUGE_TOKEN = 673;
pub const GAUGE_TOKEN_TURB_ENGINE_3_TANKS_USED: GAUGE_TOKEN = 674;
pub const GAUGE_TOKEN_TURB_ENGINE_3_NUMBER_TANKS: GAUGE_TOKEN = 675;
pub const GAUGE_TOKEN_TURB_ENGINE_3_FUELFLOW_PPH: GAUGE_TOKEN = 676;
pub const GAUGE_TOKEN_TURB_ENGINE_3_FUEL_AVAILABLE: GAUGE_TOKEN = 677;
pub const GAUGE_TOKEN_TURB_ENGINE_3_PCT_AREA: GAUGE_TOKEN = 678;
pub const GAUGE_TOKEN_TURB_ENGINE_3_PCT_REVERSER: GAUGE_TOKEN = 679;
pub const GAUGE_TOKEN_TURB_ENGINE_3_VIBRATION: GAUGE_TOKEN = 680;
pub const GAUGE_TOKEN_TURB_ENGINE_4_N1: GAUGE_TOKEN = 681;
pub const GAUGE_TOKEN_TURB_ENGINE_4_N2: GAUGE_TOKEN = 682;
pub const GAUGE_TOKEN_TURB_ENGINE_4_CORRECTED_N1: GAUGE_TOKEN = 683;
pub const GAUGE_TOKEN_TURB_ENGINE_4_CORRECTED_N2: GAUGE_TOKEN = 684;
pub const GAUGE_TOKEN_TURB_ENGINE_4_CORRECTED_FF: GAUGE_TOKEN = 685;
pub const GAUGE_TOKEN_TURB_ENGINE_4_PCT_MAX_TORQUE: GAUGE_TOKEN = 686;
pub const GAUGE_TOKEN_TURB_ENGINE_4_EPR: GAUGE_TOKEN = 687;
pub const GAUGE_TOKEN_TURB_ENGINE_4_ITT: GAUGE_TOKEN = 688;
pub const GAUGE_TOKEN_TURB_ENGINE_4_AFTERBURNER: GAUGE_TOKEN = 689;
pub const GAUGE_TOKEN_TURB_ENGINE_4_JET_THRUST: GAUGE_TOKEN = 690;
pub const GAUGE_TOKEN_TURB_ENGINE_4_BLEEDAIRPSI: GAUGE_TOKEN = 691;
pub const GAUGE_TOKEN_TURB_ENGINE_4_TANK_SELECTOR: GAUGE_TOKEN = 692;
pub const GAUGE_TOKEN_TURB_ENGINE_4_TANKS_USED: GAUGE_TOKEN = 693;
pub const GAUGE_TOKEN_TURB_ENGINE_4_NUMBER_TANKS: GAUGE_TOKEN = 694;
pub const GAUGE_TOKEN_TURB_ENGINE_4_FUELFLOW_PPH: GAUGE_TOKEN = 695;
pub const GAUGE_TOKEN_TURB_ENGINE_4_FUEL_AVAILABLE: GAUGE_TOKEN = 696;
pub const GAUGE_TOKEN_TURB_ENGINE_4_PCT_AREA: GAUGE_TOKEN = 697;
pub const GAUGE_TOKEN_TURB_ENGINE_4_PCT_REVERSER: GAUGE_TOKEN = 698;
pub const GAUGE_TOKEN_TURB_ENGINE_4_VIBRATION: GAUGE_TOKEN = 699;
pub const GAUGE_TOKEN_PROPELLER_1_RPM: GAUGE_TOKEN = 700;
pub const GAUGE_TOKEN_PROPELLER_1_PCT_MAX_RPM: GAUGE_TOKEN = 701;
pub const GAUGE_TOKEN_PROPELLER_1_THRUST: GAUGE_TOKEN = 702;
pub const GAUGE_TOKEN_PROPELLER_1_BETA: GAUGE_TOKEN = 703;
pub const GAUGE_TOKEN_PROPELLER_1_FEATHERING_INHIBIT: GAUGE_TOKEN = 704;
pub const GAUGE_TOKEN_PROPELLER_1_FEATHERED: GAUGE_TOKEN = 705;
pub const GAUGE_TOKEN_PROPELLER_1_SYNC_DELTA_LEVER: GAUGE_TOKEN = 706;
pub const GAUGE_TOKEN_PROPELLER_1_AUTOFEATHER_ARMED: GAUGE_TOKEN = 707;
pub const GAUGE_TOKEN_PROPELLER_2_RPM: GAUGE_TOKEN = 708;
pub const GAUGE_TOKEN_PROPELLER_2_PCT_MAX_RPM: GAUGE_TOKEN = 709;
pub const GAUGE_TOKEN_PROPELLER_2_THRUST: GAUGE_TOKEN = 710;
pub const GAUGE_TOKEN_PROPELLER_2_BETA: GAUGE_TOKEN = 711;
pub const GAUGE_TOKEN_PROPELLER_2_FEATHERING_INHIBIT: GAUGE_TOKEN = 712;
pub const GAUGE_TOKEN_PROPELLER_2_FEATHERED: GAUGE_TOKEN = 713;
pub const GAUGE_TOKEN_PROPELLER_2_SYNC_DELTA_LEVER: GAUGE_TOKEN = 714;
pub const GAUGE_TOKEN_PROPELLER_2_AUTOFEATHER_ARMED: GAUGE_TOKEN = 715;
pub const GAUGE_TOKEN_PROPELLER_3_RPM: GAUGE_TOKEN = 716;
pub const GAUGE_TOKEN_PROPELLER_3_PCT_MAX_RPM: GAUGE_TOKEN = 717;
pub const GAUGE_TOKEN_PROPELLER_3_THRUST: GAUGE_TOKEN = 718;
pub const GAUGE_TOKEN_PROPELLER_3_BETA: GAUGE_TOKEN = 719;
pub const GAUGE_TOKEN_PROPELLER_3_FEATHERING_INHIBIT: GAUGE_TOKEN = 720;
pub const GAUGE_TOKEN_PROPELLER_3_FEATHERED: GAUGE_TOKEN = 721;
pub const GAUGE_TOKEN_PROPELLER_3_SYNC_DELTA_LEVER: GAUGE_TOKEN = 722;
pub const GAUGE_TOKEN_PROPELLER_3_AUTOFEATHER_ARMED: GAUGE_TOKEN = 723;
pub const GAUGE_TOKEN_PROPELLER_4_RPM: GAUGE_TOKEN = 724;
pub const GAUGE_TOKEN_PROPELLER_4_PCT_MAX_RPM: GAUGE_TOKEN = 725;
pub const GAUGE_TOKEN_PROPELLER_4_THRUST: GAUGE_TOKEN = 726;
pub const GAUGE_TOKEN_PROPELLER_4_BETA: GAUGE_TOKEN = 727;
pub const GAUGE_TOKEN_PROPELLER_4_FEATHERING_INHIBIT: GAUGE_TOKEN = 728;
pub const GAUGE_TOKEN_PROPELLER_4_FEATHERED: GAUGE_TOKEN = 729;
pub const GAUGE_TOKEN_PROPELLER_4_SYNC_DELTA_LEVER: GAUGE_TOKEN = 730;
pub const GAUGE_TOKEN_PROPELLER_4_AUTOFEATHER_ARMED: GAUGE_TOKEN = 731;
pub const GAUGE_TOKEN_HYDRAULICS1_PRESSURE_PSF: GAUGE_TOKEN = 732;
pub const GAUGE_TOKEN_HYDRAULICS1_RESERVOIR_PCT: GAUGE_TOKEN = 733;
pub const GAUGE_TOKEN_HYDRAULICS2_PRESSURE_PSF: GAUGE_TOKEN = 734;
pub const GAUGE_TOKEN_HYDRAULICS2_RESERVOIR_PCT: GAUGE_TOKEN = 735;
pub const GAUGE_TOKEN_HYDRAULICS3_PRESSURE_PSF: GAUGE_TOKEN = 736;
pub const GAUGE_TOKEN_HYDRAULICS3_RESERVOIR_PCT: GAUGE_TOKEN = 737;
pub const GAUGE_TOKEN_HYDRAULICS4_PRESSURE_PSF: GAUGE_TOKEN = 738;
pub const GAUGE_TOKEN_HYDRAULICS4_RESERVOIR_PCT: GAUGE_TOKEN = 739;
pub const GAUGE_TOKEN_AVIONICS_MASTER_SWITCH: GAUGE_TOKEN = 740;
pub const GAUGE_TOKEN_PANEL_AUTOFEATHER_SWITCH: GAUGE_TOKEN = 741;
pub const GAUGE_TOKEN_PANEL_ANTIICE_SWITCH: GAUGE_TOKEN = 742;
pub const GAUGE_TOKEN_PANEL_AUTOBRAKE_SWITCH: GAUGE_TOKEN = 743;
pub const GAUGE_TOKEN_DAY_OF_WEEK: GAUGE_TOKEN = 744;
pub const GAUGE_TOKEN_DAY_OF_MONTH: GAUGE_TOKEN = 745;
pub const GAUGE_TOKEN_CURRENT_MONTH: GAUGE_TOKEN = 746;
pub const GAUGE_TOKEN_CURRENT_YEAR: GAUGE_TOKEN = 747;
pub const GAUGE_TOKEN_TIME_ZONE_OFFSET: GAUGE_TOKEN = 748;
pub const GAUGE_TOKEN_DAYLIGHT_SAVING_ACTIVE: GAUGE_TOKEN = 749;
pub const GAUGE_TOKEN_TOTAL_LOAD_AMPS: GAUGE_TOKEN = 750;
pub const GAUGE_TOKEN_BATTERY_LOAD: GAUGE_TOKEN = 751;
pub const GAUGE_TOKEN_BATTERY_VOLTAGE: GAUGE_TOKEN = 752;
pub const GAUGE_TOKEN_MAIN_BUS_VOLTAGE: GAUGE_TOKEN = 753;
pub const GAUGE_TOKEN_MAIN_BUS_AMPS: GAUGE_TOKEN = 754;
pub const GAUGE_TOKEN_AVIONICS_BUS_VOLTAGE: GAUGE_TOKEN = 755;
pub const GAUGE_TOKEN_AVIONICS_BUS_AMPS: GAUGE_TOKEN = 756;
pub const GAUGE_TOKEN_HOT_BATTERY_BUS_VOLTAGE: GAUGE_TOKEN = 757;
pub const GAUGE_TOKEN_HOT_BATTERY_BUS_AMPS: GAUGE_TOKEN = 758;
pub const GAUGE_TOKEN_BATTERY_BUS_VOLTAGE: GAUGE_TOKEN = 759;
pub const GAUGE_TOKEN_BATTERY_BUS_AMPS: GAUGE_TOKEN = 760;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_1_BUS_VOLTAGE: GAUGE_TOKEN = 761;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_1_BUS_AMPS: GAUGE_TOKEN = 762;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_2_BUS_VOLTAGE: GAUGE_TOKEN = 763;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_2_BUS_AMPS: GAUGE_TOKEN = 764;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_3_BUS_VOLTAGE: GAUGE_TOKEN = 765;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_3_BUS_AMPS: GAUGE_TOKEN = 766;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_4_BUS_VOLTAGE: GAUGE_TOKEN = 767;
pub const GAUGE_TOKEN_GENERATOR_ALTERNATOR_4_BUS_AMPS: GAUGE_TOKEN = 768;
pub const GAUGE_TOKEN_GENERAL_PANEL_CIRCUIT_ON: GAUGE_TOKEN = 769;
pub const GAUGE_TOKEN_FLAP_MOTOR_CIRCUIT_ON: GAUGE_TOKEN = 770;
pub const GAUGE_TOKEN_GEAR_MOTOR_CIRCUIT_ON: GAUGE_TOKEN = 771;
pub const GAUGE_TOKEN_AUTOPILOT_CIRCUIT_ON: GAUGE_TOKEN = 772;
pub const GAUGE_TOKEN_AVIONICS_CIRCUIT_ON: GAUGE_TOKEN = 773;
pub const GAUGE_TOKEN_PITOT_HEAT_CIRCUIT_ON: GAUGE_TOKEN = 774;
pub const GAUGE_TOKEN_PROP_SYNC_CIRCUIT_ON: GAUGE_TOKEN = 775;
pub const GAUGE_TOKEN_AUTO_FEATHER_CIRCUIT_ON: GAUGE_TOKEN = 776;
pub const GAUGE_TOKEN_AUTO_BRAKES_CIRCUIT_ON: GAUGE_TOKEN = 777;
pub const GAUGE_TOKEN_STANDBY_VACUUM_CIRCUIT_ON: GAUGE_TOKEN = 778;
pub const GAUGE_TOKEN_MARKER_BEACON_CIRCUIT_ON: GAUGE_TOKEN = 779;
pub const GAUGE_TOKEN_GEAR_WARNING_CIRCUIT_ON: GAUGE_TOKEN = 780;
pub const GAUGE_TOKEN_HYDRAULIC_PUMP_CIRCUIT_ON: GAUGE_TOKEN = 781;
pub const GAUGE_TOKEN_ELEVATOR_DEFLECTION: GAUGE_TOKEN = 782;
pub const GAUGE_TOKEN_ELEVATOR_TRIM: GAUGE_TOKEN = 783;
pub const GAUGE_TOKEN_AILERON_DEFLECTION: GAUGE_TOKEN = 784;
pub const GAUGE_TOKEN_AILERON_TRIM: GAUGE_TOKEN = 785;
pub const GAUGE_TOKEN_RUDDER_DEFLECTION: GAUGE_TOKEN = 786;
pub const GAUGE_TOKEN_RUDDER_TRIM: GAUGE_TOKEN = 787;
pub const GAUGE_TOKEN_PROPSYNC_ACTIVE: GAUGE_TOKEN = 788;
pub const GAUGE_TOKEN_INCIDENCE_ALPHA: GAUGE_TOKEN = 789;
pub const GAUGE_TOKEN_INCIDENCE_BETA: GAUGE_TOKEN = 790;
pub const GAUGE_TOKEN_TOTAL_FUEL_QUANTITY_LBS: GAUGE_TOKEN = 791;
pub const GAUGE_TOKEN_FLIGHT_DIRECTOR_ACTIVE: GAUGE_TOKEN = 792;
pub const GAUGE_TOKEN_FLIGHT_DIRECTOR_PITCH: GAUGE_TOKEN = 793;
pub const GAUGE_TOKEN_FLIGHT_DIRECTOR_BANK: GAUGE_TOKEN = 794;
pub const GAUGE_TOKEN_CG_PERCENT: GAUGE_TOKEN = 795;
pub const GAUGE_TOKEN_CG_AFT_LIMIT: GAUGE_TOKEN = 796;
pub const GAUGE_TOKEN_CG_FWD_LIMIT: GAUGE_TOKEN = 797;
pub const GAUGE_TOKEN_CG_MAX_MACH: GAUGE_TOKEN = 798;
pub const GAUGE_TOKEN_CG_MIN_MACH: GAUGE_TOKEN = 799;
pub const GAUGE_TOKEN_STANDARD_ATM_TEMPERATURE: GAUGE_TOKEN = 800;
pub const GAUGE_TOKEN_ENGINE_1_FUELFLOW_BUG_POSITION: GAUGE_TOKEN = 801;
pub const GAUGE_TOKEN_ENGINE_2_FUELFLOW_BUG_POSITION: GAUGE_TOKEN = 802;
pub const GAUGE_TOKEN_ENGINE_3_FUELFLOW_BUG_POSITION: GAUGE_TOKEN = 803;
pub const GAUGE_TOKEN_ENGINE_4_FUELFLOW_BUG_POSITION: GAUGE_TOKEN = 804;
pub const GAUGE_TOKEN_CONCORDE_VISOR_NOSE_HANDLE: GAUGE_TOKEN = 805;
pub const GAUGE_TOKEN_CONCORDE_VISOR_POS_PCT: GAUGE_TOKEN = 806;
pub const GAUGE_TOKEN_CONCORDE_NOSE_ANGLE: GAUGE_TOKEN = 807;
pub const GAUGE_TOKEN_GEAR_POS_TAIL: GAUGE_TOKEN = 808;
pub const GAUGE_TOKEN_ELEVON_1_DEFLECTION: GAUGE_TOKEN = 809;
pub const GAUGE_TOKEN_ELEVON_2_DEFLECTION: GAUGE_TOKEN = 810;
pub const GAUGE_TOKEN_ELEVON_3_DEFLECTION: GAUGE_TOKEN = 811;
pub const GAUGE_TOKEN_ELEVON_4_DEFLECTION: GAUGE_TOKEN = 812;
pub const GAUGE_TOKEN_ELEVON_5_DEFLECTION: GAUGE_TOKEN = 813;
pub const GAUGE_TOKEN_ELEVON_6_DEFLECTION: GAUGE_TOKEN = 814;
pub const GAUGE_TOKEN_ELEVON_7_DEFLECTION: GAUGE_TOKEN = 815;
pub const GAUGE_TOKEN_ELEVON_8_DEFLECTION: GAUGE_TOKEN = 816;
pub const GAUGE_TOKEN_PANEL_AUTOPILOT_SPEED_SETTING: GAUGE_TOKEN = 817;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_ACQUISITION: GAUGE_TOKEN = 818;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_HOLD_CURRENT: GAUGE_TOKEN = 819;
pub const GAUGE_TOKEN_AUTOPILOT_MAX_SPEED: GAUGE_TOKEN = 820;
pub const GAUGE_TOKEN_AUTOPILOT_CRUISE_SPEED: GAUGE_TOKEN = 821;
pub const GAUGE_TOKEN_BARBER_POLE_MACH: GAUGE_TOKEN = 822;
pub const GAUGE_TOKEN_SELECTED_FUEL_TRANSFER_MODE: GAUGE_TOKEN = 823;
pub const GAUGE_TOKEN_HYDRAULIC_SYSTEM_INTEGRITY: GAUGE_TOKEN = 824;
pub const GAUGE_TOKEN_ATTITUDE_CAGE_BUTTON: GAUGE_TOKEN = 825;
pub const GAUGE_TOKEN_VOR1_NEEDLE_RADIO: GAUGE_TOKEN = 826;
pub const GAUGE_TOKEN_GPS_POSITION_LAT: GAUGE_TOKEN = 827;
pub const GAUGE_TOKEN_GPS_POSITION_LON: GAUGE_TOKEN = 828;
pub const GAUGE_TOKEN_GPS_POSITION_ALT: GAUGE_TOKEN = 829;
pub const GAUGE_TOKEN_GPS_MAGVAR: GAUGE_TOKEN = 830;
pub const GAUGE_TOKEN_GPS_FLAGS: GAUGE_TOKEN = 831;
pub const GAUGE_TOKEN_GPS_GROUND_SPEED: GAUGE_TOKEN = 832;
pub const GAUGE_TOKEN_GPS_GROUND_HEADING: GAUGE_TOKEN = 833;
pub const GAUGE_TOKEN_GPS_GROUND_TRACK: GAUGE_TOKEN = 834;
pub const GAUGE_TOKEN_GPS_WP_DISTANCE: GAUGE_TOKEN = 835;
pub const GAUGE_TOKEN_GPS_WP_BEARING: GAUGE_TOKEN = 836;
pub const GAUGE_TOKEN_GPS_WP_CROSS_TRK: GAUGE_TOKEN = 837;
pub const GAUGE_TOKEN_GPS_WP_REQ_HDG: GAUGE_TOKEN = 838;
pub const GAUGE_TOKEN_GPS_WP_STRING: GAUGE_TOKEN = 839;
pub const GAUGE_TOKEN_GPS_WP_NEXT_LAT: GAUGE_TOKEN = 840;
pub const GAUGE_TOKEN_GPS_WP_NEXT_LON: GAUGE_TOKEN = 841;
pub const GAUGE_TOKEN_GPS_WP_NEXT_ALT: GAUGE_TOKEN = 842;
pub const GAUGE_TOKEN_GPS_WP_PREV_LAT: GAUGE_TOKEN = 843;
pub const GAUGE_TOKEN_GPS_WP_PREV_LON: GAUGE_TOKEN = 844;
pub const GAUGE_TOKEN_GPS_WP_PREV_ALT: GAUGE_TOKEN = 845;
pub const GAUGE_TOKEN_GPS_WP_TRUE_BEARING: GAUGE_TOKEN = 846;
pub const GAUGE_TOKEN_GPS_WP_TRUE_REQ_HDG: GAUGE_TOKEN = 847;
pub const GAUGE_TOKEN_GPS_DRIVES_NAV1: GAUGE_TOKEN = 848;
pub const GAUGE_TOKEN_HSI_VERTICAL_NEEDLE: GAUGE_TOKEN = 849;
pub const GAUGE_TOKEN_HSI_HORIZONTAL_NEEDLE: GAUGE_TOKEN = 850;
pub const GAUGE_TOKEN_HSI_VERTICAL_VALID: GAUGE_TOKEN = 851;
pub const GAUGE_TOKEN_HSI_HORIZONTAL_VALID: GAUGE_TOKEN = 852;
pub const GAUGE_TOKEN_HSI_TF_FLAG: GAUGE_TOKEN = 853;
pub const GAUGE_TOKEN_HSI_OBI_NEEDLE: GAUGE_TOKEN = 854;
pub const GAUGE_TOKEN_HSI_DESIRED_HEADING_NEEDLE: GAUGE_TOKEN = 855;
pub const GAUGE_TOKEN_HSI_BEARING: GAUGE_TOKEN = 856;
pub const GAUGE_TOKEN_HSI_BEARING_VALID: GAUGE_TOKEN = 857;
pub const GAUGE_TOKEN_HSI_SIGNAL_LOCALISER: GAUGE_TOKEN = 858;
pub const GAUGE_TOKEN_HSI_SPEED: GAUGE_TOKEN = 859;
pub const GAUGE_TOKEN_HSI_DISTANCE: GAUGE_TOKEN = 860;
pub const GAUGE_TOKEN_HSI_STATION_NAME: GAUGE_TOKEN = 861;
pub const GAUGE_TOKEN_GEAR_POS_AUX: GAUGE_TOKEN = 862;
pub const GAUGE_TOKEN_TOOLTIP_UNITS: GAUGE_TOKEN = 863;
pub const GAUGE_TOKEN_LSO_TEXTURE_ID: GAUGE_TOKEN = 864;
pub const GAUGE_TOKEN_LSO_TEXT: GAUGE_TOKEN = 865;
pub const GAUGE_TOKEN_LEFT_FOLDING_WING_PERCENT: GAUGE_TOKEN = 866;
pub const GAUGE_TOKEN_RIGHT_FOLDING_WING_PERCENT: GAUGE_TOKEN = 867;
pub const GAUGE_TOKEN_MAIN_EXIT_OPEN: GAUGE_TOKEN = 868;
pub const GAUGE_TOKEN_TAILHOOK_POSITION: GAUGE_TOKEN = 869;
pub const GAUGE_TOKEN_COM2_FREQUENCY: GAUGE_TOKEN = 870;
pub const GAUGE_TOKEN_COM2_STBY_FREQUENCY: GAUGE_TOKEN = 871;
pub const GAUGE_TOKEN_NAV1_STBY_FREQUENCY: GAUGE_TOKEN = 872;
pub const GAUGE_TOKEN_NAV2_STBY_FREQUENCY: GAUGE_TOKEN = 873;
pub const GAUGE_TOKEN_COM1_TRANSMIT_SELECT: GAUGE_TOKEN = 874;
pub const GAUGE_TOKEN_COM2_TRANSMIT_SELECT: GAUGE_TOKEN = 875;
pub const GAUGE_TOKEN_COM_BOTH_RECEIVE: GAUGE_TOKEN = 876;
pub const GAUGE_TOKEN_NAV1_SOUND_TOGGLE: GAUGE_TOKEN = 877;
pub const GAUGE_TOKEN_NAV2_SOUND_TOGGLE: GAUGE_TOKEN = 878;
pub const GAUGE_TOKEN_DME_SOUND_TOGGLE: GAUGE_TOKEN = 879;
pub const GAUGE_TOKEN_ADF_SOUND_TOGGLE: GAUGE_TOKEN = 880;
pub const GAUGE_TOKEN_MARKER_SOUND_TOGGLE: GAUGE_TOKEN = 881;
pub const GAUGE_TOKEN_VOR2_GS_NEEDLE: GAUGE_TOKEN = 882;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_ANTI_ICE_POS: GAUGE_TOKEN = 883;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_ANTI_ICE_POS: GAUGE_TOKEN = 884;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_ANTI_ICE_POS: GAUGE_TOKEN = 885;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_ANTI_ICE_POS: GAUGE_TOKEN = 886;
pub const GAUGE_TOKEN_ENGINE1_ON_FIRE: GAUGE_TOKEN = 887;
pub const GAUGE_TOKEN_ENGINE2_ON_FIRE: GAUGE_TOKEN = 888;
pub const GAUGE_TOKEN_ENGINE3_ON_FIRE: GAUGE_TOKEN = 889;
pub const GAUGE_TOKEN_ENGINE4_ON_FIRE: GAUGE_TOKEN = 890;
pub const GAUGE_TOKEN_ENGINE1_FUEL_PUMP_ON: GAUGE_TOKEN = 891;
pub const GAUGE_TOKEN_ENGINE2_FUEL_PUMP_ON: GAUGE_TOKEN = 892;
pub const GAUGE_TOKEN_ENGINE3_FUEL_PUMP_ON: GAUGE_TOKEN = 893;
pub const GAUGE_TOKEN_ENGINE4_FUEL_PUMP_ON: GAUGE_TOKEN = 894;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_FUEL_VALVE: GAUGE_TOKEN = 895;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_FUEL_VALVE: GAUGE_TOKEN = 896;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_FUEL_VALVE: GAUGE_TOKEN = 897;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_FUEL_VALVE: GAUGE_TOKEN = 898;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_FUEL_PRESSURE: GAUGE_TOKEN = 899;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_FUEL_PRESSURE: GAUGE_TOKEN = 900;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_FUEL_PRESSURE: GAUGE_TOKEN = 901;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_FUEL_PRESSURE: GAUGE_TOKEN = 902;
pub const GAUGE_TOKEN_WATER_RUDDER_ON: GAUGE_TOKEN = 903;
pub const GAUGE_TOKEN_PROP_DEICE_SWITCH: GAUGE_TOKEN = 904;
pub const GAUGE_TOKEN_STRUCTURAL_DEICE_SWITCH: GAUGE_TOKEN = 905;
pub const GAUGE_TOKEN_FUEL_TANK_SELECTOR_2: GAUGE_TOKEN = 906;
pub const GAUGE_TOKEN_TRAILING_EDGE_FLAPS0_LEFT_ANGLE: GAUGE_TOKEN = 907;
pub const GAUGE_TOKEN_TRAILING_EDGE_FLAPS0_RIGHT_ANGLE: GAUGE_TOKEN = 908;
pub const GAUGE_TOKEN_ALTERNATE_STATIC_AIR_OPEN: GAUGE_TOKEN = 909;
pub const GAUGE_TOKEN_AILERON_TRIM_PCT: GAUGE_TOKEN = 910;
pub const GAUGE_TOKEN_RUDDER_TRIM_PCT: GAUGE_TOKEN = 911;
pub const GAUGE_TOKEN_LIGHT_NAV_ON: GAUGE_TOKEN = 912;
pub const GAUGE_TOKEN_LIGHT_BEACON_ON: GAUGE_TOKEN = 913;
pub const GAUGE_TOKEN_LIGHT_LANDING_ON: GAUGE_TOKEN = 914;
pub const GAUGE_TOKEN_LIGHT_TAXI_ON: GAUGE_TOKEN = 915;
pub const GAUGE_TOKEN_LIGHT_STROBE_ON: GAUGE_TOKEN = 916;
pub const GAUGE_TOKEN_LIGHT_PANEL_ON: GAUGE_TOKEN = 917;
pub const GAUGE_TOKEN_LIGHT_RECOGNITION_ON: GAUGE_TOKEN = 918;
pub const GAUGE_TOKEN_LIGHT_WING_ON: GAUGE_TOKEN = 919;
pub const GAUGE_TOKEN_LIGHT_LOGO_ON: GAUGE_TOKEN = 920;
pub const GAUGE_TOKEN_LIGHT_CABIN_ON: GAUGE_TOKEN = 921;
pub const GAUGE_TOKEN_TOTAL_VELOCITY: GAUGE_TOKEN = 922;
pub const GAUGE_TOKEN_TOTAL_WORLD_VELOCITY: GAUGE_TOKEN = 923;
pub const GAUGE_TOKEN_VARIOMETER_RATE: GAUGE_TOKEN = 924;
pub const GAUGE_TOKEN_VARIOMETER_SWITCH: GAUGE_TOKEN = 925;
pub const GAUGE_TOKEN_RELATIVE_WIND_VELOCITY_BODY_X: GAUGE_TOKEN = 926;
pub const GAUGE_TOKEN_RELATIVE_WIND_VELOCITY_BODY_Y: GAUGE_TOKEN = 927;
pub const GAUGE_TOKEN_RELATIVE_WIND_VELOCITY_BODY_Z: GAUGE_TOKEN = 928;
pub const GAUGE_TOKEN_ACCELERATION_WORLD_X: GAUGE_TOKEN = 929;
pub const GAUGE_TOKEN_ACCELERATION_WORLD_Y: GAUGE_TOKEN = 930;
pub const GAUGE_TOKEN_ACCELERATION_WORLD_Z: GAUGE_TOKEN = 931;
pub const GAUGE_TOKEN_ACCELERATION_BODY_X: GAUGE_TOKEN = 932;
pub const GAUGE_TOKEN_ACCELERATION_BODY_Y: GAUGE_TOKEN = 933;
pub const GAUGE_TOKEN_ACCELERATION_BODY_Z: GAUGE_TOKEN = 934;
pub const GAUGE_TOKEN_PLANE_ALT_ABOVE_GROUND: GAUGE_TOKEN = 935;
pub const GAUGE_TOKEN_MAGNETIC_COMPASS: GAUGE_TOKEN = 936;
pub const GAUGE_TOKEN_TURN_INDICATOR_RATE: GAUGE_TOKEN = 937;
pub const GAUGE_TOKEN_TURN_INDICATOR_SWITCH: GAUGE_TOKEN = 938;
pub const GAUGE_TOKEN_BRAKE_DEPENDENT_HYDRAULIC_PRESSURE: GAUGE_TOKEN = 939;
pub const GAUGE_TOKEN_FLY_BY_WIRE_ELAC_SWITCH: GAUGE_TOKEN = 940;
pub const GAUGE_TOKEN_FLY_BY_WIRE_FAC_SWITCH: GAUGE_TOKEN = 941;
pub const GAUGE_TOKEN_FLY_BY_WIRE_SEC_SWITCH: GAUGE_TOKEN = 942;
pub const GAUGE_TOKEN_FLY_BY_WIRE_ELAC_FAILED: GAUGE_TOKEN = 943;
pub const GAUGE_TOKEN_FLY_BY_WIRE_FAC_FAILED: GAUGE_TOKEN = 944;
pub const GAUGE_TOKEN_FLY_BY_WIRE_SEC_FAILED: GAUGE_TOKEN = 945;
pub const GAUGE_TOKEN_GEAR_EMERGENCY_HANDLE_POSITION: GAUGE_TOKEN = 946;
pub const GAUGE_TOKEN_GEAR_WARNING: GAUGE_TOKEN = 947;
pub const GAUGE_TOKEN_TAILWHEEL_LOCK_ON: GAUGE_TOKEN = 948;
pub const GAUGE_TOKEN_ANTISKID_BRAKES_ACTIVE: GAUGE_TOKEN = 949;
pub const GAUGE_TOKEN_RETRACT_FLOAT_SWITCH: GAUGE_TOKEN = 950;
pub const GAUGE_TOKEN_STEER_INPUT_CONTROL: GAUGE_TOKEN = 951;
pub const GAUGE_TOKEN_STALL_ALPHA: GAUGE_TOKEN = 952;
pub const GAUGE_TOKEN_DECISION_ALTITUDE_MSL: GAUGE_TOKEN = 954;
pub const GAUGE_TOKEN_WATER_BALLAST_VALVE: GAUGE_TOKEN = 955;
pub const GAUGE_TOKEN_AUTOPILOT_RPM_HOLD: GAUGE_TOKEN = 956;
pub const GAUGE_TOKEN_AUTOPILOT_PITCH_HOLD_REF: GAUGE_TOKEN = 957;
pub const GAUGE_TOKEN_AUTOPILOT_MAX_BANK: GAUGE_TOKEN = 958;
pub const GAUGE_TOKEN_PROP_FEATHER_SWITCH: GAUGE_TOKEN = 959;
pub const GAUGE_TOKEN_MASTER_IGNITION_SWITCH: GAUGE_TOKEN = 960;
pub const GAUGE_TOKEN_BLEED_AIR_SOURCE_CONTROL: GAUGE_TOKEN = 961;
pub const GAUGE_TOKEN_STRUCTURAL_ICE_PCT: GAUGE_TOKEN = 962;
pub const GAUGE_TOKEN_ROTOR_BRAKE_HANDLE_POS: GAUGE_TOKEN = 963;
pub const GAUGE_TOKEN_ROTOR_BRAKE_ACTIVE: GAUGE_TOKEN = 964;
pub const GAUGE_TOKEN_ROTOR_CLUTCH_SWITCH_POS: GAUGE_TOKEN = 965;
pub const GAUGE_TOKEN_ROTOR_CLUTCH_ACTIVE: GAUGE_TOKEN = 966;
pub const GAUGE_TOKEN_ROTOR_GOV_SWITCH_POS: GAUGE_TOKEN = 967;
pub const GAUGE_TOKEN_ROTOR_GOV_ACTIVE: GAUGE_TOKEN = 968;
pub const GAUGE_TOKEN_ROTOR_LATERAL_TRIM_PCT: GAUGE_TOKEN = 969;
pub const GAUGE_TOKEN_DISK_PITCH_ANGLE: GAUGE_TOKEN = 970;
pub const GAUGE_TOKEN_DISK_BANK_ANGLE: GAUGE_TOKEN = 971;
pub const GAUGE_TOKEN_DISK_PITCH_PCT: GAUGE_TOKEN = 972;
pub const GAUGE_TOKEN_DISK_BANK_PCT: GAUGE_TOKEN = 973;
pub const GAUGE_TOKEN_TOW_RELEASE_HANDLE: GAUGE_TOKEN = 974;
pub const GAUGE_TOKEN_APU_PCT_RPM: GAUGE_TOKEN = 975;
pub const GAUGE_TOKEN_APU_PCT_STARTER: GAUGE_TOKEN = 976;
pub const GAUGE_TOKEN_APU_VOLTS: GAUGE_TOKEN = 977;
pub const GAUGE_TOKEN_APU_GENERATOR_SWITCH: GAUGE_TOKEN = 978;
pub const GAUGE_TOKEN_APU_GENERATOR_ACTIVE: GAUGE_TOKEN = 979;
pub const GAUGE_TOKEN_APU_ON_FIRE_DETECTED: GAUGE_TOKEN = 980;
pub const GAUGE_TOKEN_PRESSURIZATION_CABIN_ALTITUDE: GAUGE_TOKEN = 981;
pub const GAUGE_TOKEN_PRESSURIZATION_CABIN_ALTITUDE_GOAL: GAUGE_TOKEN = 982;
pub const GAUGE_TOKEN_PRESSURIZATION_CABIN_ALTITUDE_RATE: GAUGE_TOKEN = 983;
pub const GAUGE_TOKEN_PRESSURIZATION_PRESSURE_DIFFERENTIAL: GAUGE_TOKEN = 984;
pub const GAUGE_TOKEN_PRESSURIZATION_DUMP_SWITCH: GAUGE_TOKEN = 985;
pub const GAUGE_TOKEN_FIRE_BOTTLE_SWITCH: GAUGE_TOKEN = 986;
pub const GAUGE_TOKEN_FIRE_BOTTLE_DISCHARGED: GAUGE_TOKEN = 987;
pub const GAUGE_TOKEN_CABIN_NO_SMOKING_ALERT_SWITCH: GAUGE_TOKEN = 988;
pub const GAUGE_TOKEN_CABIN_SEATBELTS_ALERT_SWITCH: GAUGE_TOKEN = 989;
pub const GAUGE_TOKEN_GPWS_WARNING: GAUGE_TOKEN = 990;
pub const GAUGE_TOKEN_GPWS_SYSTEM_ACTIVE: GAUGE_TOKEN = 991;
pub const GAUGE_TOKEN_IS_LATITUDE_LONGITUDE_FREEZE_ON: GAUGE_TOKEN = 992;
pub const GAUGE_TOKEN_IS_ALTITUDE_FREEZE_ON: GAUGE_TOKEN = 993;
pub const GAUGE_TOKEN_NOSEWHEEL_LOCK_ON: GAUGE_TOKEN = 994;
pub const GAUGE_TOKEN_PAYLOAD_STATION_NUM_SIMOBJECTS: GAUGE_TOKEN = 995;
pub const GAUGE_TOKEN_FOLDING_WING_HANDLE_POSITION: GAUGE_TOKEN = 996;
pub const GAUGE_TOKEN_TAILHOOK_HANDLE: GAUGE_TOKEN = 997;
pub const GAUGE_TOKEN_LAUNCHBAR_POSITION: GAUGE_TOKEN = 998;
pub const GAUGE_TOKEN_LAUNCHBAR_SWITCH: GAUGE_TOKEN = 999;
pub const GAUGE_TOKEN_LAUNCHBAR_HELD_EXTENDED: GAUGE_TOKEN = 1000;
pub const GAUGE_TOKEN_AUTOPILOT_PITCH_HOLD: GAUGE_TOKEN = 1001;
pub const GAUGE_TOKEN_NUMBER_OF_CATAPULTS: GAUGE_TOKEN = 1002;
pub const GAUGE_TOKEN_HOLDBACK_BAR_INSTALLED: GAUGE_TOKEN = 1003;
pub const GAUGE_TOKEN_BLAST_SHIELD_POSITION: GAUGE_TOKEN = 1004;
pub const GAUGE_TOKEN_CATAPULT_STROKE_POSITION: GAUGE_TOKEN = 1005;
pub const GAUGE_TOKEN_RECIP_ENG_DETONATING: GAUGE_TOKEN = 1006;
pub const GAUGE_TOKEN_RECIP_ENG_CYLINDER_HEALTH: GAUGE_TOKEN = 1007;
pub const GAUGE_TOKEN_RECIP_ENG_NUM_CYLINDERS: GAUGE_TOKEN = 1008;
pub const GAUGE_TOKEN_RECIP_ENG_NUM_CYLINDERS_FAILED: GAUGE_TOKEN = 1009;
pub const GAUGE_TOKEN_RECIP_ENG_ANTIDETONATION_TANK_VALVE: GAUGE_TOKEN = 1010;
pub const GAUGE_TOKEN_RECIP_ENG_ANTIDETONATION_TANK_QUANTITY: GAUGE_TOKEN = 1011;
pub const GAUGE_TOKEN_RECIP_ENG_ANTIDETONATION_TANK_MAX_QUANTITY: GAUGE_TOKEN = 1012;
pub const GAUGE_TOKEN_RECIP_ENG_NITROUS_TANK_VALVE: GAUGE_TOKEN = 1013;
pub const GAUGE_TOKEN_RECIP_ENG_NITROUS_TANK_QUANTITY: GAUGE_TOKEN = 1014;
pub const GAUGE_TOKEN_RECIP_ENG_NITROUS_TANK_MAX_QUANTITY: GAUGE_TOKEN = 1015;
pub const GAUGE_TOKEN_TURB_ENG_AFTERBURNER_STAGE_ACTIVE: GAUGE_TOKEN = 1016;
pub const GAUGE_TOKEN_TURB_ENG_AFTERBURNER_PCT_ACTIVE: GAUGE_TOKEN = 1017;
pub const GAUGE_TOKEN_FUEL_DUMP_SWITCH: GAUGE_TOKEN = 1018;
pub const GAUGE_TOKEN_FUEL_DUMP_ACTIVE: GAUGE_TOKEN = 1019;
pub const GAUGE_TOKEN_COLLECTIVE_POSITION: GAUGE_TOKEN = 1020;
pub const GAUGE_TOKEN_IS_ATTITUDE_FREEZE_ON: GAUGE_TOKEN = 1021;
pub const GAUGE_TOKEN_NUM_SLING_CABLES: GAUGE_TOKEN = 1022;
pub const GAUGE_TOKEN_SLING_OBJECT_ATTACHED: GAUGE_TOKEN = 1023;
pub const GAUGE_TOKEN_SLING_CABLE_BROKEN: GAUGE_TOKEN = 1024;
pub const GAUGE_TOKEN_SLING_CABLE_EXTENDED_LENGTH: GAUGE_TOKEN = 1025;
pub const GAUGE_TOKEN_SLING_ACTIVE_PAYLOAD_STATION: GAUGE_TOKEN = 1026;
pub const GAUGE_TOKEN_SLING_HOIST_PERCENT_DEPLOYED: GAUGE_TOKEN = 1027;
pub const GAUGE_TOKEN_SLING_HOIST_SWITCH: GAUGE_TOKEN = 1028;
pub const GAUGE_TOKEN_SLING_HOOK_IN_PICKUP_MODE: GAUGE_TOKEN = 1029;
pub const GAUGE_TOKEN_CABLE_CAUGHT_BY_TAILHOOK: GAUGE_TOKEN = 1030;
pub const GAUGE_TOKEN_ADF_VOLUME: GAUGE_TOKEN = 1031;
pub const GAUGE_TOKEN_AILERON_TRIM_DISABLED: GAUGE_TOKEN = 1032;
pub const GAUGE_TOKEN_ALTERNATOR_BREAKER_PULLED: GAUGE_TOKEN = 1033;
pub const GAUGE_TOKEN_ALTERNATOR_CONNECTION_ON: GAUGE_TOKEN = 1034;
pub const GAUGE_TOKEN_ANIMATION_DELTA_TIME: GAUGE_TOKEN = 1035;
pub const GAUGE_TOKEN_ANNUNCIATOR_SWITCH: GAUGE_TOKEN = 1036;
pub const GAUGE_TOKEN_APU_BLEED_PRESSURE_RECEIVED_BY_ENGINE: GAUGE_TOKEN = 1037;
pub const GAUGE_TOKEN_APU_SWITCH: GAUGE_TOKEN = 1038;
pub const GAUGE_TOKEN_ATC_AIRPORT_IS_TOWERED: GAUGE_TOKEN = 1039;
pub const GAUGE_TOKEN_ATC_CLEARED_LANDING: GAUGE_TOKEN = 1040;
pub const GAUGE_TOKEN_ATC_CLEARED_TAKEOFF: GAUGE_TOKEN = 1041;
pub const GAUGE_TOKEN_ATC_CLEARED_TAXI: GAUGE_TOKEN = 1042;
pub const GAUGE_TOKEN_ATC_RUNWAY_AIRPORT_NAME: GAUGE_TOKEN = 1043;
pub const GAUGE_TOKEN_ATC_RUNWAY_DISTANCE: GAUGE_TOKEN = 1044;
pub const GAUGE_TOKEN_ATC_RUNWAY_END_DISTANCE: GAUGE_TOKEN = 1045;
pub const GAUGE_TOKEN_ATC_RUNWAY_HEADING_DEGREES_TRUE: GAUGE_TOKEN = 1046;
pub const GAUGE_TOKEN_ATC_RUNWAY_LENGTH: GAUGE_TOKEN = 1047;
pub const GAUGE_TOKEN_ATC_RUNWAY_RELATIVE_POSITION_X: GAUGE_TOKEN = 1048;
pub const GAUGE_TOKEN_ATC_RUNWAY_RELATIVE_POSITION_Y: GAUGE_TOKEN = 1049;
pub const GAUGE_TOKEN_ATC_RUNWAY_RELATIVE_POSITION_Z: GAUGE_TOKEN = 1050;
pub const GAUGE_TOKEN_ATC_RUNWAY_SELECTED: GAUGE_TOKEN = 1051;
pub const GAUGE_TOKEN_ATC_RUNWAY_START_DISTANCE: GAUGE_TOKEN = 1052;
pub const GAUGE_TOKEN_ATC_RUNWAY_TDPOINT_RELATIVE_POSITION_X: GAUGE_TOKEN = 1053;
pub const GAUGE_TOKEN_ATC_RUNWAY_TDPOINT_RELATIVE_POSITION_Y: GAUGE_TOKEN = 1054;
pub const GAUGE_TOKEN_ATC_RUNWAY_TDPOINT_RELATIVE_POSITION_Z: GAUGE_TOKEN = 1055;
pub const GAUGE_TOKEN_ATC_RUNWAY_WIDTH: GAUGE_TOKEN = 1056;
pub const GAUGE_TOKEN_AUDIO_PANEL_VOLUME: GAUGE_TOKEN = 1057;
pub const GAUGE_TOKEN_AUTOBRAKES_ACTIVE: GAUGE_TOKEN = 1058;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_MAX_CALCULATED: GAUGE_TOKEN = 1059;
pub const GAUGE_TOKEN_AUTOPILOT_AIRSPEED_MIN_CALCULATED: GAUGE_TOKEN = 1060;
pub const GAUGE_TOKEN_AUTOPILOT_ALTITUDE_ARM: GAUGE_TOKEN = 1061;
pub const GAUGE_TOKEN_AUTOPILOT_ALTITUDE_SLOT_INDEX: GAUGE_TOKEN = 1062;
pub const GAUGE_TOKEN_AUTOPILOT_APPROACH_ACTIVE: GAUGE_TOKEN = 1063;
pub const GAUGE_TOKEN_AUTOPILOT_APPROACH_ARM: GAUGE_TOKEN = 1064;
pub const GAUGE_TOKEN_AUTOPILOT_APPROACH_CAPTURED: GAUGE_TOKEN = 1065;
pub const GAUGE_TOKEN_AUTOPILOT_APPROACH_IS_LOCALIZER: GAUGE_TOKEN = 1065;
pub const GAUGE_TOKEN_AUTOPILOT_BANK_MODE: GAUGE_TOKEN = 1066;
pub const GAUGE_TOKEN_AUTOPILOT_DISENGAGED: GAUGE_TOKEN = 1067;
pub const GAUGE_TOKEN_AUTOPILOT_GLIDESLOPE_ACTIVE: GAUGE_TOKEN = 1068;
pub const GAUGE_TOKEN_AUTOPILOT_GLIDESLOPE_ARM: GAUGE_TOKEN = 1069;
pub const GAUGE_TOKEN_AUTOPILOT_HEADING_SLOT_INDEX: GAUGE_TOKEN = 1070;
pub const GAUGE_TOKEN_AUTOPILOT_MANAGED_INDEX: GAUGE_TOKEN = 1071;
pub const GAUGE_TOKEN_AUTOPILOT_MANAGED_SPEED_IN_MACH: GAUGE_TOKEN = 1072;
pub const GAUGE_TOKEN_AUTOPILOT_MANAGED_THROTTLE_ACTIVE: GAUGE_TOKEN = 1073;
pub const GAUGE_TOKEN_AUTOPILOT_MAX_BANK_ID: GAUGE_TOKEN = 1074;
pub const GAUGE_TOKEN_AUTOPILOT_RPM_SLOT_INDEX: GAUGE_TOKEN = 1075;
pub const GAUGE_TOKEN_AUTOPILOT_SPEED_SLOT_INDEX: GAUGE_TOKEN = 1076;
pub const GAUGE_TOKEN_AUTOPILOT_THROTTLE_MAX_THRUST: GAUGE_TOKEN = 1077;
pub const GAUGE_TOKEN_AUTOPILOT_VS_SLOT_INDEX: GAUGE_TOKEN = 1078;
pub const GAUGE_TOKEN_BAGGAGELOADER_ANGLE_CURRENT: GAUGE_TOKEN = 1079;
pub const GAUGE_TOKEN_BAGGAGELOADER_ANGLE_TARGET: GAUGE_TOKEN = 1080;
pub const GAUGE_TOKEN_BAGGAGELOADER_END_RAMP_Y: GAUGE_TOKEN = 1081;
pub const GAUGE_TOKEN_BAGGAGELOADER_END_RAMP_Z: GAUGE_TOKEN = 1082;
pub const GAUGE_TOKEN_BAGGAGELOADER_PIVOT_Y: GAUGE_TOKEN = 1083;
pub const GAUGE_TOKEN_BAGGAGELOADER_PIVOT_Z: GAUGE_TOKEN = 1084;
pub const GAUGE_TOKEN_BATTERY_BREAKER_PULLED: GAUGE_TOKEN = 1085;
pub const GAUGE_TOKEN_BATTERY_CONNECTION_ON: GAUGE_TOKEN = 1086;
pub const GAUGE_TOKEN_BLEED_AIR_APU: GAUGE_TOKEN = 1087;
pub const GAUGE_TOKEN_BLEED_AIR_ENGINE: GAUGE_TOKEN = 1088;
pub const GAUGE_TOKEN_BOARDINGRAMP_ELEVATION_CURRENT: GAUGE_TOKEN = 1089;
pub const GAUGE_TOKEN_BOARDINGRAMP_ELEVATION_TARGET: GAUGE_TOKEN = 1090;
pub const GAUGE_TOKEN_BOARDINGRAMP_END_POSITION_Y: GAUGE_TOKEN = 1091;
pub const GAUGE_TOKEN_BOARDINGRAMP_END_POSITION_Z: GAUGE_TOKEN = 1092;
pub const GAUGE_TOKEN_BOARDINGRAMP_ORIENTATION_CURRENT: GAUGE_TOKEN = 1093;
pub const GAUGE_TOKEN_BOARDINGRAMP_ORIENTATION_TARGET: GAUGE_TOKEN = 1094;
pub const GAUGE_TOKEN_BOARDINGRAMP_START_POSITION_Y: GAUGE_TOKEN = 1095;
pub const GAUGE_TOKEN_BOARDINGRAMP_START_POSITION_Z: GAUGE_TOKEN = 1096;
pub const GAUGE_TOKEN_BRAKES_LEFT_POS_EX1: GAUGE_TOKEN = 1097;
pub const GAUGE_TOKEN_BRAKES_RIGHT_POS_EX1: GAUGE_TOKEN = 1098;
pub const GAUGE_TOKEN_BREAKER_ADF: GAUGE_TOKEN = 1099;
pub const GAUGE_TOKEN_BREAKER_ALTFLD: GAUGE_TOKEN = 1100;
pub const GAUGE_TOKEN_BREAKER_AUTOPILOT: GAUGE_TOKEN = 1101;
pub const GAUGE_TOKEN_BREAKER_AVNBUS1: GAUGE_TOKEN = 1102;
pub const GAUGE_TOKEN_BREAKER_AVNBUS2: GAUGE_TOKEN = 1103;
pub const GAUGE_TOKEN_BREAKER_AVNFAN: GAUGE_TOKEN = 1104;
pub const GAUGE_TOKEN_BREAKER_FLAP: GAUGE_TOKEN = 1105;
pub const GAUGE_TOKEN_BREAKER_GPS: GAUGE_TOKEN = 1106;
pub const GAUGE_TOKEN_BREAKER_INST: GAUGE_TOKEN = 1107;
pub const GAUGE_TOKEN_BREAKER_INSTLTS: GAUGE_TOKEN = 1108;
pub const GAUGE_TOKEN_BREAKER_LTS_PWR: GAUGE_TOKEN = 1109;
pub const GAUGE_TOKEN_BREAKER_NAVCOM1: GAUGE_TOKEN = 1110;
pub const GAUGE_TOKEN_BREAKER_NAVCOM2: GAUGE_TOKEN = 1111;
pub const GAUGE_TOKEN_BREAKER_NAVCOM3: GAUGE_TOKEN = 1112;
pub const GAUGE_TOKEN_BREAKER_TURNCOORD: GAUGE_TOKEN = 1113;
pub const GAUGE_TOKEN_BREAKER_WARN: GAUGE_TOKEN = 1114;
pub const GAUGE_TOKEN_BREAKER_XPNDR: GAUGE_TOKEN = 1115;
pub const GAUGE_TOKEN_BUS_BREAKER_PULLED: GAUGE_TOKEN = 1116;
pub const GAUGE_TOKEN_BUS_CONNECTION_ON: GAUGE_TOKEN = 1117;
pub const GAUGE_TOKEN_BUS_LOOKUP_INDEX: GAUGE_TOKEN = 1118;
pub const GAUGE_TOKEN_CATERINGTRUCK_AIRCRAFT_DOOR_CONTACT_OFFSET_Z: GAUGE_TOKEN = 1119;
pub const GAUGE_TOKEN_CATERINGTRUCK_ELEVATION_CURRENT: GAUGE_TOKEN = 1120;
pub const GAUGE_TOKEN_CATERINGTRUCK_ELEVATION_TARGET: GAUGE_TOKEN = 1121;
pub const GAUGE_TOKEN_CATERINGTRUCK_OPENING_CURRENT: GAUGE_TOKEN = 1122;
pub const GAUGE_TOKEN_CATERINGTRUCK_OPENING_TARGET: GAUGE_TOKEN = 1123;
pub const GAUGE_TOKEN_CIRCUIT_BREAKER_PULLED: GAUGE_TOKEN = 1124;
pub const GAUGE_TOKEN_CIRCUIT_CONNECTION_ON: GAUGE_TOKEN = 1125;
pub const GAUGE_TOKEN_CIRCUIT_NAVCOM1_ON: GAUGE_TOKEN = 1126;
pub const GAUGE_TOKEN_CIRCUIT_NAVCOM2_ON: GAUGE_TOKEN = 1127;
pub const GAUGE_TOKEN_CIRCUIT_NAVCOM3_ON: GAUGE_TOKEN = 1128;
pub const GAUGE_TOKEN_CIRCUIT_ON: GAUGE_TOKEN = 1129;
pub const GAUGE_TOKEN_CIRCUIT_SWITCH_ON: GAUGE_TOKEN = 1130;
pub const GAUGE_TOKEN_COM1_STORED_FREQUENCY: GAUGE_TOKEN = 1131;
pub const GAUGE_TOKEN_COM2_STORED_FREQUENCY: GAUGE_TOKEN = 1132;
pub const GAUGE_TOKEN_COM3_STORED_FREQUENCY: GAUGE_TOKEN = 1133;
pub const GAUGE_TOKEN_COM_ACTIVE_FREQUENCY: GAUGE_TOKEN = 1134;
pub const GAUGE_TOKEN_COM_RECEIVE: GAUGE_TOKEN = 1135;
pub const GAUGE_TOKEN_COM_STANDBY_FREQUENCY: GAUGE_TOKEN = 1136;
pub const GAUGE_TOKEN_COM_VOLUME: GAUGE_TOKEN = 1137;
pub const GAUGE_TOKEN_COPILOT_TRANSMITTER_TYPE: GAUGE_TOKEN = 1138;
pub const GAUGE_TOKEN_COPILOT_TRANSMITTING: GAUGE_TOKEN = 1139;
pub const GAUGE_TOKEN_ELEVATOR_TRIM_DISABLED: GAUGE_TOKEN = 1140;
pub const GAUGE_TOKEN_ELEVATOR_TRIM_NEUTRAL: GAUGE_TOKEN = 1141;
pub const GAUGE_TOKEN_ELT_ACTIVE: GAUGE_TOKEN = 1142;
pub const GAUGE_TOKEN_EXTERNAL_POWER_AVAILABLE: GAUGE_TOKEN = 1143;
pub const GAUGE_TOKEN_EXTERNAL_POWER_BREAKER_PULLED: GAUGE_TOKEN = 1144;
pub const GAUGE_TOKEN_EXTERNAL_POWER_CONNECTION_ON: GAUGE_TOKEN = 1145;
pub const GAUGE_TOKEN_EXTERNAL_POWER_ON: GAUGE_TOKEN = 1146;
pub const GAUGE_TOKEN_FLIGHT_DIRECTOR_BANK_EX1: GAUGE_TOKEN = 1147;
pub const GAUGE_TOKEN_FLIGHT_DIRECTOR_PITCH_EX1: GAUGE_TOKEN = 1148;
pub const GAUGE_TOKEN_FUELSYSTEM_ENGINE_PRESSURE: GAUGE_TOKEN = 1149;
pub const GAUGE_TOKEN_FUELSYSTEM_JUNCTION_SETTING: GAUGE_TOKEN = 1150;
pub const GAUGE_TOKEN_FUELSYSTEM_LINE_FUEL_FLOW: GAUGE_TOKEN = 1151;
pub const GAUGE_TOKEN_FUELSYSTEM_LINE_FUEL_LEVEL: GAUGE_TOKEN = 1152;
pub const GAUGE_TOKEN_FUELSYSTEM_LINE_FUEL_PRESSURE: GAUGE_TOKEN = 1153;
pub const GAUGE_TOKEN_FUELSYSTEM_PUMP_ACTIVE: GAUGE_TOKEN = 1154;
pub const GAUGE_TOKEN_FUELSYSTEM_PUMP_SWITCH: GAUGE_TOKEN = 1155;
pub const GAUGE_TOKEN_FUELSYSTEM_TANK_CAPACITY: GAUGE_TOKEN = 1156;
pub const GAUGE_TOKEN_FUELSYSTEM_TANK_LEVEL: GAUGE_TOKEN = 1157;
pub const GAUGE_TOKEN_FUELSYSTEM_TANK_QUANTITY: GAUGE_TOKEN = 1158;
pub const GAUGE_TOKEN_FUELSYSTEM_TANK_WEIGHT: GAUGE_TOKEN = 1159;
pub const GAUGE_TOKEN_FUELSYSTEM_TRIGGER_STATUS: GAUGE_TOKEN = 1160;
pub const GAUGE_TOKEN_FUELSYSTEM_VALVE_OPEN: GAUGE_TOKEN = 1161;
pub const GAUGE_TOKEN_FUELSYSTEM_VALVE_SWITCH: GAUGE_TOKEN = 1162;
pub const GAUGE_TOKEN_FUELTRUCK_HOSE_DEPLOYED: GAUGE_TOKEN = 1163;
pub const GAUGE_TOKEN_FUELTRUCK_HOSE_END_POSX: GAUGE_TOKEN = 1164;
pub const GAUGE_TOKEN_FUELTRUCK_HOSE_END_POSZ: GAUGE_TOKEN = 1165;
pub const GAUGE_TOKEN_FUELTRUCK_HOSE_END_RELATIVE_HEADING: GAUGE_TOKEN = 1166;
pub const GAUGE_TOKEN_FUEL_TRANSFERT_PUMP_ON: GAUGE_TOKEN = 1167;
pub const GAUGE_TOKEN_GENERAL_ENGINE1_THROTTLE_MANAGED_MODE: GAUGE_TOKEN = 1168;
pub const GAUGE_TOKEN_GENERAL_ENGINE2_THROTTLE_MANAGED_MODE: GAUGE_TOKEN = 1169;
pub const GAUGE_TOKEN_GENERAL_ENGINE3_THROTTLE_MANAGED_MODE: GAUGE_TOKEN = 1170;
pub const GAUGE_TOKEN_GENERAL_ENGINE4_THROTTLE_MANAGED_MODE: GAUGE_TOKEN = 1171;
pub const GAUGE_TOKEN_GENERAL_ENG_COMBUSTION_EX1: GAUGE_TOKEN = 1172;
pub const GAUGE_TOKEN_GENERAL_ENG_FUEL_PUMP_SWITCH_EX1: GAUGE_TOKEN = 1173;
pub const GAUGE_TOKEN_GENERAL_ENG_HOBBS_ELAPSED_TIME: GAUGE_TOKEN = 1174;
pub const GAUGE_TOKEN_GPS_FLIGHTPLAN_TOTAL_DISTANCE: GAUGE_TOKEN = 1175;
pub const GAUGE_TOKEN_GROUNDPOWERUNIT_HOSE_DEPLOYED: GAUGE_TOKEN = 1176;
pub const GAUGE_TOKEN_GROUNDPOWERUNIT_HOSE_END_POSX: GAUGE_TOKEN = 1177;
pub const GAUGE_TOKEN_GROUNDPOWERUNIT_HOSE_END_POSZ: GAUGE_TOKEN = 1178;
pub const GAUGE_TOKEN_GROUNDPOWERUNIT_HOSE_END_RELATIVE_HEADING: GAUGE_TOKEN = 1179;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_BANK: GAUGE_TOKEN = 1180;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_HEADING: GAUGE_TOKEN = 1181;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_LEFT_BEND: GAUGE_TOKEN = 1182;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_LEFT_DEPLOYMENT: GAUGE_TOKEN = 1183;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_RIGHT_BEND: GAUGE_TOKEN = 1184;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_RIGHT_DEPLOYMENT: GAUGE_TOKEN = 1185;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_TOP_HORIZONTAL: GAUGE_TOKEN = 1186;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_JETWAY_TOP_VERTICAL: GAUGE_TOKEN = 1187;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_OPEN: GAUGE_TOKEN = 1188;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_PITCH: GAUGE_TOKEN = 1189;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_POSX: GAUGE_TOKEN = 1190;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_POSY: GAUGE_TOKEN = 1191;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_POSZ: GAUGE_TOKEN = 1192;
pub const GAUGE_TOKEN_INTERACTIVE_POINT_TYPE: GAUGE_TOKEN = 1193;
pub const GAUGE_TOKEN_INTERCOM_MODE: GAUGE_TOKEN = 1194;
pub const GAUGE_TOKEN_INTERCOM_SYSTEM_ACTIVE: GAUGE_TOKEN = 1195;
pub const GAUGE_TOKEN_IS_ANY_INTERIOR_LIGHT_ON: GAUGE_TOKEN = 1196;
pub const GAUGE_TOKEN_JETWAY_HOOD_LEFT_BEND: GAUGE_TOKEN = 1197;
pub const GAUGE_TOKEN_JETWAY_HOOD_LEFT_DEPLOYMENT: GAUGE_TOKEN = 1198;
pub const GAUGE_TOKEN_JETWAY_HOOD_RIGHT_BEND: GAUGE_TOKEN = 1199;
pub const GAUGE_TOKEN_JETWAY_HOOD_RIGHT_DEPLOYMENT: GAUGE_TOKEN = 1200;
pub const GAUGE_TOKEN_JETWAY_HOOD_TOP_HORIZONTAL: GAUGE_TOKEN = 1201;
pub const GAUGE_TOKEN_JETWAY_HOOD_TOP_VERTICAL: GAUGE_TOKEN = 1202;
pub const GAUGE_TOKEN_JETWAY_MOVING: GAUGE_TOKEN = 1203;
pub const GAUGE_TOKEN_JETWAY_WHEEL_ORIENTATION_CURRENT: GAUGE_TOKEN = 1204;
pub const GAUGE_TOKEN_JETWAY_WHEEL_ORIENTATION_TARGET: GAUGE_TOKEN = 1205;
pub const GAUGE_TOKEN_JETWAY_WHEEL_SPEED: GAUGE_TOKEN = 1206;
pub const GAUGE_TOKEN_KOHLSMAN_SETTING_STD: GAUGE_TOKEN = 1207;
pub const GAUGE_TOKEN_LIGHT_BACKLIGHT_INTENSITY: GAUGE_TOKEN = 1208;
pub const GAUGE_TOKEN_LIGHT_GLARESHIELD: GAUGE_TOKEN = 1209;
pub const GAUGE_TOKEN_LIGHT_GYROLIGHT_INTENSITY: GAUGE_TOKEN = 1210;
pub const GAUGE_TOKEN_LIGHT_HEADLIGHT_INTENSITY: GAUGE_TOKEN = 1211;
pub const GAUGE_TOKEN_LIGHT_PEDESTRAL: GAUGE_TOKEN = 1212;
pub const GAUGE_TOKEN_LIGHT_POTENTIOMETER: GAUGE_TOKEN = 1213;
pub const GAUGE_TOKEN_MARKER_BEACON_SENSITIVITY_HIGH: GAUGE_TOKEN = 1214;
pub const GAUGE_TOKEN_MARKER_BEACON_TEST_MUTE: GAUGE_TOKEN = 1215;
pub const GAUGE_TOKEN_MISSION_SCORE: GAUGE_TOKEN = 1216;
pub const GAUGE_TOKEN_NAV_VOLUME: GAUGE_TOKEN = 1217;
pub const GAUGE_TOKEN_ON_ANY_RUNWAY: GAUGE_TOKEN = 1218;
pub const GAUGE_TOKEN_PILOT_TRANSMITTER_TYPE: GAUGE_TOKEN = 1219;
pub const GAUGE_TOKEN_PILOT_TRANSMITTING: GAUGE_TOKEN = 1220;
pub const GAUGE_TOKEN_PITOT_HEAT_SWITCH: GAUGE_TOKEN = 1221;
pub const GAUGE_TOKEN_PLANE_ALT_ABOVE_GROUND_MINUS_CG: GAUGE_TOKEN = 1222;
pub const GAUGE_TOKEN_PLANE_IN_PARKING_STATE: GAUGE_TOKEN = 1223;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_BANK_DEGREES: GAUGE_TOKEN = 1224;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_HEADING_DEGREES_MAGNETIC: GAUGE_TOKEN = 1225;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_HEADING_DEGREES_TRUE: GAUGE_TOKEN = 1226;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_LATITUDE: GAUGE_TOKEN = 1227;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_LONGITUDE: GAUGE_TOKEN = 1228;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_NORMAL_VELOCITY: GAUGE_TOKEN = 1229;
pub const GAUGE_TOKEN_PLANE_TOUCHDOWN_PITCH_DEGREES: GAUGE_TOKEN = 1230;
pub const GAUGE_TOKEN_PUSHBACK_ATTACHED: GAUGE_TOKEN = 1231;
pub const GAUGE_TOKEN_PUSHBACK_AVAILABLE: GAUGE_TOKEN = 1232;
pub const GAUGE_TOKEN_RECIP_ENG_ENGINE_MASTER_SWITCH: GAUGE_TOKEN = 1233;
pub const GAUGE_TOKEN_RECIP_ENG_GLOW_PLUG_ACTIVE: GAUGE_TOKEN = 1234;
pub const GAUGE_TOKEN_REJECTED_TAKEOFF_BRAKES_ACTIVE: GAUGE_TOKEN = 1235;
pub const GAUGE_TOKEN_RUDDER_TRIM_DISABLED: GAUGE_TOKEN = 1236;
pub const GAUGE_TOKEN_SHUTOFF_VALVE_PULLED: GAUGE_TOKEN = 1237;
pub const GAUGE_TOKEN_SLOPE_TO_ATC_RUNWAY: GAUGE_TOKEN = 1238;
pub const GAUGE_TOKEN_SPEAKER_ACTIVE: GAUGE_TOKEN = 1239;
pub const GAUGE_TOKEN_TOTAL_UNUSABLE_FUEL_QUANTITY_GALLONS: GAUGE_TOKEN = 1240;
pub const GAUGE_TOKEN_TURB_ENGINE_1_COMMANDED_N1: GAUGE_TOKEN = 1241;
pub const GAUGE_TOKEN_TURB_ENGINE_1_FREE_TURBINE_TORQUE: GAUGE_TOKEN = 1242;
pub const GAUGE_TOKEN_TURB_ENGINE_1_THROTTLE_COMMANDED_N1: GAUGE_TOKEN = 1243;
pub const GAUGE_TOKEN_TURB_ENGINE_2_COMMANDED_N1: GAUGE_TOKEN = 1244;
pub const GAUGE_TOKEN_TURB_ENGINE_2_FREE_TURBINE_TORQUE: GAUGE_TOKEN = 1245;
pub const GAUGE_TOKEN_TURB_ENGINE_2_THROTTLE_COMMANDED_N1: GAUGE_TOKEN = 1246;
pub const GAUGE_TOKEN_TURB_ENGINE_3_COMMANDED_N1: GAUGE_TOKEN = 1247;
pub const GAUGE_TOKEN_TURB_ENGINE_3_FREE_TURBINE_TORQUE: GAUGE_TOKEN = 1248;
pub const GAUGE_TOKEN_TURB_ENGINE_3_THROTTLE_COMMANDED_N1: GAUGE_TOKEN = 1249;
pub const GAUGE_TOKEN_TURB_ENGINE_4_COMMANDED_N1: GAUGE_TOKEN = 1250;
pub const GAUGE_TOKEN_TURB_ENGINE_4_FREE_TURBINE_TORQUE: GAUGE_TOKEN = 1251;
pub const GAUGE_TOKEN_TURB_ENGINE_4_THROTTLE_COMMANDED_N1: GAUGE_TOKEN = 1252;
pub const GAUGE_TOKEN_TURB_ENG_IGNITION_SWITCH_EX1: GAUGE_TOKEN = 1253;
pub const GAUGE_TOKEN_TURB_ENG_IS_IGNITING: GAUGE_TOKEN = 1254;
pub const GAUGE_TOKEN_TURN_COORDINATOR_BALL_POS_INV: GAUGE_TOKEN = 1255;
pub const GAUGE_TOKEN_WAGON_BACK_LINK_LENGTH: GAUGE_TOKEN = 1256;
pub const GAUGE_TOKEN_WAGON_BACK_LINK_ORIENTATION: GAUGE_TOKEN = 1257;
pub const GAUGE_TOKEN_WAGON_BACK_LINK_START_POSZ: GAUGE_TOKEN = 1258;
pub const GAUGE_TOKEN_WAGON_FRONT_LINK_LENGTH: GAUGE_TOKEN = 1259;
pub const GAUGE_TOKEN_WAGON_FRONT_LINK_ORIENTATION: GAUGE_TOKEN = 1260;
pub const GAUGE_TOKEN_WAGON_FRONT_LINK_START_POSZ: GAUGE_TOKEN = 1261;
